Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/goldwave/*/goldwave.xliff
Languages: fi, pt_pt, ru, tr, zh_tw

source: Authors: Joseph Lee, Day Garwood, NVDA contributors.
fi: Tekijät: Joseph Lee, Day Garwood ja NVDA-yhteisön jäsenet
pt_pt: Autores: Joseph Lee, Day Garwood, colaboradores da NVDA.
ru: Авторы: Joseph Lee, Day Garwood, Участники сообщества пользователей программы NVDA.
tr: Yazarlar: Joseph Lee, Day Garwood ve NVDA'ya Katkıda Bulunanlar.
zh_tw: 作者：Joseph Lee, Day Garwood, NVDA 貢獻者。

source: This app module enhances access and usage of GoldWave audio editor.
fi: Tämä sovellusmoduuli parantaa GoldWave-äänimuokkaimen saavutettavuutta ja käytettävyyttä.
pt_pt: Este módulo de aplicativo aprimora o acesso e o uso do editor de áudio GoldWave.
ru: Это дополнения улучшает доступность использования звукового редактора GoldWave.
tr: Bu uygulama modülü GoldWave ses editörünün erişilebilirliğini ve kullanımını geliştirir.
zh_tw: 此附加元件可增進 GoldWave 音訊編輯器的存取與使用。

source: Shortcuts ##
fi: Pikanäppäimet ##
pt_pt: Atalhos ##
ru: Горячие клавиши ##
tr: Kısayollar ##
zh_tw: 快速鍵 ##

source: All commands support speech on demand mode.
fi: Kaikki komennot tukevat "pyydettäessä"-puhetilaa.
pt_pt: Todos os comandos suportam o modo de fala sob demanda.
ru: Все команды поддерживают режим речи по требованию.
tr: Tüm komutlar isteğe bağlı konuşma modunu destekler.
zh_tw: 所有指令皆支援隨選語音模式。

source: Control+Shift+P: Announces current track position.
fi: Ctrl+Vaihto+P: Ilmoittaa nykyisen kohdan raidalla.
pt_pt: Control+Shift+P: Anuncia a posição atual da trilha.
ru: Control+Shift+P: Объявить текущую позицию дорожки.
tr: Control+Shift+P: Geçerli parçadaki pozisyonu söyler.
zh_tw: Control+Shift+P：讀出目前音軌位置。

source: NVDA+Shift+R: Announces remaining time for the currently editing track.
fi: NVDA+Vaihto+R: Ilmoittaa nykyisen raidan jäljellä olevan ajan.
pt_pt: NVDA+Shift+R: Anuncia o tempo restante da trilha em edição no momento.
ru: NVDA+Shift+R: Объявить оставшееся время для текущего редактируемого трека.
tr: NVDA+Shift+r: şu anda düzenlenen dosyada kalan süreyi söyler.
zh_tw: NVDA+Shift+R：讀出目前編輯音軌的剩餘時間。

source: Control+NVDA+1: Announces the channel you are editing.
fi: Ctrl+NVDA+1: Ilmoittaa muokattavan kanavan.
pt_pt: Controle+NVDA+1: Anuncia o canal que está sendo editado.
ru: Control+NVDA+1: Объявить канал, который вы редактируете.
tr: Control+NVDA+1: Düzenlediğiniz kanalı söyler.
zh_tw: Control+NVDA+1：讀出您正在編輯的聲道。

source: Control+NVDA+2: Announces the total length of the audio file.
fi: Ctrl+NVDA+2: Ilmoittaa äänitiedoston kokonaiskeston.
pt_pt: Control+NVDA+2: Anuncia a duração total do arquivo de áudio.
ru: Control+NVDA+2: Объявить общую длину аудиофайла.
tr: Control+NVDA+2: Ses dosyasının toplam uzunluğunu söyler.
zh_tw: Control+NVDA+2：讀出音訊檔的總長度。

source: Control+NVDA+3: announces a summary on audio selection information.
fi: Ctrl+NVDA+3: Antaa yhteenvedon raidan valitun kohdan tiedoista.
pt_pt: Control+NVDA+3: anuncia um resumo das informações de seleção de áudio.
ru: Control+NVDA+3: Сводное объявление выделеной звуковой информации.
tr: Control+NVDA+3: ses seçimiyle ilgili özet bilgi verir.
zh_tw: Control+NVDA+3：讀出音訊選取資訊的摘要。

source: Control+NVDA+4: Announces the zoom level.
fi: Ctrl+NVDA+4: Ilmoittaa zoomauksen tason.
pt_pt: Control+NVDA+4: Anuncia o nível de zoom.
ru: Control+NVDA+4: Объявляет уровень.
tr: Control+NVDA+4: Yakınlaştırma seviyesini söyler.
zh_tw: Control+NVVDA+4：讀出縮放層級。

source: For more information about GoldWave and keyboard commands, refer to GoldWave Manual.
fi: Lisätietoja GoldWavesta ja sen näppäinkomennoista on sovelluksen käyttöohjeessa.
pt_pt: Para obter mais informações sobre o GoldWave e os comandos de teclado, consulte o Manual do GoldWave.
ru: Для получения дополнительной информации о GoldWave и клавиатурных командах обратитесь к руководству GoldWave.
tr: GoldWave ve klavye komutları hakkında daha fazla bilgi için, GoldWave kılavuzuna bakın.
zh_tw: 關於 GoldWave 和鍵盤指令的更多資訊，請參閱 GoldWave 手冊。

source: Note: GoldWave 6 or later and Windows 10 or later is required.
fi: Huom: Tämä lisäosa edellyttää GoldWave 6:ta tai uudempaa sekä Windows 10:tä tai uudempaa.
pt_pt: Observação: é necessário o GoldWave 6 ou posterior e o Windows 10 ou posterior.
ru: Примечание: требуется GoldWave 6 или более поздняя версия и Windows 10 или более поздняя версия.
tr: Not: GoldWave 6 veya sonrası ile Windows 10 veya sonrası sürümler gereklidir.
zh_tw: 請注意：需要 GoldWave 6 或更新版本，以及 Windows 10 或更新版本。

source: Changes
fi: Muutokset
pt_pt: Alterações
ru: Журнал изменений
tr: Değişiklikler
zh_tw: 變更

source: Version 25.08.1
fi: Versio 25.08.1
pt_pt: Versão 25.08.1
ru: Изменения в версии 25.08.1
tr: Sürüm 25.08.1
zh_tw: 25.08.1 版

source: Fixed bugs regarding position and selection time announcements.
fi: Korjattu virheitä, jotka liittyivät sijainnin ja valitun ajan ilmoituksiin.
pt_pt: Corrigidos erros relacionados aos anúncios de posição e tempo de seleção.
ru: Исправлены ошибки, связанные с объявлением местоположения и времени выделения.
tr: Konum ve seçim süresi söylenmesi ile ilgili hatalar düzeltildi.
zh_tw: 修正了關於位置與讀出選取時間的錯誤。

source: Version 25.07
fi: Versio 25.07
pt_pt: Versão 25.07
ru: Изменения в версии 25.07
tr: Sürüm 25.07
zh_tw: 25.07 版

source: Made the add-on code more robust with help from Pyright (a Python static type checker).
fi: Lisäosan koodin vakautta ja virheensietoa parannettu Pyrightin (Pythonin staattisen tyypintarkistustyökalun) avulla.
pt_pt: Tornou o código do complemento mais robusto com a ajuda do Pyright (um verificador de tipos estáticos do Python).
ru: Код дополнения стал более надёжным с помощью Pyright (проверкой статического типа Python).
tr: Eklenti kodu Pyright'ın (Python statik tip denetleyicisi) yardımıyla daha sağlam hale getirildi.
zh_tw: 在 Pyright (一個 Python 靜態類型檢查器) 的幫助下，使附加元件的程式碼更為穩健。

source: Improved audio selection, zoom level, and track position announcements in GoldWave 7.
fi: Paranneltu äänen valinnan, zoomaustason ja raidan nykyisen kohdan ilmoituksia GoldWave 7:ssä.
pt_pt: Anúncios aprimorados de seleção de áudio, nível de zoom e posição da trilha no GoldWave 7.
ru: Улучшены выделение звука, уровень и объявления позиции дорожки в GoldWave 7.
tr: Goldwave 7'de gelişmiş ses seçimi, yakınlaştırma seviyesi ve Kanal pozisyonu duyuruları.
zh_tw: 改善了 GoldWave 7 中的音訊選取、縮放層級及音軌位置的報讀。

source: Version 25.04
fi: Versio 25.04
pt_pt: Versão 25.04
ru: Изменения в версии 25.04
tr: Sürüm 25.04
zh_tw: 25.04 版

source: Removed command announcement mode, replaced with speech on demand mode. In speech on demand mode, GoldWave specific commands such as setting start marker will stay silent while informational commands such as audio position will be spoken.
fi: Komentojen ilmoitustila on korvattu "pyydettäessä"-puhetilalla. Tässä tilassa GoldWaven komennoista, kuten aloitusmerkin määrittämisestä, ei anneta puhepalautetta, mutta tietoa antavat komennot, kuten toistokohdan sijainti, puhutaan.
pt_pt: Removido o modo de anúncio de comando, substituído pelo modo de fala sob demanda. No modo de fala sob demanda, os comandos específicos do GoldWave, como a definição do marcador de início, permanecerão em silêncio, enquanto os comandos informativos, como a posição do áudio, serão falados.
ru: Убран режим объявления команды, заменен режимом речи по требованию. В режиме речи по требованию, конкретные команды Goldwave, такие как настройка начального маркера, объявляться не будут, в то время как будут произнесены информационные команды, такие как позиция аудио.
tr: Komut duyuru modu kaldırıldı, isteğe bağlı konuşma moduyla değiştirildi. İsteğe bağlı konuşma modunda, GoldWave'e özgü komutlar, başlangıç işaretçisini ayarlama gibi sessiz kalırken, ses konumu gibi bilgilendirici komutlar seslendirilir.
zh_tw: 移除了讀出指令模式，並以隨選朗讀模式取代。在隨選朗讀模式中，GoldWave 的特定指令例如設定起始標記會保持靜默，而資訊型指令例如音訊位置則會被讀出。

source: Version 25.02
fi: Versio 25.02
pt_pt: Versão 25.02
ru: Изменения в версии 25.02
tr: Sürüm 25.02
zh_tw: 25.02 版

source: NVDA 2024.1 or later is required.
fi: Edellyttää NVDA 2024.1:tä tai uudempaa.
pt_pt: É necessário o NVDA 2024.1 ou posterior.
ru: Требуется NVDA 2024.1 или более поздняя версия.
tr: NVDA 2024.1 veya üstü gereklidir.
zh_tw: 需要 NVDA 2024.1 或更新版本。

source: Restored limited support for Windows 8.1.
fi: Palautettu rajoitettu tuki Windows 8.1:lle.
pt_pt: Suporte limitado restaurado para o Windows 8.1.
ru: Восстановлена ​​ограниченная поддержка для Windows 8.1.
tr: Windows 8.1 için sınırlı destek geri yüklendi.
zh_tw: 恢復了對 Windows 8.1 的有限支援。

source: Version 25.01
fi: Versio 25.01
pt_pt: Versão 25.01
ru: Изменения в версии 25.01
tr: Sürüm 25.01
zh_tw: 25.01 版

source: Support for GoldWave 7 (requires 64-bit Windows 10 or later).
fi: Tuki GoldWave 7:lle (edellyttää 64-bittistä Windows 10:tä tai uudempaa).
pt_pt: Suporte para GoldWave 7 (requer Windows 10 de 64 bits ou posterior).
ru: Поддержка GoldWave 7 (требуется 64-разрядная версия Windows 10 или позднее).
tr: GoldWave 7 desteği (64 bit Windows 10 veya sonrası sürümleri gerektirir.).
zh_tw: 支援 GoldWave 7 (需要 64 位元 Windows 10 或更新版本)。

source: Download links for add-on releases are no longer included in add-on documentation. You can download the add-on from NV Access add-on store.
fi: Latauslinkkiä ei enää sisällytetä lisäosan dokumentaatioon. Voit ladata lisäosan NV Accessin lisäosakaupasta.
pt_pt: Os links de download para versões de complemento não estão mais incluídos na documentação do complemento. Você pode fazer o download do complemento na loja de complementos do NV Access.
ru: Ссылки для загрузки выпусков дополнений больше не включены в документацию дополнения. Вы можете загрузить дополнение из магазина дополнений NV Access.
tr: Eklenti sürümlerinin indirme bağlantıları artık eklenti belgelerine dahil edilmemektedir. Eklentiyi NV Access eklenti mağazasından indirebilirsiniz.
zh_tw: 附加元件的下載連結不再包含於附加元件的說明文件中。您可以從 NV Access 的附加元件商店下載此附加元件。

source: Switched linting tool from Flake8 to Ruff and reformatted add-on modules to better align with NVDA coding standards.
fi: Virheidentarkistustyökalu vaihdettu Flake8:sta Ruff:iin ja lisäosamoduulit muotoiltu uudelleen paremmin NVDA:n koodauskäytäntöjä vastaaviksi.
pt_pt: Mudança da ferramenta de linting do Flake8 para o Ruff e reformatação dos módulos complementares para melhor alinhamento com os padrões de codificação do NVDA.
ru: Инструмент линтинга переключён с Flake8 на Ruff и переформатирован модуль дополнения для лучшего соответствия стандартам кодирования NVDA.
tr: Linting aracı Flake8'den Ruff'a değiştirildi ve NVDA kodlama standartlarıyla daha iyi uyum sağlamak için eklenti modülleri yeniden biçimlendirildi.
zh_tw: 已將程式碼風格檢查工具從 Flake8 切換為 Ruff，並重新格式化附加元件模組，使其更符合 NVDA 的編碼標準。

source: Removed support for automatic add-on updates feature from Add-on Updater add-on.
fi: Poistettu tämän lisäosan automaattisen päivityksen tuki Lisäosien päivittäjä -lisäosasta.
pt_pt: Removido o suporte ao recurso de atualizações automáticas de complementos do complemento Add-on Updater.
ru: Удалена поддержка функции автоматического обновления дополнений из дополнения Add-on Updater.
tr: Eklenti Güncelleyici eklentisinden otomatik eklenti güncelleme özelliği desteği kaldırıldı.
zh_tw: 移除了對附加元件更新器附加元件中的自動附加元件更新功能的支援。

source: Version 23.02
fi: Versio 23.02
pt_pt: Versão 23.02
ru: Изменения в версии 23.02
tr: Sürüm 23.02
zh_tw: 23.02 版

source: NVDA 2022.4 or later is required.
fi: Edellyttää NVDA 2022.4:ää tai uudempaa.
pt_pt: É necessário o NVDA 2022.4 ou posterior.
ru: Требуется NVDA 2022.4 или более поздняя версия.
tr: NVDA 2022.4 veya üstü gereklidir.
zh_tw: 需要 NVDA 2022.4 或更新版本。

source: Windows 10 21H2 (November 2021 Update/build 19044) or later is required.
fi: Edellyttää Windows 10 21H2:ta (marraskuun 2021 päivitys/koontiversio 19044) tai uudempaa.
pt_pt: É necessário o Windows 10 21H2 (atualização/compilação 19044 de novembro de 2021) ou posterior.
ru: Требуется Windows 10 21H2 (обновление от ноября 2021 года/сборка 19044) или позднее.
tr: Windows 10 21H2 (Kasım 2021 Güncellemesi/derlemesi 19044) veya üstü gereklidir.
zh_tw: 需要 Windows 10 21H2 (2021 年 11 月更新/組建 19044) 或更新版本。

source: Version 23.01
fi: Versio 23.01
pt_pt: Versão 23.01
ru: Изменения в версии 23.01
tr: Sürüm 23.01
zh_tw: 23.01 版

source: NVDA 2022.3 or later is required.
fi: Edellyttää NVDA 2022.3:ea tai uudempaa.
pt_pt: É necessário o NVDA 2022.3 ou posterior.
ru: Требуется NVDA 2022.3 или более поздняя версия.
tr: NVDA 2022.3 veya üstü gereklidir.
zh_tw: 需要 NVDA 2022.3 或更新版本。

source: Windows 10 or later is required as Windows 7, 8, and 8.1 are no longer supported by Microsoft as of January 2023.
fi: Edellyttää Windows 10:tä tai uudempaa, koska Microsoft ei enää tue Windows 7:ää, 8:aa tai 8.1:tä tammikuusta 2023 alkaen.
pt_pt: É necessário ter o Windows 10 ou posterior, pois o Windows 7, 8 e 8.1 não serão mais suportados pela Microsoft a partir de janeiro de 2023.
ru: Требуется Windows 10 или более поздняя версия, поскольку с января 2023 года Windows 7, 8 и 8.1 больше не поддерживаются Корпорацией Майкрософт.
tr: Ocak 2023 itibariyle Windows 7, 8 ve 8.1 artık Microsoft tarafından desteklenmediğinden Windows 10 veya sonraki sürümleri gereklidir.
zh_tw: 需要 Windows 10 或更新版本，因為微軟自 2023 年 1 月起，已不再支援 Windows 7、8 和 8.1。

source: Version 22.03
fi: Versio 22.03
pt_pt: Versão 22.03
ru: Изменения в версии 22.03
tr: Sürüm 22.03
zh_tw: 22.03 版

source: NVDA 2021.3 or later is required.
fi: Edellyttää NVDA 2021.3:ea tai uudempaa.
pt_pt: É necessário o NVDA 2021.3 ou posterior.
ru: Требуется NVDA 2021.3 или более поздняя версия.
tr: NVDA 2021.3 veya üstü gereklidir.
zh_tw: 需要 NVDA 2021.3 或更新版本。

source: A warning message will be displayed when attempting to install the add-on on Windows 7, 8, and 8.1.
fi: Lisäosa näyttää varoituksen yritettäessä asentaa sitä Windows 7:ssä, 8:ssa tai 8.1:ssä.
pt_pt: Uma mensagem de aviso será exibida ao tentar instalar o complemento no Windows 7, 8 e 8.1.
ru: При попытке установить дополнение в Windows 7, 8 и 8.1 будет выведено предупреждающее сообщение.
tr: Eklentiyi Windows 7, 8 ve 8.1'e yüklemeye çalışırken bir uyarı mesajı görüntülenecektir.
zh_tw: 當嘗試在 Windows 7、8 和 8.1 上安裝此附加元件時，將會顯示一則警告訊息。

source: Version 21.10
fi: Versio 21.10
pt_pt: Versão 21.10
ru: Изменения в версии 21.10
tr: Sürüm 21.10
zh_tw: 21.10 版

source: NVDA 2021.2 or later is required due to changes to NVDA that affects this add-on.
fi: Edellyttää NVDA 2021.2:ta tai uudempaa tähän lisäosaan vaikuttavien NVDA-muutosten takia.
pt_pt: O NVDA 2021.2 ou posterior é necessário devido a alterações no NVDA que afetam esse complemento.
ru: Требуется NVDA 2021.2 или более поздняя версия из-за изменений в NVDA, которые влияют на это дополнение.
tr: NVDA'da yapılan ve bu eklentiyi etkileyen değişiklikler nedeniyle NVDA 2021.2 veya sonrası sürümler gereklidir.
zh_tw: 由於 NVDA 的變更會影響此附加元件，因此需要 NVDA 2021.2 或更新版本。

source: In GoldWave 6.57 and later, NVDA will no longer repeat the name of the loaded file when pressing play/rewind/stop keys.
fi: NVDA ei enää toista GoldWave 6.57:ssä ja uudemmissa avatun tiedoston nimeä toista-, kelaa taaksepäin- tai pysäytä-näppäimiä painettaessa.
pt_pt: No GoldWave 6.57 e posterior, o NVDA não repetirá mais o nome do arquivo carregado ao pressionar as teclas de reprodução/retrocesso/parada.
ru: В GoldWave версии 6.57 и более поздних версиях NVDA больше не будет повторять название загруженного файла при нажатии клавиш воспроизведения/перемотки назад/остановки.
tr: GoldWave 6.57 ve sonraki sürümlerde, NVDA oynat/geri sar/durdur tuşlarına basıldığında artık yüklenen dosyanın adını tekrar etmez.
zh_tw: 在 GoldWave 6.57 及更新版本中，按下播放/倒帶/停止鍵時，NVDA 不再會重複報讀已載入的檔案名稱。

source: Version 21.06
fi: Versio 21.06
pt_pt: Versão 21.06
ru: Изменения в версии 21.06
tr: Sürüm 21.06
zh_tw: 21.06 版

source: Resolved additional coding style issues and potential bugs with Flake8.
fi: Ratkaistu lisää koodaustyylin ongelmia sekä mahdollisia Flake8:aan liittyviä virheitä.
pt_pt: Resolvidos outros problemas de estilo de codificação e possíveis bugs com o Flake8.
ru: Устранены дополнительные проблемы со стилем кодирования и потенциальные ошибки в Flake8.
tr: Flake8 ile ek kodlama stili sorunları ve olası hatalar çözüldü.
zh_tw: 透過 Flake8 解決了額外的編碼風格問題與潛在錯誤。

source: Version 20.06
fi: Versio 20.06
pt_pt: Versão 20.06
ru: Изменения в версии 20.06
tr: Sürüm 20.06
zh_tw: 20.06 版

source: Resolved many coding style issues and potential bugs with Flake8.
fi: Ratkaistu useita koodaustyylin ongelmia sekä mahdollisia Flake8:aan liittyviä virheitä.
pt_pt: Resolvidos vários problemas de estilo de codificação e possíveis bugs com o Flake8.
ru: Устранены многие проблемы со стилем кодирования и потенциальные ошибки с Flake8.
tr: Flake 8 ile ilgili bir çok kodlama biçimi sorunları ve potansiyel hatalar düzeltildi.
zh_tw: 透過 Flake8 解決了許多編碼風格問題與潛在錯誤。

source: Version 20.04
fi: Versio 20.04
pt_pt: Versão 20.04
ru: Изменения в версии 20.04
tr: Sürüm 20.04
zh_tw: 20.04 版

source: Added input help messages for remainig time command (NVDA+Shift+R).
fi: Lisätty näppäinohjeviestit jäljellä olevan ajan ilmoittavalle komennolle (NVDA+Vaihto+R).
pt_pt: Adição de mensagens de ajuda de entrada para o comando remainig time (NVDA+Shift+R).
ru: Добавлены справочные сообщения для команды оставшегося времени (NVDA+Shift+R).
tr: Kalan zaman komutu için (NVDA+Shift+R) girdi yardım mesajları eklendi.
zh_tw: 為剩餘時間指令 (NVDA+Shift+R) 新增了輸入說明訊息。

source: Toggle command announcement command (NVDA+Shift+C) will now show up under "GoldWave" category in NVDA's input gestures dialog.
fi: Komentojen puhumisen käyttöön ottava tai käytöstä poistava komento (NVDA+Vaihto+C) näkyy nyt GoldWave-kategoriassa NVDA:n Näppäinkomennot-valintaikkunassa.
pt_pt: O comando de anúncio de comando de alternância (NVDA+Shift+C) agora aparecerá na categoria "GoldWave" na caixa de diálogo de gestos de entrada do NVDA.
ru: Команда объявления о переключении команд (NVDA+Shift+C) теперь будет отображаться в категории "GoldWave" в диалоге жесты ввода NVDA.
tr: Komut bildirimini açıp kapatma komutu (NVDA+Shift+C) NVDA'nın girdi hareketleri iletişim kutusunun "GoldWave" kategorisinde görünecek.
zh_tw: 切換指令報讀指令 (NVDA+Shift+C) 現在會顯示在 NVDA 輸入手勢對話方塊的「GoldWave」類別下。

source: Version 20.01
fi: Versio 20.01
pt_pt: Versão 20.01
ru: Изменения в версии 20.01
tr: Sürüm 20.01
zh_tw: 20.01 版

source: Requires NVDA 2019.3 or later.
fi: Edellyttää NVDA 2019.3:ea tai uudempaa.
pt_pt: Requer NVDA 2019.3 ou superiores.
ru: Требуется NVDA 2019.3 или более поздняя версия.
tr: NVDA 2019.3 veya daha üst sürümünü gerektirir.
zh_tw: 需要 NVDA 2019.3 或更新版本。

source: Version 19.11
fi: Versio 19.11
pt_pt: Versão 19.11
ru: Изменения в версии 19.11
tr: Sürüm 19.11
zh_tw: 19.11 版

source: Windows 7 SP1, GoldWave 6.x, and NVDA 2019.1 or later is required.
fi: Edellyttää Windows 7 SP1:tä, GoldWave 6.x:ää ja NVDA 2019.1:tä tai uudempaa.
pt_pt: É necessário o Windows 7 SP1, o GoldWave 6.x e o NVDA 2019.1 ou posterior.
ru: Требуется Windows 7 с пакетом обновления 1, GoldWave 6.x и NVDA 2019.1 или более поздняя версия.
tr: Windows 7 SP1, GoldWave 6.x ve NVDA 2019.1 veya daha üst sürümü gerekir.
zh_tw: 需要 Windows 7 SP1、GoldWave 6.x，以及 NVDA 2019.1 或更新版本。

source: Added help message for sound window (accessible if Control Usage Assistant add-on is installed).
fi: Lisätty ohjeviesti ääni-ikkunalle (käytettävissä, mikäli Säätimen käyttöapu -lisäosa on asennettuna).
pt_pt: Adicionada mensagem de ajuda para a janela de som (acessível se o complemento Control Usage Assistant estiver instalado).
ru: Добавлено справочное сообщение для звукового окна (доступно, если установлено дополнение Control Usage Assistant).
tr: Ses penceresi için yardım mesajı eklendi (kontrol kullanım asistanı eklentisi kuruluysa kullanılabilir).
zh_tw: 為聲音視窗新增了說明訊息 (若已安裝 Control Usage Assistant 附加元件即可存取)。

source: Version 18.12
fi: Versio 18.12
pt_pt: Versão 18.12
ru: Изменения в версии 18.12
tr: Sürüm 18.12
zh_tw: 18.12 版

source: NVDA will no longer appear to do nothing or play error tones when performing certain GoldWave commands with command announcement set to off (this may result in odd behaviors in some cases).
fi: NVDA ei enää näytä olevan tekemättä mitään tai toista virheääniä tiettyjä GoldWave-komentoja suoritettaessa, kun komentojen puhuminen on poistettu käytöstä (tämä voi johtaa joissakin tapauksissa outoon käyttäytymiseen).
pt_pt: O NVDA não parecerá mais não fazer nada ou reproduzir tons de erro ao executar determinados comandos do GoldWave com o anúncio de comando definido como desativado (isso pode resultar em comportamentos estranhos em alguns casos).
ru: NVDA больше не будет отображать бездействие или воспроизводить сигналы об ошибках при выполнении определенных команд GoldWave с отключенным объявлением команды (в некоторых случаях это может привести к странному поведению).
tr: NVDA, komut bildirimi kapalıyken bazı GoldWave komutları kullanıldığında hiçbir şey yapmıyormuş gibi görünmeyecek veya hata sesi çalmayacak (bazı durumlarda garip davranışlara sebep olabilir).
zh_tw: 當讀出指令鍵設為關閉時，執行某些 GoldWave 指令，NVDA 不再會看似沒有任何反應或播放錯誤音效 (在某些情況下，這可能會導致奇怪的行為)。

source: Internal changes to support future NVDA releases.
fi: Sisäisiä muutoksia tulevien NVDA-versioiden tukemiseksi.
pt_pt: Alterações internas para dar suporte a futuras versões do NVDA.
ru: Внутренние изменения для поддержки будущих выпусков NVDA.
tr: Gelecek NVDA sürümlerini desteklemek için dahili değişiklikler.
zh_tw: 內部變更，以支援未來的 NVDA 版本。

source: Version 18.07
fi: Versio 18.07
pt_pt: Versão 18.07
ru: Изменения в версии 18.07
tr: Sürüm 18.07
zh_tw: 18.07 版

source: Fixed an issue where leading zeroes would not be displayed when trying to obtain remaining time for a trakc.
fi: Korjattu ongelma, jonka takia etunollia ei näytetty yritettäessä hakea raidan jäljellä olevaa aikaa.
pt_pt: Foi corrigido um problema em que os zeros à esquerda não eram exibidos quando se tentava obter o tempo restante de um trakc.
ru: Исправлена ошибка, из-за которой начальные нули не отображались при попытке узнать оставшееся время дорожки.
tr: Parçanın kalan zamanını söylerken öndeki sıfırların söylenmemesi sorunu düzeltildi.
zh_tw: 修正了嘗試取得音軌剩餘時間時，開頭的零不會被顯示的問題。

source: Version 17.05
fi: Versio 17.05
pt_pt: Versão 17.05
ru: Изменения в версии 17.05
tr: Sürüm 17.05
zh_tw: 17.05 版

source: Added ability to provide debug information when NVDA is running with debug logging enabled (NVDA 2017.1 or later).
fi: Lisätty mahdollisuus virheenkorjaustietojen tarjoamiseen, kun NVDA:ta käytetään virheenkorjaus-lokitasolla (NVDA 2017.1 tai uudempi).
pt_pt: Foi adicionada a capacidade de fornecer informações de depuração quando o NVDA estiver em execução com o registro de depuração ativado (NVDA 2017.1 ou posterior).
ru: Добавлена возможность предоставления отладочной информации при запуске NVDA с включенным журналированием отладки (NVDA 2017.1 или более поздняя версия).
tr: NVDA hata günlük tutma seviyesinde çalışırken hata bilgisi verme özelliği eklendi (NVDA 2017.1 veya daha üst sürümü).
zh_tw: 新增了當 NVDA 在啟用偵錯記錄的狀態下執行時，提供偵錯資訊的功能 (需 NVDA 2017.1 或更新版本)。

source: Updated translations.
fi: Käännöksiä päivitetty.
pt_pt: Traduções atualizadas.
ru: Обновлены переводы.
tr: Güncellenmiş çeviriler.
zh_tw: 更新翻譯。

source: Version 16.12
fi: Versio 16.12
pt_pt: Versão 16.12
ru: Изменения в версии 16.12
tr: Sürüm 16.12
zh_tw: 16.12 版

source: Version scheme is now year.month instead of major.minor.
fi: Versionumero on nyt muotoa vuosi.kuukausi aiemman suuri.pieni sijaan.
pt_pt: O esquema de versão agora é ano.mês em vez de maior.menor.
ru: Схема версий теперь год.месяц вместо major.minor.
tr: Sürüm düzeni büyük sürüm.küçük sürüm yerine yıl.ay olarak ayarlandı.
zh_tw: 版本號格式現已改為年.月，而非主版號.次版號。

source: Changes for 4.0
fi: Muutokset versiossa 4.0
pt_pt: Alterações para a versão 4.0
ru: Изменения в версии 4.0
tr: 4.0 için değişiklikler
zh_tw: 4.0 版的變更
