Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/goldwave/*/goldwave.po
Languages: bg, ru, tr, zh_tw

source: This is GoldWave's sound window. You can use GoldWave commands to listen to and edit sound files. See GoldWave help for details.
bg: Това е прозорецът за звук на GoldWave. Можете да използвате командите на GoldWave, за да прослушвате и редактирате звукови файлове. Прегледайте помощната документация на GoldWave за допълнителна информация.
ru: Это звуковое окно GoldWave. Можно использовать команды GoldWave, чтобы слушать и редактировать звуковые файлы. Для подробностей прочитайте помощь GoldWave.
tr: Bu GoldWave'in ses penceresidir. Ses dosyalarını dinlemek ve düzenlemek için GoldWave komutlarını kullanabilirsiniz. Ayrıntılar için GoldWave yardımına bakın.
zh_tw: 這是 GoldWave 的聲音視窗。您可以使用 GoldWave 的指令來聆聽和編輯聲音檔。詳細資訊請參閱 GoldWave 的說明。

source: Track position not available
bg: Не е налична информация за текущата позиция в пистата
ru: Положение дорожки недоступно
tr: Parça konumu mevcut değil
zh_tw: 音軌位置 無法使用

source: Channel information unavailable
bg: Не е налична информация за канала
ru: Информация о канале недоступна
tr: Kanal bilgisi mevcut değil
zh_tw: 聲道資訊 無法使用

source: mono
bg: Моно
ru: моно
zh_tw: 單聲道

source: stereo
bg: Стерео
ru: стерео
tr: steryo
zh_tw: 立體聲

source: left
bg: Ляв
ru: левый
tr: sol
zh_tw: 左

source: right
bg: Десен
ru: правый
tr: sağ
zh_tw: 右

source: center
bg: център
ru: центральный
tr: orta
zh_tw: 中

source: low frequency
bg: ниска честота
ru: низкая частота
tr: düşük frekans
zh_tw: 低頻

source: back left
bg: заден ляв
ru: задний левый
tr: arka sol
zh_tw: 左後

source: back right
bg: заден десен
ru: задний правый
tr: arka sağ
zh_tw: 右後

source: side left
bg: страничен ляв
ru: боковой левый
tr: sol kenar
zh_tw: 左側

source: side right
bg: страничен десен
ru: боковой правый
tr: sağ kenar
zh_tw: 右側

source: Multiple channels selected
bg: избрани са няколко канала
ru: Выделено несколько каналов
tr: Çoklu kanal seçildi
zh_tw: 多個聲道已選取

source: All channels selected
bg: Избрани са всички канали
ru: Выделены все каналы
tr: Tüm kanallar seçildi
zh_tw: 所有聲道已選取

source: Start: {startMarkerPos}
bg: Начало: {startMarkerPos}
ru: Начало: {startMarkerPos}
tr: Başlangıç: {startMarkerPos}
zh_tw: 開始: {startMarkerPos}

source: Finish: {finishMarkerPos}
bg: Край: {finishMarkerPos}
ru: Конец: {finishMarkerPos}
tr: Bitiş: {finishMarkerPos}
zh_tw: 結束: {finishMarkerPos}

source: Play selection
bg: Възпроизвеждане на избраното
ru: Воспроизвести выделенное
tr: Seçimi çal
zh_tw: 播放選取部分

source: Select All
bg: Избери всичко
ru: Выделить Всё
tr: Tümünü seç
zh_tw: 全選

source: Cue
bg: Вмъкване на показалец
ru: Метка
tr: İşaret
zh_tw: 新增cue點

source: Cue dropped at start marker
bg: Показалецът бе вмъкнат на позицията на маркера за начало
ru: Метка создана на начальном маркере
tr: Başlangıç iminin konumuna işaret kondu
zh_tw: 新增cue點至開始標記

source: Cue dropped at finish marker
bg: Показалецът бе поставен на позицията на маркера за край
ru: Метка создана на конечном маркере
tr: Bitiş iminin konumuna işaret kondu
zh_tw: 新增cue點至結束標記

source: Start marker at next cue
bg: Преместване на маркера за начало до следващия показалец
ru: Начальный маркер следующей Метки
tr: Başlangıç imi sonraki işarete taşındı
zh_tw: 移動開始標記至下個cue點

source: Start marker at previous cue
bg: Преместване на маркера за начало до предишния показалец
ru: Начальный маркер предыдущей Метки
tr: Başlangıç imi önceki işarete taşındı
zh_tw: 移動開始標記至上個cue點

source: Finish marker at next cue
bg: Преместване на маркера за край до следващия показалец
ru: Конечный маркер следующей Метки
tr: Bitiş imi sonraki işarete taşındı
zh_tw: 移動結束標記至下個cue點

source: Finish marker at previous cue
bg: Преместване на маркера за край до предишния показалец
ru: Конечный маркер предыдущей Метки
tr: Bitiş imi önceki işarete taşındı
zh_tw: 移動結束標記至上個cue點

source: deleted
bg: Изтрито
ru: удалено
tr: silindi
zh_tw: 已刪除

source: play
bg: Възпроизвеждане
ru: воспроизведение
tr: çal
zh_tw: 播放

source: rewind
bg: Превъртане назад
ru: перемотка назад
tr: geri al
zh_tw: 倒帶

source: fast forward
bg: Превъртане напред
ru: перемотка вперёд
tr: ileri al
zh_tw: 快轉

source: pause
bg: Пауза
ru: пауза
tr: duraklat
zh_tw: 暫停

source: stop
bg: Спиране
ru: стоп
tr: durdur
zh_tw: 停止

source: record
bg: Записване
ru: запись
tr: kaydet
zh_tw: 錄音

source: Announces the current audio position in seconds.
bg: Съобщава в секунди текущата позиция в аудиопистата.
ru: Объявляет текущее положение звука в секундах.
tr: Mevcut konumu saniye olarak söyler.
zh_tw: 以秒為單位，讀出目前音軌位置。

source: Announces a summary on audio selection info such as selection duration.
bg: Съобщава обобщена информация за аудио селекцията (например времетраенето й).
ru: Сводное объявление выделеной звуковой информации, такой как длительность выделенного фрагмента.
tr: Parça seçimiyle ilgili, seçimin süresi vb, özet bilgi verir.
zh_tw: 讀出選取區段的摘要資訊（例如，音軌長度。）

source: Unable to obtain audio selection summary. Please close and reopen the audio track.
bg: Не бе възможно получаването на информация за текущата аудио селекция. Моля затворете и отворете повторно аудио пистата.
ru: Невозможно получить сводную информацию о выделеном звуке. Пожалуйста, закройте и заново откройте звуковую дорожку.
tr: Parça seçim bilgisi alınamadı. Lütfen parçayı kapatıp yeniden açın.
zh_tw: 無法獲取選取音軌的摘要，請關閉後重新開啟。

source: {audioSelectionStart} to {audioSelectionEnd} {audioSelectionLength}
bg: от {audioSelectionStart} до {audioSelectionEnd}, общо {audioSelectionLength}
ru: от {audioSelectionStart} до {audioSelectionEnd} {audioSelectionLength}
tr: {audioSelectionStart} den {audioSelectionEnd} e kadar {audioSelectionLength}
zh_tw: 從 {audioSelectionStart} 到 {audioSelectionEnd} 總長度 {audioSelectionLength}

source: Announces total length of the audio track.
bg: Съобщава времетраенето на цялата аудио писта.
ru: Объявляет общую длину звуковой дорожки.
tr: Parçanın toplam uzunluğunu söyler.
zh_tw: 讀出音軌總長度

source: Track length is unavailable. Please close and reopen the audio track.
bg: Времетраенето на пистата не е налично. Моля затворете и отворете повторно аудио пистата.
ru: Длительность дорожки недоступна. Пожалуйста, закройте и заново откройте звуковую дорожку.
tr: Parça uzunluk bilgisi alınamadı. lütfen parçayı kapatıp yeniden açın.
zh_tw: 音軌總長度 無法使用，請關閉音軌後重新開啟。

source: Track length: {trackLength}
bg: Времетраене: {trackLength}
ru: Длина дорожки: {trackLength}
tr: Parça süresi: {trackLength}
zh_tw: 音軌總長度: {trackLength}

source: Announces remaining length of the audio track.
bg: Съобщава оставащото времетраене от аудио пистата.
ru: Объявляет оставшуюся длину аудио дорожки.
tr: Parçanın kalan süresini bildirir.
zh_tw: 讀出音軌剩餘長度。

source: Cannot tell you remaining time for the current track
bg: Не може да се съобщи оставащото време за текущия запис
ru: Невозможно сообщить оставшееся время текущей дорожки
tr: Mevcut parça için kalan süre bilgisi verilemiyor
zh_tw: 無法讀出目前音軌的剩餘時間，

source: Announces the audio channel you are editing.
bg: Съобщава редактирания от вас аудио канал.
ru: Объявляет звуковой канал, который вы редактируете.
tr: Düzenlediğiniz kanalı söyler.
zh_tw: 讀出目前編輯的聲道

source: Selected channel: {audioChannel}
bg: Избран канал: {audioChannel}
ru: Выбран канал: {audioChannel}
tr: Seçilen kanal: {audioChannel}
zh_tw: 選擇的聲到: {audioChannel}

source: Announces audio zoom level.
bg: Съобщава нивото на мащабиране на пистата.
ru: Объявляет уровень масштабирования звука.
tr: Yakınlaştırma düzeyini söyler.
zh_tw: 讀出縮放層級

source: Zoom level: {zoomLevel}
bg: Ниво на мащабиране: {zoomLevel}
ru: Уровень масштабирования: {zoomLevel}
tr: Yakınlaştırma seviyesi: {zoomLevel}
zh_tw: 縮放: {zoomLevel}

source: An add-on for enhancing access and usage of the GoldWave audio editor.
bg: Добавка, разширяваща достъпността и ползваемостта на звуковия редактор GoldWave.
ru: Дополнение для расширения доступа при использовании звукового редактора GoldWave.
tr: GoldWave ses editörünün kullanımı ve erişilebilirliğinin artırılması için bir eklenti.
zh_tw: 一個用於強化 GoldWave 音訊編輯器存取及使用體驗的附加元件。

source: * Fixed bugs regarding position and selection time announcements.
bg: * Отстранени грешки, свързани с докладването на времевата позиция и селекцията.
ru: * Исправлены ошибки, касающиеся объявлений о позиции и выделенном времени.
tr: * Konum ve seçim süresi duyuruları ile ilgili hatalar düzeltildi.
zh_tw: * 修正了關於位置與讀出選取時間的錯誤。
