Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/goldwave/*/goldwave.xliff
Languages: fi, pt_pt, ru, tr, zh_tw

source: Add-on repository has moved to GitHub (now located at https://github.com/josephsl/goldwave).
fi: Lisäosan koodivarasto on muuttanut GitHubiin (sijaitsee nyt osoitteessa https://github.com/josephsl/goldwave).
pt_pt: O repositório de complementos foi transferido para o GitHub (agora localizado em https://github.com/josephsl/goldwave).
ru: Репозиторий дополнения перемещён на GitHub (теперь он находится по адресу https://github.com/josephsl/goldwave).
tr: Eklenti deposu GitHub'a taşındı (https://github.com/josephsl/goldwave adresinde bulunabilir).
zh_tw: 附加元件儲存庫已移至 GitHub (目前位於 https://github.com/josephsl/goldwave)。

source: Performance improvements when looking up information such as channel name and other status information.
fi: Suorituskykyä paranneltu tietoja, kuten kanavan nimeä ja muita tilatietoja, haettaessa.
pt_pt: Melhorias no desempenho ao procurar informações como o nome do canal e outras informações de status.
ru: Улучшения производительности при поиске информации, такой как название канала и другой информации состояния.
tr: Kanal adı ve diğer durum bilgilerini edinme konusunda performans geliştirmeleri.
zh_tw: 改善了查詢聲道名稱及其他狀態資訊時的效能。

source: Changes for 3.0
fi: Muutokset versiossa 3.0
pt_pt: Alterações para a versão 3.0
ru: Изменения в версии 3.0
tr: 3.0 için değişiklikler
zh_tw: 3.0 版的變更

source: Added a command to announce remaining time for the current track (NVDA+Shift+R).
fi: Lisätty nykyisen raidan jäljellä olevan ajan ilmoittava komento (NVDA+Vaihto+R).
pt_pt: Foi adicionado um comando para anunciar o tempo restante da faixa atual (NVDA+Shift+R).
ru: Добавлена команда объявления оставшегося времени текущего трека (NVDA+Shift+R).
tr: Üzerinde bulunulan parçada kalan zamanı söyleme komutu eklendi (NVDA+Shift+R).
zh_tw: 新增了讀出目前音軌剩餘時間的指令 (NVDA+Shift+R)。

source: Slight improvements when announcing status information such as channel information.
fi: Pieniä parannuksia tilatietoja, kuten kanavaa, ilmoitettaessa.
pt_pt: Pequenas melhorias ao anunciar informações de status, como informações de canal.
ru: Незначительные улучшения объявлений информации о состоянии, например, информацию о канале.
tr: Kanal bilgisi gibi durum bilgilerini söyleme konusunda küçük geliştirmeler.
zh_tw: 稍微改善了讀出狀態資訊例如聲道資訊的功能。

source: Changes for 2.0
fi: Muutokset versiossa 2.0
pt_pt: Alterações para a versão 2.0
ru: Изменения в версии 2.0
tr: 2.0 için değişiklikler
zh_tw: 2.0 版的變更

source: Support for GoldWave 6, including 64-bit version of GoldWave (see note above).
fi: Tuki GoldWave 6:lle, 64-bittinen versio mukaan lukien (katso huomautus edeltä).
pt_pt: Suporte ao GoldWave 6, incluindo a versão de 64 bits do GoldWave (consulte a nota acima).
ru: Поддержка GoldWave 6, в том числе 64-битной версии GoldWave (см примечание выше).
tr: GoldWave'in 64-bit sürümü dahil olmak üzere GoldWave 6 desteği (yukarıdaki nota bakın).
zh_tw: 支援 GoldWave 6，包含 64 位元版本的 GoldWave (請參閱上述附註)。

source: Add-on help can now be accessed from add-ons manager (NVDA 2014.3 and later).
fi: Ohje on käytettävissä Lisäosien hallinnasta (NVDA 2014.3 ja uudemmat).
pt_pt: A ajuda do complemento agora pode ser acessada no gerenciador de complementos (NVDA 2014.3 e posterior).
ru: Справка дополнения доступна в менеджере дополнений (NVDA 2014.3 и более поздняя версия).
tr: Artık eklenti yardımına eklenti yöneticisinden erişilebilir (NVDA 2014.3 ve daha üst sürümü).
zh_tw: 現在可以從附加元件管理員存取附加元件說明 (需 NVDA 2014.3 或更新版本)。

source: NVDA now announces selected channel if you press channel selection commands such as Control+Shift+L for the left channel.
fi: NVDA ilmoittaa nyt valitun kanavan painettaessa kanavan valitsemiskomentoa, kuten Control+Shift+L, joka valitsee vasemman.
pt_pt: O NVDA agora anuncia o canal selecionado se você pressionar comandos de seleção de canal, como Control+Shift+L para o canal esquerdo.
ru: Теперь NVDA объявляет выбранный канал при нажатии команды выбора канала, например Control+Shift+L для левого канала.
tr: Sol kanalı seçmek için Control+Shift+L gibi kanal seçme komutları kullanıldığında, NVDA seçilen kanalı söylüyor.
zh_tw: 現在，當您按下聲道選取指令例如 Control+Shift+L 選取左聲道時，NVDA 會讀出選取的聲道。

source: Various issues with numeric edit fields such as censor field and time selector in mix dialog has been fixed, including selecting text, updating values and so on.
fi: Useita numeeristen muokkauskenttien, kuten Censor-äänitehosteen ja Mix-valintaikkunan ajanvalitsimen, ongelmia on korjattu, mukaan lukien tekstin valitseminen, arvojen päivittäminen jne.
pt_pt: Vários problemas com campos de edição numérica, como o campo de censura e o seletor de tempo na caixa de diálogo de mixagem, foram corrigidos, incluindo a seleção de texto, a atualização de valores e assim por diante.
ru: Были исправлены различные проблемы с числовыми полями редактирования, такие как поле цензуры и выделение времени в диалоге смешивания, в том числе выделение текста, обновление значений и так далее.
tr: Sansür alanı ve mixleme iletişim kutusundaki zaman seçimi alanı gibi sayı içeren yazı alanlarındaki çeşitli sorunlar giderildi. Giderilen sorunlar arasında metin seçimi ve değerlerin güncellenmesi gibi sorunlar var.
zh_tw: 修正了數值編輯欄位例如混音對話框中的審查欄位和時間選取器的各種問題，包含選取文字、更新數值等等。

source: Command announcement setting will be remembered when switching to other programs.
fi: Komentojen puhumisasetus säilyy muihin sovelluksiin siirryttäessä.
pt_pt: A configuração do anúncio de comando será lembrada ao alternar para outros programas.
ru: Настройка объявлений команд запоминается при переключении на другие программы.
tr: Diğer programlara geçiş yapıldığında komut bildirimi ayarı sıfırlanmayacak.
zh_tw: 切換至其他程式時，讀出指令設定將會被記住。

source: Changes for 1.2
fi: Muutokset versiossa 1.2
pt_pt: Alterações para a versão 1.2
ru: Изменения в версии 1.2
tr: 1.2 için değişiklikler
zh_tw: 1.2 版的變更

source: Fixed an issue where NVDA had difficulty announcing some edit fields.
fi: Korjattu ongelma, jonka takia NVDA:lla oli vaikeuksia joidenkin muokkauskenttien lukemisessa.
pt_pt: Foi corrigido um problema em que o NVDA tinha dificuldade para anunciar alguns campos de edição.
ru: Исправлена ошибка, когда NVDA с трудом объявлял некоторые поля редактирования.
tr: NVDA'nın bazı yazı alanlarını tam olarak bildirememe sorunu düzeltildi.
zh_tw: 修正了 NVDA 難以讀出某些編輯區的問題。

source: New and updated translations.
fi: Uusia ja päivitettyjä käännöksiä.
pt_pt: Traduções novas e atualizadas.
ru: Добавлены и обновлены переводы.
tr: Yeni ve güncellenmiş çeviriler.
zh_tw: 新增及更新的翻譯。

source: Please note that due to recent changes in NVDA, audio selection and other status commands may not work as expected in some systems.
fi: Huomaa, että NVDA:han äskettäin tehtyjen muutosten vuoksi äänen valintaan käytettävät sekä muut tilakomennot eivät välttämättä toimi normaalisti kaikissa järjestelmissä.
pt_pt: Observe que, devido a alterações recentes no NVDA, a seleção de áudio e outros comandos de status podem não funcionar como esperado em alguns sistemas.
ru: Поддержка объявлений сообщений по брайлю.
tr: NVDA'da yapılan bazı değişiklikler nedeniyle, bazı sistemlerde ses seçimi ve diğer durum komutlarının beklenen şekilde çalışmayacağını unutmayın.
zh_tw: 請注意，由於 NVDA 近期的變更，音訊選取及其他狀態指令在某些系統上可能無法如預期般運-作。

source: Changes for 1.1
fi: Muutokset versiossa 1.1
pt_pt: Alterações para a versão 1.1
ru: Изменения в версии 1.1
tr: 1.1 için değişiklikler
zh_tw: 1.1 版的變更

source: Support for message announcements in braille.
fi: Tuki ilmoitusten näyttämiselle pistenäytöllä.
pt_pt: Suporte para anúncios de mensagens em braile.
ru: Поддержка объявлений сообщений по брайлю.
tr: Mesaj bildirimi için braille desteği.
zh_tw: 支援在點字輸出中顯示訊息。

source: Audio selection summary is presented in languages other than English.
fi: Raidan valitun kohdan yhteenvetotiedot luetaan nyt muillakin kielillä kuin englanniksi.
pt_pt: O resumo da seleção de áudio é apresentado em outros idiomas além do inglês.
ru: Сводное объявление выделеной звуковой информации предоставляется на языках, отличных от английского.
tr: Ses seçimi özeti İngilizce dışındaki dillerde de sunuluyor.
zh_tw: 音訊選取摘要會以非英文的其他語言呈現。

source: More command announcements added including cue position movement and delete/trim operations.
fi: Lisää komentojen ilmoituksia, paikkamerkin sijainnin siirtäminen sekä poisto/leikkaus mukaan lukien.
pt_pt: Foram adicionados mais anúncios de comando, incluindo o movimento da posição da deixa e operações de exclusão/aparagem.
ru: Добавлено больше команд объявлений, включая перемещение положения метки и операций удаления/обрезки.
tr: İşaret noktaları, silme ve kırpma gibi işlemler için daha fazla komut bildirimi eklendi.
zh_tw: 新增讀出更多指令，包含提示點移動及刪除/修剪操作。

source: Fixed an issue in numeric edit fields such as various effects dialogs where nothing or wrong field name was announced.
fi: Korjattu numeeristen muokkauskenttien ongelma (esim. eri äänitehostevalintaikkunoissa), joka aiheutti sen, että väärä kentän nimi luettiin tai sitä ei luettu ollenkaan.
pt_pt: Foi corrigido um problema em campos de edição numérica, como várias caixas de diálogo de efeitos, em que nada ou um nome de campo errado era anunciado.
ru: Исправлена проблема с числовыми полями редактирования, например, в различных диалогах эффектов, когда не объявлялось ничего или объявлялись неправильные названия полей.
tr: Çeşitli efekt alanlarındaki değerlerin seslendirilmemesi ya da yanlış alanların seslendirilmesi gibi sayısal düzenleme alanlarındaki sorunlar giderildi.
zh_tw: 修正了在數值編輯區例如各種效果對話框中，沒有讀出或讀出錯誤欄位名稱的問題。

source: New and updated translations.
fi: Uusia ja päivitettyjä käännöksiä.
pt_pt: Traduções novas e atualizadas.
ru: Добавлены и обновлены переводы.
tr: Yeni ve güncellenmiş çeviriler.
zh_tw: 新增及更新的翻譯。

source: Changes for 1.0
fi: Muutokset versiossa 1.0
pt_pt: Alterações para a versão 1.0
ru: Изменения в версии 1.0
tr: 1.0 için değişiklikler
zh_tw: 1.0 版的變更

source: Initial version.
fi: Ensimmäinen versio.
pt_pt: Versão inicial.
ru: Первоначальная версия.
tr: İlk sürüm.
zh_tw: 初始版本。
