Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/easyTableNavigator/*/easyTableNavigator.xliff
Languages: tr

source: Easy Table Navigator
tr: Kolay Tablo Dolaşımı

source: Authors: Corentin Bacqué-Cazenave, Joseph Lee
tr: Yazarlar: Corentin Bacqué-Cazenave, Joseph Lee

source: Download [stable version][1]
tr: [Kararlı sürümü indir][1]

source: Download [development version][2]
tr: [Geliştirici sürümünü indir][2]

source: NVDA compatibility: 2019.3 and beyond
tr: NVDA uyumluluğu: 2019.3 ve sonrası

source: This plugin adds a layer command to use simplified key combination to navigate table cells.
tr: Bu eklenti, tablo hücrelerinde dolaşmak için basitleştirilmiş tuş kombinasyonunu kullanmak üzere bir katman komutu ekler. Katmanlı komutlar etkinleştirildiğinde, aşağıdaki eylemleri gerçekleştirebilirsiniz.

source: When the layered commands are enabled, you can perform the following actions:
tr: Katmanlı komutlar etkinleştirildiğinde, aşağıdaki eylemleri gerçekleştirebilirsiniz:

source: - Navigate to the previous or next cell horizontally or vertically using arrow keys
tr: Ok tuşlarını kullanarak yatay veya dikey olarak önceki veya sonraki hücreye gidin

source: - Navigate to the first or last cell of the row or the column using control+arrow keys or Home, End, PageUp and PageDown
tr: Control+ok tuşlarını veya Home, End, PageUp ve PageDown'u kullanarak satırın veya sütunun ilk veya son hücresine gidin

source: - Read the whole row or column without moving the system caret using windows+leftArrow / windows+upArrow
tr: Windows+sol ok / windows+yukarı ok kullanarak sistem imlecini hareket ettirmeden tüm satırı veya sütunu okuyun

source: - Read the row or column starting from the current cell using windows+rightArrow / windows+downArrow
tr: Geçerli hücreden başlayarak satırı veya sütunu windows+sağ ok / windows+aşağı ok kullanarak okuyun

source: Currently supported tables are:
tr: Şu anda desteklenen tablolar şunlardır:

source: Browse mode (Internet Explorer, Firefox, etc.).
tr: Tarama kipi modu (Internet Explorer, Firefox, vb.).

source: Commands
tr: Komutlar

source: Toggles table navigator layer on and off (unassigned).
tr: Tablo dolaşımı katmanını açar ve kapatır (atanmamış).

source: Changes for 2.5
tr: 2.5 için değişiklikler

source: Compatibility with NVDA 2024.1
tr: Artık NVDA 2024.1 ile uyumlu

source: Changes for 2.4
tr: 2.4 için değişiklikler

source: For this release, many thanks goes to Cyrille Bougot for his work.
tr: Bu sürüm için, çalışmalarından dolayı Cyrille Bougot'ya çok teşekkürler.

source: Table navigation fixed in MS Word
tr: Tablo dolaşımı MS Word'de düzeltildi

source: Introduce new commands following changes in NVDA 2022.2 and 2022.4
tr: NVDA 2022.2 ve 2022.4'teki değişiklikleri takiben yeni komutlar tanıtıldı

source: - home/end/pgUp/pgDown to jump to start/end of row/column
tr: başlangıç ​​noktasına atlamak için home/end/pgUp/pgDown/satır/sütun sonu

source: - control+left/right/up/downArrow to jump to start/end of row/column (alternative shortcut key for the same result)
tr: satır/sütun başına/sonuna atlamak için control+sol/sağ/yukarı/aşağıOk (aynı sonuç için alternatif kısayol tuşu)

source: - NVDA+left/up to read the whole row/column starting from the first cell without moving the current position of the cursor
tr: İmlecin mevcut konumunu hareket ettirmeden ilk hücreden başlayarak tüm satırı/sütun okumak için NVDA+sol/yukarı

source: - NVDA+right/down for sayAll in row/column, i.e. read the cells of the current row/column, starting from the current cell and moving the cursor's position while reading until the last cell of the row/column.
tr: NVDA + sağ / aşağı diyelim ki Satırda / sütunda tümü, yani geçerli satırın / sütunun hücrelerini okuyun, geçerli hücreden başlayın ve satırın / sütunun son hücresine kadar okurken imlecin konumunu hareket ettirin.

source: Remape some keys to avoid conflicts:
tr: Çakışmaları önlemek için bazı tuşlar yeniden eşlendi:

source: - NVDA+upArrow/leftArrow becomes windows+upArrow/leftArrow (to read full column/row)
tr: NVDA+yukarı ok/sol ok, windows+yukarı ok/sol ok olur (tam sütun/satır okumak için)

source: - NVDA+downArrow/rightArrow becomes windows+downArrow/rightArrow (say all in column/row)
tr: NVDA+aşağı ok/sağ Ok, windows+aşağı ok/sağ Ok olur (tümünü sütun/satır olarak söyleyin)

source: Compatibility with NVDA 2023.1
tr: Artık NVDA 2023.1 ile uyumlu

source: Changes for 2.3
tr: 2.3 için değişiklikler

source: It is now possible to disable table navigation layer from everywhere
tr: Tablo dolaşımı katmanını her yerden devre dışı bırakmak artık mümkün

source: Compatibility with NVDA 2022.1
tr: Artık NVDA 2022.1 ile uyumlu

source: Fix error when reloading the addon
tr: Eklentiyi yeniden yüklerken hata düzeltildi

source: Changes for 2.2.1
tr: 2.2.1 için değişiklikler

source: Fixed an error in some type of documents including Word and Outlook
tr: Word ve Outlook dahil bazı belge türlerindeki bir hata düzeltildi

source: Changes for 2.2
tr: 2.2 için değişiklikler

source: Update documentation style from addons template
tr: Eklenti şablonundan belge stili güncellendi

source: First translated version
tr: İlk tercüme edilmiş sürüm

source: Changes for 2.1.1
tr: 2.1.1 için değişiklikler

source: New author in manifest and documentation
tr: Manifest dosyasında ve belgelerde yeni yazar

source: Changes for 2.1
tr: 2.1 için değişiklikler

source: Compatibility with NVDA 2021.1
tr: Artık NVDA 2021.1 ile uyumlu

source: Changes for 2.0
tr: 2.0 için değişiklikler

source: Requires NVDA 2019.3 or later.
tr: NVDA 2019.3 veya sonraki bir sürümü gerektirir.

source: Made various add-on messages translatable.
tr: Çeşitli eklenti mesajları çevrilebilir hale getirildi.

source: Changes for 1.2
tr: 1.2 için değişiklikler

source: Internal changes to support future NVDA releases.
tr: Gelecekteki NVDA sürümlerini desteklemek için değişiklikler.

source: Changes for 1.1
tr: 1.1 için değişiklikler

source: Fixed an issue where errors might be heard when spell checking a message in Outlook.
tr: Outlook'ta bir iletide yazım denetimi yapılırken hataların duyulabileceği bir sorun düzeltildi.

source: Changes for 1.0
tr: 1.0 için değişiklikler

source: Initial release.
tr: İlk sürüm.
