Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/resourceMonitor/*/resourceMonitor.xliff
Languages: tr, zh_tw

source: Resource Monitor
tr: Kaynak İzleme
zh_tw: 資源監視器

source: Authors: Alex Hall, Joseph Lee, Kefas Lungu, Beqa Gozalishvili, Tuukka Ojala, Ethin Probst and other NVDA contributors
tr: Yazarlar: Alex Hall, Joseph Lee, Kefas Lungu, Beqa Gozalishvili, Ethin Probst ve diğer NVDA katılımcıları
zh_tw: 作者：Alex Hall, Joseph Lee, Kefas Lungu, Beqa Gozalishvili, Tuukka Ojala, Ethin Probst 和其他 NVDA 貢獻者

source: This add-on gives information about CPU load, memory usage and other resource usage information.
tr: Bu eklenti, CPU yükü, bellek kullanımı ve diğer kaynak kullanımları hakkında bilgi verir.
zh_tw: 這個附加元件提供有關 CPU 負載，記憶體使用情況，及其他資源的使用訊息。

source: Shortcuts
tr: Kısayollar
zh_tw: 快速鍵

source: All commands support speech on demand mode.
tr: Tüm komutlar isteğe bağlı konuşma modunu destekler.
zh_tw: 所有指令皆支援隨選語音模式。

source: NVDA+Shift+E: presents used ram, average processor load, and battery info if available.
tr: NVDA+Shift+E: kullanılan ram, ortalama işlemci yükü ve varsa pil bilgilerini sunar.
zh_tw: NVDA+Shift+E：顯示已使用記憶體、處理器平均負載、電池資訊 (若可用)。

source: NVDA+Shift+1: presents the average processor load and if multicore CPU's are present the load of each core.
tr: NVDA+Shift+1: ortalama işlemci yükünü ve çok çekirdekli CPU'lar varsa her bir çekirdeğin yükünü gösterir.
zh_tw: NVDA+Shift+1：顯示平均處理器負載；若有多核心 CPU，則一併顯示各個核心的負載。

source: NVDA+Shift+2/5: presents the used and total space for both physical and virtual ram.
tr: NVDA+Shift+2/5: hem fiziksel hem de sanal ram için kullanılan ve toplam alanı sunar.
zh_tw: NVDA+Shift+2/5：顯示實體及虛擬記憶體的已使用空間及總計空間。

source: NVDA+Shift+3: presents the used and total space of the static and removable drives.
tr: NVDA+Shift+3: statik ve çıkarılabilir sürücülerin kullanılan ve toplam alanını sunar.
zh_tw: NVDA+Shift+3：顯示本機磁碟與卸除式磁碟機的已用空間和總空間。

source: NVDA+Shift+4: presents battery percentage, charging status, remaining time (if not charging), and a warning if the battery is low or critical.
tr: NVDA+Shift+4: pil yüzdesini, şarj durumunu, kalan süreyi (şarjda değilse) ve pil zayıf veya kritikse bir uyarı duyurur.
zh_tw: NVDA+Shift+4：顯示電池百分比、充電狀態、剩餘時間 (若沒有在充電)，及電池電量低或非常低時的警告。

source: NVDA+Shift+6: presents CPU Architecture and Windows version and service pack numbers.
tr: NVDA+Shift+6: CPU Mimarisini, Windows sürümünü ve hizmet paketi numaralarını duyurur.
zh_tw: NVDA+Shift+6：顯示 CPU 架構、Windows 版本及組件編號。

source: NVDA+Shift+7: presents the system's uptime.
tr: NVDA+Shift+7: sistemin çalışma süresini gösterir.
zh_tw: NVDA+Shift+7：顯示系統執行時間。

source: NVDA+Shift+8: presents information on the wireless connection, ssid name and strength, or no ssid if there is none available.
tr: NVDA+Shift+8: kablosuz bağlantı, ssid adı ve gücü veya yoksa ssid olmadığı konusunda bilgi verir.
zh_tw: NVDA+Shift+8：顯示無線網路連線的資訊、SSID 名稱及強度；若沒有可用連線，則顯示沒有 SSID。

source: You can change these shortcut keys via input gestures dialog.
tr: Girdi hareketleri iletişim kutusu aracılığıyla bu kısayol tuşlarını değiştirebilirsiniz.
zh_tw: 您可以透過輸入手勢對話框來變更這些快速鍵。

source: Usage notes
tr: Kullanım notları
zh_tw: 使用者請注意

source: This add-on does not replace task manager and other system information programs for Windows. Also note the following:
tr: Bu eklenti görev yöneticisi ya da sistem bilgisiyle ilgili başka uygulamaların yerine geçmez. Yanısıra, aşağıdakileri de not edin:
zh_tw: 這個附加元件不會取代 Windows 的工作管理員及其他系統程式訊息。還要留意以下幾點：

source: Resource information cannot be copied to clipboard if running the add-on in secure screens.
tr: Eklenti güvenli ekranlarda çalıştırılıyorsa kaynak bilgileri panoya kopyalanamaz.
zh_tw: 若在安全畫面上執行此附加元件，資源資訊將無法複製至剪貼簿。

source: CPU usage is given for logical processors, not physical cores. This is noticeable for processors which uses Hyper-Threading where number of CPU's is twice the number of CPU cores. On some newer computers, not all CPU cores will have hyper-threading enabled.
tr: CPU kullanımı fiziksel çekirdekler için değil mantıksal işlemciler için verilmiştir. Bu, CPU sayısının CPU çekirdeği sayısının iki katı olduğu Hyper-Threading kullanan işlemciler için fark edilir. Bazı yeni bilgisayarlarda, tüm CPU çekirdeklerinde hiper iş parçacığı etkin olmayacaktır.
zh_tw: CPU 使用率是針對邏輯處理器而非實體核心。對於使用超執行緒的處理器來說，這是顯而易見的，其中 CPU 的數量是 CPU 核心數量的兩倍。在某些較新的電腦上，並非所有 CPU 核心都會啟用超執行緒。

source: If there is heavy disk activity such as copying large files, there might be delays when obtaining disk usage information.
tr: Büyük dosyaların kopyalanması gibi yoğun disk etkinliği varsa, disk kullanım bilgilerinin alınmasında gecikmeler olabilir.
zh_tw: 如果正在進行繁忙的磁碟活動例如複製大型檔案，則獲取磁碟使用訊息時可能出現延遲。

source: When announcing processor architecture information, "x86" and "AMD64" refer to 32-bit and 64-bit (x64) Intel and AMD processors, respectively.
tr: İşlemci mimarisi bilgileri açıklanırken "x86" ve "AMD64" sırasıyla 32 bit ve 64 bit (x64) Intel ve AMD işlemcileri ifade eder.
zh_tw: 讀出處理器架構資訊時，「x86」和「AMD64」分別指 32 位元和 64 位元 (x64) 的 Intel 及 AMD 處理器。

source: While this add-on supports windows 8.1 (limited support), Windows 10 22H2 (2022 Update/build 19045) or later is recommended.
tr: Bu eklenti Windows 8.1'i (sınırlı destek) desteklese de, Windows 10 22H2 (2022 Güncellemesi/derleme 19045) veya üstü önerilir.
zh_tw: 雖然此附加元件支援 Windows 8.1 (有限支援)，但建議使用 Windows 10 22H2 (2022 年更新/組建 19045) 或更新版本。

source: Installing the add-on on Windows 10/11 LTSC is not supported.
tr: Eklentinin Windows 10/11 LTSC'ye yüklenmesi desteklenmemektedir.
zh_tw: 不支援在 Windows 10/11 LTSC 上安裝此附加元件。

source: Version 25.09
tr: Sürüm 25.09
zh_tw: 25.09 版

source: NVDA 2025.2 or later is required.
tr: NVDA 2025.2 veya üstü gereklidir.
zh_tw: 需要 NVDA 2025.2 或更新版本。

source: Version 25.07
tr: Sürüm 25.07
zh_tw: 25.07 版

source: Made the add-on code more robust with help from Pyright (a Python static type checker).
tr: Eklenti kodu Pyright'ın (Python statik tip denetleyicisi) yardımıyla daha sağlam hale getirildi.
zh_tw: 在 Pyright (一個 Python 靜態類型檢查器) 的幫助下，使附加元件的程式碼更為穩健。

source: Version 25.06
tr: Sürüm 25.06
zh_tw: 25.06 版

source: Improved connection status announcement when connecting to wireless networks (@danstiv).
tr: Kablosuz ağlara bağlanırken bağlantı durumu duyurusu iyileştirildi (@danstiv).
zh_tw: 改善了連線至無線網路時的連線狀態報讀 (@danstiv)。

source: Version 25.02
tr: Sürüm 25.02
zh_tw: 25.02 版

source: Restored limited support for Windows 8.1.
tr: Windows 8.1 için sınırlı destek geri yüklendi.
zh_tw: 恢復了對 Windows 8.1 的有限支援。

source: Improved accuracy of used and total memory information announcement (@danstiv).
tr: Kullanılan ve toplam hafıza bilgisi duyurusunun (@danstiv) doğruluğu iyileştirildi.
zh_tw: 改善了已使用與總記憶體資訊報讀的準確性 (@danstiv)。

source: NVDA will no longer appear to freeze briefly when performing memory usage command (NVDA+Shift+2/5) the first time after starting NVDA.
tr: NVDA'yı başlattıktan sonra ilk kez bellek kullanım komutu (NVDA+Shift+2/5) gerçekleştirilirken NVDA artık kısa bir süre donuyor gibi görünmeyecek.
zh_tw: 啟動 NVDA 後，首次執行記憶體用量指令 (NVDA+Shift+2/5) 時，NVDA 不再會短暫凍結。

source: Windows Insider Preview releases are no longer reported as "Windows Insider".
tr: Windows Insider Önizleme sürümleri artık "Windows Insider" olarak raporlanmıyor.
zh_tw: Windows Insider Preview 版本不再會被報讀為「Windows Insider」。

source: Version 24.08
tr: Sürüm 24.08
zh_tw: 24.08 版

source: NVDA 2024.2 or later is required. This allows psutil dependency to be removed from the add-on as NVDA includes it.
tr: NVDA 2024.2 veya üstü gereklidir.
zh_tw: 需要 NVDA 2024.2 或更新版本。這使得附加元件可以移除 psutil 相依套件，因為 NVDA 已包含此套件。

source: Updated psutil dependency to the version included with NVDA 2024.2 (6.0.0).
tr: Psutil bağımlılığı NVDA 2024.2 (6.0.0) ile birlikte gelen sürüme güncellendi.
zh_tw: 已將 psutil 相依套件更新至 NVDA 2024.2 內含的版本 (6.0.0)。

source: Ruff replaces Flake8 as code linter.
tr: Ruff, kod linter olarak Flake8'in yerini alır.
zh_tw: Ruff 取代 Flake8 作為程式碼風格檢查工具。

source: Version 24.05
tr: Sürüm 24.05
zh_tw: 24.05 版

source: NVDA 2024.1 or later is required.
tr: NVDA 2024.1 veya üstü gereklidir.
zh_tw: 需要 NVDA 2024.1 或更新版本。

source: NVDA will recognize wireless networks with WPA3 authentication methods such as shared authentication of equals (SAE).
tr: NVDA, eşitlerin eşzamanlı kimlik doğrulaması (SAE) gibi WPA3 kimlik doğrulama yöntemlerine sahip kablosuz ağları tanıyacak.
zh_tw: NVDA 現在能識別採用 WPA3 驗證方式 (例如對等實體同步驗證 (SAE)) 的無線網路。

source: Version 24.04
tr: Sürüm 24.04
zh_tw: 24.04 版

source: Updated psutil dependency to 5.9.8.
tr: Psutil bağımlılığı 5.9.8'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.9.8 版。

source: Added support for speech on demand mode so resource information can be announced in this mode.
tr: Kaynak bilgilerinin bu modda duyurulabilmesi için isteğe bağlı konuşma modu desteği eklendi.
zh_tw: 新增了對隨選朗讀模式的支援，以便在此模式下能讀出資源資訊。

source: Version 23.11
tr: Sürüm 23.11
zh_tw: 23.11 版

source: Downgraded psutil dependency to 5.9.4 due to problems with memory usage announcements.
tr: Bellek kullanımı duyurularındaki sorunlar nedeniyle psutil bağımlılığı 5.9.4'e düşürüldü.
zh_tw: 由於讀出記憶體用量發生問題，已將 psutil 相依套件降級至 5.9.4 版。

source: Version 23.10
tr: Sürüm 23.10
zh_tw: 23.10 版

source: Updated psutil dependency to 5.9.5.
tr: Psutil bağımlılığı 5.9.5'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.9.5 版。

source: Version 23.09
tr: Sürüm 23.09
zh_tw: 23.09 版

source: NVDA will no longer log startup error messages on Windows Server systems when wireless capability modules are unavailable.
tr: NVDA, kablosuz özellik modülleri kullanılamadığında artık Windows Server sistemlerinde başlatma hata mesajlarını günlüğe kaydetmeyecek.
zh_tw: 在 Windows Server 系統上，當無線功能模組不可用時，NVDA 不再會記錄啟動錯誤訊息。

source: Version 23.06
tr: Sürüm 23.06
zh_tw: 23.06 版

source: Situation where resourceMonitor doesn't work properly due to unavailability of wireless adapters has been fixed.
tr: Kablosuz bağdaştırıcıların bulunmaması nedeniyle Kaynak İzleyici'nin düzgün çalışmaması durumu düzeltildi.
zh_tw: 修正了因無線網路卡無法使用，而導致資源監視器無法正常運作的問題。

source: Version 23.05.1
tr: Sürüm 23.05.1
zh_tw: 23.05.1 版

source: wlanReporter NVDA-addon is now part of resourceMonitor!
tr: kablosuz Ağ Bilgilendirici NVDA eklentisi, artık Kaynak İzleme'nin bir parçası!
zh_tw: wlanReporter NVDA 附加元件現已成為資源監視器的一部分！

source: The old way of checking for wireless connections has been replaced by the windows API from wlanReporter: https://github.com/kvark128/WlanReporter/ .
tr: Kablosuz bağlantıları kontrol etmenin eski yönteminin yerini Kablosuz Ağ Bilgilendirici'nin Windows API'si aldı: https://github.com/kvark128/WlanReporter/ .
zh_tw: 檢查無線網路連線的舊方法已被 wlanReporter 的 Windows API 取代：https://github.com/kvark128/WlanReporter/ 。

source: After speaking SSID name and strength, NVDA will also now tell you the security type of your network.
tr: SSID adını ve gücünü söyledikten sonra, NVDA şimdi size ağınızın güvenlik türünü de söyleyecektir.
zh_tw: 讀出 SSID 名稱與訊號強度後，NVDA 現在也會告知您網路的安全性類型。

source: NVDA will now alert you when you connect and disconnect from a wireless network.
tr: NVDA artık kablosuz bir ağa bağlandığınızda ve bağlantıyı kestiğinizde sizi uyaracak.
zh_tw: 當您連線或中斷無線網路時，NVDA 現在會提醒您。

source: NVDA will now alert you when wireless connections is turned on or off.
tr: NVDA artık kablosuz bağlantılar açıldığında veya kapatıldığında sizi uyaracak.
zh_tw: 當無線網路連線開啟或關閉時，NVDA 會提醒您。

source: Version 23.05
tr: Sürüm 23.05
zh_tw: 23.05 版

source: added the ability to detect and present the state of the connected wireless network.
tr: bağlı kablosuz ağın durumunu tespit etme ve sunma yeteneği eklendi.
zh_tw: 新增了偵測並顯示已連線無線網路狀態的功能。

source: Announces the name of the connected wireless SSID.
tr: Bağlı kablosuz SSID'nin adını duyurur.
zh_tw: 讀出已連線無線網路的 SSID 名稱。

source: Announces the strength of the ssid
tr: SSID'nin gücünü duyurur
zh_tw: 讀出 ssid 的訊號強度

source: Announce SSID not found if None is detected.
tr: Hiçbir SSID algılanmazsa bulunamadığı konusunda bilgi duyurur.
zh_tw: 若偵測不到任何 SSID，則讀出找不到 SSID。

source: Version 23.02
tr: Sürüm 23.02
zh_tw: 23.02 版

source: NVDA 2022.4 or later is required.
tr: NVDA 2022.4 veya üstü gereklidir.
zh_tw: 需要 NVDA 2022.4 或更新版本。

source: Windows 10 21H2 (November 2021 Update/build 19044) or later is required.
tr: Windows 10 21H2 (Kasım 2021 Güncellemesi/derlemesi 19044) veya üstü gereklidir.
zh_tw: 需要 Windows 10 21H2 (2021 年 11 月更新/組建 19044) 或更新版本。

source: Version 23.01
tr: Sürüm 23.01
zh_tw: 23.01 版

source: NVDA 2022.3 or later is required.
tr: NVDA 2022.3 veya üstü gereklidir.
zh_tw: 需要 NVDA 2022.3 或更新版本。

source: Windows 10 or later is required as Windows 7, 8, and 8.1 are no longer supported by Microsoft as of January 2023.
tr: Ocak 2023 itibariyle Windows 7, 8 ve 8.1 artık Microsoft tarafından desteklenmediğinden Windows 10 veya sonraki sürümleri gereklidir.
zh_tw: 需要 Windows 10 或更新版本，因為微軟自 2023 年 1 月起，已不再支援 Windows 7、8 和 8.1。

source: Updated psutil dependency to 5.9.4.
tr: Psutil bağımlılığı 5.9.4'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.9.4 版。

source: NVDA will announce actual processor architecture (x86/AMD64/ARM64) as part of Windows version information.
tr: NVDA, Windows sürüm bilgilerinin bir parçası olarak gerçek işlemci mimarisini (x86/AMD64/ARM64) duyurur.
zh_tw: NVDA 會讀出實際的處理器架構 (x86/AMD64/ARM64)，作為 Windows 版本資訊的一部分。

source: On single-core systems, NVDA will no longer announce CPU core load as average CPU load is the same as core load.
tr: Tek çekirdekli sistemlerde, ortalama CPU yükü çekirdek yükü ile aynı olduğundan, NVDA artık CPU çekirdek yükünü duyurmayacaktır.
zh_tw: 在單核心系統上，NVDA 不再讀出 CPU 核心負載，因為平均 CPU 負載與核心負載相同。

source: Version 22.03
tr: Sürüm 22.03
zh_tw: 22.03 版

source: Version 22.03 is the last stable version to support Windows 7 Service Pack 1, 8, and 8.1.
tr: Sürüm 22.03 Windows 7 Servis Pack 1, 8 ve 8.1'i destekleyen son kararlı sürümdür.
zh_tw: 22.03 版是最後一個支援 Windows 7 Service Pack 1、8 和 8.1 的穩定版本。

source: NVDA 2021.3 or later is required.
tr: NVDA 2021.3 veya üstü gereklidir.
zh_tw: 需要 NVDA 2021.3 或更新版本。

source: A warning message will be displayed when attempting to install the add-on on Windows 7, 8, and 8.1.
tr: Eklentiyi Windows 7, 8 ve 8.1'e yüklemeye çalışırken bir uyarı mesajı görüntülenecektir.
zh_tw: 當嘗試在 Windows 7、8 和 8.1 上安裝此附加元件時，將會顯示一則警告訊息。

source: Updated psutil dependency to 5.9.0.
tr: Psutil bağımlılığı 5.9.0'a güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.9.0 版。

source: Version 22.01
tr: Sürüm 22.01
zh_tw: 22.01 版

source: NVDA 2021.2 or later is required.
tr: NVDA 2021.2 veya üstü gereklidir.
zh_tw: 需要 NVDA 2021.2 或更新版本。

source: Version 21.10
tr: Sürüm 21.10
zh_tw: 21.10 版

source: NVDA 2021.1 or later is required due to changes to NVDA that affects this add-on.
tr: Bu eklentiyi etkileyen NVDA değişiklikleri nedeniyle NVDA 2021.1 veya üstü gereklidir.
zh_tw: 由於 NVDA 的變更會影響此附加元件，因此需要 NVDA 2021.1 或更新版本。

source: Version 21.08
tr: Sürüm 21.08
zh_tw: 21.08 版

source: Minimum Windows release requirement is now tied to NVDA releases.
tr: Minimum Windows sürüm gereksinimi artık NVDA sürümlerine bağlıdır.
zh_tw: 最低 Windows 版本需求現已與 NVDA 版本綁定。

source: Windows builds 20348 and 22000 are recognized as Windows Server 2022 and Windows 11, respectively.
tr: Windows derlemeleri 20348 ve 22000, sırasıyla Windows Server 2022 ve Windows 11 olarak tanınır.
zh_tw: Windows 組建 20348 和 22000 分別被識別為 Windows Server 2022 和 Windows 11。

source: On Insider Preview builds, Windows release such as "Windows 10" will not be used. Instead NvDA will announce "Windows Insider".
tr: Insider Preview derlemelerinde, "Windows 10" gibi Windows sürümleri kullanılmayacaktır. Bunun yerine NvDA "Windows Insider" duyurusunu yapar.
zh_tw: 在 Insider Preview 組建上，不會使用「Windows 10」等 Windows 版本名稱，Nvda 將改為讀出「Windows Insider」。

source: On 64-bit systems, processor architecture (x64 or ARM64) will be announced as part of Windows version information.
tr: 64 bit sistemlerde, işlemci mimarisi (x64 veya ARM64), Windows sürüm bilgilerinin bir parçası olarak duyurulacaktır.
zh_tw: 在 64 位元系統上，處理器架構 (x64 或 ARM64) 將會作為 Windows 版本資訊的一部分被讀出。

source: Version 21.04
tr: Sürüm 21.04
zh_tw: 21.04 版

source: NVDA 2020.4 or later is required.
tr: NVDA 2020.4 veya üstü gereklidir.
zh_tw: 需要 NVDA 2020.4 或更新版本。

source: Updated psutil dependency to 5.8.0.
tr: Psutil bağımlılığı 5.8.0'a güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.8.0 版。

source: When pressing add-on commands twice to copy resource information to clipboard, NVDA will announce resource summary that is being copied.
tr: Kaynak bilgilerini panoya kopyalamak için eklenti komutlarına iki kez basıldığında, NVDA kopyalanmakta olan kaynak özetini söyler.
zh_tw: 按兩次附加元件指令以將資源資訊複製至剪貼簿時，NVDA 會讀出正在被複製的資源摘要。

source: Version 21.01
tr: Sürüm 21.01
zh_tw: 21.01 版

source: Updated psutil dependency to 5.7.3.
tr: Psutil bağımlılığı 5.7.3'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.7.3 版。

source: Shortened Windows version message.
tr: Kısaltılmış Windows sürüm mesajı.
zh_tw: 縮短了 Windows 版本訊息。

source: On Windows 8.1, build.revision will be announced as part of Windows version message, similar to Windows 10.
tr: Windows 8.1'de build.revision, Windows 10'a benzer şekilde Windows sürüm mesajının bir parçası olarak duyurulacaktır.
zh_tw: 在 Windows 8.1 上，build.revision 將會作為 Windows 版本訊息的一部分被報讀，類似於 Windows 10。

source: Version 20.09
tr: Sürüm 20.09
zh_tw: 20.09 版

source: System uptime is now given as days, hours, minutes, seconds.
tr: Sistem çalışma süresi artık gün, saat, dakika, saniye olarak verilmektedir.
zh_tw: 系統執行時間現在以日、時、分、秒的方式呈現。

source: Windows Server Insider Preview build 20201 or later is properly recognized as a Server Insider build.
tr: Windows Server Insider Preview derlemesi 20201 veya üstü, bir Server Insider derlemesi olarak doğru şekilde tanınır.
zh_tw: Windows Server Insider Preview 組建 20201 或更新版本，現在能被正確識別為 Server Insider 組建。

source: Version 20.07
tr: Sürüm 20.07
zh_tw: 20.07 版

source: Windows 10 Version 20H2 is properly recognized when obtaining Windows version information (NVDA+Shift+6).
tr: Windows 10 Sürüm 20H2, Windows sürüm bilgisi (NVDA+Shift+6) alınırken düzgün şekilde tanınır.
zh_tw: 取得 Windows 版本資訊 (NVDA+Shift+6) 時，Windows 10 20H2 版能被正確識別。

source: Simplified Windows 10 version message i.e. Windows 10 YYMM instead of Windows 10verYYMM when pressing NVDA+Shift+6.
tr: Basitleştirilmiş Windows 10 sürüm mesajı, yani NVDA+Shift+6 tuşlarına basıldığında Windows 10verYYAA yerine Windows 10 YYAA.
zh_tw: 按下 NVDA+Shift+6 時，簡化了 Windows 10 版本訊息，即從 Windows 10verYYMM改為Windows 10 YYMM。

source: Version 20.06
tr: Sürüm 20.06
zh_tw: 20.06 版

source: Resolved many coding style issues and potential bugs with Flake8.
tr: Flake8 ile birçok kodlama stili sorunu ve olası hatalar çözüldü.
zh_tw: 透過 Flake8 解決了許多編碼風格問題與潛在錯誤。

source: Version 20.04
tr: Sürüm 20.04
zh_tw: 20.04 版

source: Updated psutil dependency to 5.7.0.
tr: Psutil bağımlılığı 5.7.0'a güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.7.0 版。

source: Version 20.01
tr: Sürüm 20.01
zh_tw: 20.01 版

source: NVDA 2019.3 or later is required due to extensive use of Python 3.
tr: Python 3'ün yoğun kullanımı nedeniyle NVDA 2019.3 veya üstü gereklidir.
zh_tw: 由於廣泛使用 Python 3，因此需要 NVDA 2019.3 或更新版本。

source: Version 19.11
tr: Sürüm 19.11
zh_tw: 19.11 版

source: Improved detection of Windows Insider Preview builds, especially for 20H1 and beyond.
tr: Özellikle 20H1 ve sonrası için Windows Insider Preview derlemelerinin algılanması iyileştirildi.
zh_tw: 改善了 Windows Insider Preview 組建的偵測，特別是對於 20H1 及之後的版本。

source: Version 19.07
tr: Sürüm 19.07
zh_tw: 19.07 版

source: Updated psutil dependency to 5.6.3.
tr: Psutil bağımlılığı 5.6.3'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.6.3 版。

source: Internal changes to battery status announcement command.
tr: Pil durumu duyuru komutunda dahili değişiklikler.
zh_tw: 讀出電池狀態指令的內部變更。

source: Version 18.12
tr: Sürüm 18.12
zh_tw: 18.12 版

source: Internal changes to support future NVDA releases.
tr: Gelecekteki NVDA sürümlerini desteklemek için dahili değişiklikler.
zh_tw: 內部變更，以支援未來的 NVDA 版本。

source: Version 18.10
tr: Sürüm 18.10
zh_tw: 18.10 版

source: Code has been made more compatible with Python 3.
tr: Kod Python 3 ile daha uyumlu hale getirildi.
zh_tw: 程式碼已變得與 Python 3 更相容。

source: Updated psutil dependency to 5.4.7.
tr: Psutil bağımlılığı 5.4.7'ye güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.4.7 版。

source: When obtaining disk capacity and memory usage, NVDA will no longer give errors if using a computer or a service with more than a petabyte of RAM or disk size.
tr: Disk kapasitesi ve bellek kullanımı elde edilirken, NVDA, bir petabayttan fazla RAM veya disk boyutuna sahip bir bilgisayar veya hizmet kullanıldığında artık hata vermeyecektir.
zh_tw: 當取得磁碟容量和記憶體用量時，若使用具備超過 1 PB 記憶體或磁碟空間的電腦或服務，NVDA 不再會出現錯誤。

source: Values for memory and disk usage are shown with up to two decimal places (e.g. 4.00 GB instead of 4.0 GB).
tr: Bellek ve disk kullanımına ilişkin değerler en fazla iki ondalık basamakla gösterilir (ör. 4.0 GB yerine 4.00 GB).
zh_tw: 記憶體與磁碟用量的值，現在會顯示至小數點後兩位 (例如 4.00 GB 而非 4.0 GB)。

source: Improved detection of Windows Insider Preview builds.
tr: Windows Insider Preview derlemelerinin algılanması iyileştirildi.
zh_tw: 改善了 Windows Insider Preview 組建的偵測。

source: Version 18.04
tr: Sürüm 18.04
zh_tw: 18.04 版

source: Version 18.04.x is the last release to support Windows releases earlier than 7 SP1.
tr: Sürüm 18.04.x , Windows 7 SP1'den önceki sürümleri destekleyen son sürümdür.
zh_tw: 18.04.x 版是最後一個支援 Windows 7 SP1 之前版本作業系統的版本。

source: Last release to support Windows Server 2003, Vista and Server 2008.
tr: Windows Server 2003, Vista ve Server 2008'i destekleyen son sürüm.
zh_tw: 最後一個支援 Windows Server 2003、Vista 和 Server 2008 的版本。

source: Better detection of Windows 10 releases and distinguishing between public and Insider Preview builds.
tr: Windows 10 sürümlerinin daha iyi algılanması ve genel ve Insider Preview derlemeleri arasında ayrım yapılması.
zh_tw: 更佳地偵測 Windows 10 版本，並能區分公開版與 Insider Preview 組建。

source: Version 17.12
tr: Sürüm 17.12
zh_tw: 17.12 版

source: Added support for 64-bit ARM processors on Windows 10.
tr: Windows 10'da 64 bit ARM işlemciler için destek eklendi.
zh_tw: 新增支援 Windows 10 的 64 位元 ARM 處理器。

source: Version 17.09
tr: Sürüm 17.09
zh_tw: 17.09 版

source: Important: Version 17.09.x is the last version to support Windows XP.
tr: Önemli: Sürüm 17.09.x, Windows XP'yi destekleyen son sürümdür.
zh_tw: 重要提醒：17.09.x 版是支援 Windows XP 的最後一個版本。

source: Last version to run on Windows XP.
tr: Windows XP'de çalışacak son sürüm.
zh_tw: 最後一個能在 Windows XP 執行的版本。

source: Windows 10 build 16278 and later is recognized as Version 1709. A minor revision for this add-on will be released once Version 1709 stable build is released.
tr: Windows 10 build 16278 ve sonraki sürümleri Sürüm 1709 olarak tanınır. Sürüm 1709 kararlı yapı yayınlandığında bu eklenti için küçük bir revizyon yayınlanacaktır.
zh_tw: Windows 10 組建 16278 及其之後的版本，已可被識別為 1709 版。等到組建 1709 的穩定版釋出後，此元件也將發布一個小幅修正的版本。

source: Version 17.07.1
tr: Sürüm 17.07.1
zh_tw: 17.07.1 版

source: Reintroduce support for Windows XP (broken since version 17.02).
tr: Windows XP desteği yeniden verildi (17.02 sürümünden beri bozulmuştu).
zh_tw: 重新支援 Windows XP。（早先從 17.02 版就不支援了）。

source: Version 17.05
tr: Sürüm 17.05
zh_tw: 17.05 版

source: Announcement of system uptime (time passed since last boot; NVDA+Shift+7).
tr: Sistem çalışma süresinin duyurusu (son önyüklemeden bu yana geçen süre; NVDA+Shift+7).
zh_tw: 顯示系統執行時間（最近一次開機後經過的時間，NVDA+Shift+7）。

source: Version 17.02
tr: Sürüm 17.02
zh_tw: 17.02 版

source: Updated psutil dependency to 5.0.1.
tr: Psutil bağımlılığı 5.0.1'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 5.0.1 版。
