Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/resourceMonitor/*/resourceMonitor.xliff
Languages: tr, zh_tw

source: When checking disk usage, NVDA will no longer present an error dialog on some systems where a removable media is not properly recognized (such as when a card isn't inserted into a card reader).)
tr: Disk kullanımını kontrol ederken, NVDA, çıkarılabilir medyanın düzgün tanınmadığı bazı sistemlerde (örneğin, bir kart okuyucuya bir kart takılmadığında) artık bir hata iletişim kutusu göstermeyecektir.)
zh_tw: 檢查磁碟使用情形時，在卸除式裝置未被正確識別的某些系統上（例如，當卡未插入讀卡機時），NVDA 不在出現錯誤對話框。）

source: Version 16.08
tr: Sürüm 16.08
zh_tw: 16.08 版

source: Starting with version 16.08, add-on releases will be shown as year.month.revision.
tr: 16.08 sürümünden itibaren, eklenti sürümleri yıl.ay.revizyonu olarak gösterilecektir.
zh_tw: 從 16.08 版起，新版附加元件將使用年.月為版本號。

source: Various revisions of Windows 10 are now properly recognized (such as 1607 for build 14393).
tr: Windows 10'un çeşitli revizyonları artık düzgün bir şekilde tanınmaktadır (derleme 14393 için 1607 gibi).
zh_tw: Windows 10 的幾個更新版本，已可正確識別（例如：1607、14393）。

source: Windows 10 build revisions (after installing cumulative updates) are properly recognized (such as 14393.51).
tr: Windows 10 derleme revizyonları (kümülatif güncellemeleri yükledikten sonra) düzgün bir şekilde tanınır (14393.51 gibi).
zh_tw: Windows 10 組建版本（在安裝累積更新後），已可被正確識別，（如14393.51）。

source: If using Insider Preview builds, this fact is recognized.
tr: Insider Preview derlemelerini kullanıyorsanız, bu gerçek kabul edilir.
zh_tw: 如果使用 Insider Preview 組建，已可識別。

source: Changes for 4.5
tr: 4.5 için değişiklikler
zh_tw: 4.5 版的變更

source: Add-on repository has moved to GitHub (can be found at https://github.com/josephsl/resourcemonitor).
tr: Eklenti deposu GitHub'a taşındı (https://github.com/josephsl/resourcemonitor adresinde bulunabilir).
zh_tw: 此元件的儲存庫搬移到 GitHub，網址為 (https://github.com/josephsl/resourcemonitor)。

source: Windows Server 2016 is properly recognized.
tr: Windows Server 2016 düzgün bir şekilde tanındı.
zh_tw: Windows Server 2016 已能正確識別。

source: Changes for 4.0
tr: 4.0 için değişiklikler
zh_tw: 4.0 版的變更

source: Updated psutil dependency to 2.2.1.
tr: Psutil bağımlılığı 2.2.1'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 2.2.1 版。

source: Vastly improved performance when obtaining information on CPU load.
tr: CPU yükü hakkında bilgi alırken büyük ölçüde geliştirilmiş performans.
zh_tw: 在取得有關 CPU 負載資訊時，效能大幅改善。

source: Added support for recognition of Windows 10.
tr: Windows 10'un tanınması için destek eklendi.
zh_tw: 新增了對 Windows 10 的識別。

source: In Windows 10, the build number of Windows will also be announced.
tr: Windows 10'da Windows'un derleme numarası da duyurulacak.
zh_tw: 在 Windows 10中，已可顯示 Windows 的內部版本號。

source: You can use Add-ons Manager to access add-on help.
tr: Eklenti yardımına erişmek için Eklenti Mağazasını kullanabilirsiniz.
zh_tw: 您可在「管理附加元件」中，獲得元件說明。

source: Changes for 3.1
tr: 3.1 için değişiklikler
zh_tw: 3.1 版的變更

source: Resource Monitor officially supports Windows 8.1.
tr: Kaynak İzleme resmi olarak Windows 8.1'i destekler.
zh_tw: 資源監視器正式支援 Windows 8.1。

source: Updated translations.
tr: Çeviriler güncellendi.
zh_tw: 更新翻譯。

source: Changes for 3.0
tr: 3.0 için değişiklikler
zh_tw: 3.0 版的變更

source: Updated psutil dependency to 1.2.1.
tr: Psutil bağımlılığı 1.2.1'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 1.2.1 版。

source: Announcement of current Windows version, CPU architecture and service pack if any (NVDA+Shift+6).
tr: Mevcut Windows sürümünün, CPU mimarisinin ve varsa hizmet paketinin duyurusu (NVDA+Shift+6).
zh_tw: 顯示目前 Windows 版本及 Service Pack (NVDA+Shift+6)。

source: Ability to change add-on shortcut keys (NVDA 2013.3 or later).
tr: Kısayol tuşları, NVDA 2013.3 sürümüyle birlikte değiştirilebilir.
zh_tw: 可變更元件快速鍵，（需 NVDA 2013.3 或更高版本）。

source: Ability to copy individual resource information to clipboard by pressing resource commands two times.
tr: Kaynak bilgisi öğrenme komutlarına iki kez basıldığında bilgi panoya kopyalanıyor.
zh_tw: 可複製個別資源摘要到剪貼簿，方法是相同的元件指令連按兩次。

source: Changes for 2.4
tr: 2.4 için değişiklikler
zh_tw: 2.4 版的變更

source: New languages: Chinese (simplified), Ukrainian.
tr: Yeni diller: Çince (basitleştirilmiş), Ukraynaca.
zh_tw: 新增語言：中文（簡體）、，烏克蘭文。

source: Updated translations.
tr: Çeviriler güncellendi.
zh_tw: 更新翻譯。

source: Changes for 2.3
tr: 2.3 için değişiklikler
zh_tw: 2.3 版的變更

source: Added Bulgarian translation.
tr: Bulgarca çeviri eklendi.
zh_tw: 新增保加利亞文翻譯。

source: Changes for 2.2
tr: 2.2 için değişiklikler
zh_tw: 2.2 版的變更

source: Added following translations: Arabic, Aragonese, Croatian, Dutch, Finnish, French, Galician, German, Hungarian, Italian, Japanese, Korean, Nepali, Polish, Portuguese (Brazil), Russian, Slovak, Slovenian, Spanish, Tamil and Turkish.
tr: Şu çeviriler eklendi: Arapça, Aragonca, Hırvatça, Felemenkçe, Fince, Fransızca, Galiçyaca, Almanca, Macarca, İtalyanca, Japonca, Korece, Nepalce, Lehçe, Portekizce (Brezilya), Rusça, Slovakça, Slovence, İspanyolca, Tamilce ve Türkçe.
zh_tw: 新增以下翻譯：阿拉伯文、阿拉貢文、克羅埃西亞文、荷蘭文、芬蘭文、法文、加里斯亞文、德文、匈牙利文、意大利文、日文、韓文、尼泊爾文、波蘭文、葡萄牙文（巴西）、俄文、斯洛伐克文、斯洛維尼亞文、西班牙文、坦米爾文、土耳其文。

source: Changes for 2.1
tr: 2.1 için değişiklikler
zh_tw: 2.1 版的變更

source: Updated psutil dependency to version 0.6.1.
tr: Psutil bağımlılığı 0.6.1'e güncellendi.
zh_tw: 已將 psutil 相依套件更新至 0.6.1 版。

source: Fixed long delay when getting information of drives.
tr: Sürücülerin bilgisini alırken uzun gecikme düzeltildi.
zh_tw: 取得磁碟訊息時，修正延遲較長時間的問題。

source: Code cleanup.
tr: Kod temizlendi.
zh_tw: 程式碼清理。

source: Changes for 2.0
tr: 2.0 için değişiklikler
zh_tw: 2.0 版的變更

source: added translation support and translation comments.
tr: çeviri desteği ve açıklamalar eklendi.
zh_tw: 支援翻譯元件及翻譯註解。

source: Changes for 1.0
tr: 1.0 için değişiklikler
zh_tw: 1.0 版的變更

source: Initial Release
tr: İlk sürüm
zh_tw: 初始版本
