Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/pcKbBrl/*/pcKbBrl.xliff
Languages: ru

source: PC Keyboard Braille Input for NVDA
ru: Клавиатура ПК для ввода по Брайлю в NVDA

source: Author: NV Access Limited, Noelia Ruiz Martínez
ru: Автор: NV Access Limited, Noelia Ruiz Martínez

source: Copyright: 2012-2023 NV Access Limited, Noelia Ruiz Martínez
ru: Авторское право: 2012-2023 NV Access Limited, Noelia Ruiz Martínez

source: License: GNU General Public License version 2.0
ru: Лицензия: GNU General Public License версия 2.0

source: This NVDA add-on allows braille to be entered via the PC keyboard.
ru: Это дополнение NVDA позволяет ввод Брайля с помощью клавиатуры ПК.

source: Currently, the following keyboard layouts are supported:
ru: В настоящее время поддерживаются следующие раскладки клавиатуры:

source: English QWERTY keyboard.
ru: Английская клавиатура QWERTY.

source: French (France).
ru: Французская (Франция).

source: German (Germany).
ru: Немецкая (Германия).

source: Italian (Italy).
ru: Итальянская (Италия).

source: Persian.
ru: Персидская.

source: Portuguese (Portugal).
ru: Португальская (Португалия).

source: Spanish (Spain and Mexico).
ru: Испанская (Испания и Мексика).

source: Turkish.
ru: Турецкая.

source: How to configure
ru: Как настроить

source: The add-on can be configured from its category in the NVDA's settings dialog, under NVDA's menu, Preferences submenu. A gesture for opening the add-on settings panel can be assigned from Input gestures dialog, configuration category.
ru: Дополнение можно настроить из соответствующей категории диалога настроек NVDA, в меню NVDA, подменю параметров. Жест для открытия панели настроек дополнения можно назначить в диалоге жестов ввода, категория конфигурации.

source: Check the corresponding checkbox if you want to type using only one hand, or ensure it's not checked if you prefer to type using the standard mode (two hands).
ru: Установите соответствующий флажок, если вы хотите печатать только одной рукой, или снимите его, если вы предпочитаете печатать в стандартном режиме (двумя руками).

source: You can also select if NVDA should speak a single typed dot (using )the feature of "one hand mode").
ru: Вы также можете выбирать, должна ли NVDA произносить отдельно набираемые точки (при использовании режима "одной руки").

source: If you want dots to be sent automatically when typing with one hand, use the spin control to set a timeout greater than 0.
ru: Если вы хотите, чтобы при наборе текста одной рукой точки выводились автоматически, установите тайм-аут больше 0 с помощью счётчика.

source: In addition, you can set the characters to send, clear and compose dots when typing with one hand, as well as characters to be ignored in one hand or standard mode.
ru: Кроме того, вы можете настроить отправку символов, их удаление и расстановку точек при наборе текста одной рукой, а также символы, которые будут игнорироваться при наборе текста одной рукой или в стандартном режиме.

source: It's also possible to restore defaults in the add-on settings panel.
ru: Также можно восстановить настройки по умолчанию на панели настроек дополнения.

source: How to Use
ru: Как использовать

source: Press NVDA+0 to enable braille input. This gesture can be changed from Input gestures dialog, Braille category.
ru: Нажмите NVDA+0, чтобы включить ввод по брайлю. Этот жест можно изменить в диалоге ввода жестов, в категории Брайля.

source: Type braille by pressing keys together on the PC keyboard as if it were a braille keyboard.
ru: Набирайте текст по брайлю, одновременно нажимая клавиши на клавиатуре ПК, как если бы это была брайлевская клавиатура.

source: If you want to enter text using two hands, use the following keys if you work with a QWERTY English keyboard, or the keys located at the corresponding positions in other layouts:
ru: Если вы хотите ввести текст двумя руками, если вы работаете с английской клавиатурой QWERTY или клавиатурой с совпадающим расположением в других раскладках, используйте следующие клавиши:

source: f, d and s for dots 1, 2 and 3 respectively.
ru: f, d и s для точек 1, 2 и 3 соответственно.

source: j, k and l for dots 4, 5 and 6 respectively.
ru: j, k и l для точек 4, 5 и 6 соответственно.

source: Use the keys a and ; (semi-colon) for dots 7 and 8, respectively.
ru: Используйте a и ; (точка с запятой) для точек 7 и 8, соответственно.

source: You can also use the keys on the row above; i.e. q, w, e, r, u, i, o and p.
ru: Вы также можете использовать клавиши строкой выше, то есть q, w, e, r, u, i, o и p.

source: If you want to type text using one hand, you can compose characters pressing keys simultaneously or in several keystrokes, adding the dots corresponding to the desired character. Press g or h to type the character when you have added all its dots. If you make a mistake building a character, you can clear the dots before typing it by pressing t or y. The keys used in QWERTY English keyboard are the following:
ru: Если вы хотите набирать текст одной рукой, вы можете создавать символы, нажимая клавиши одновременно или несколькими нажатиями, добавляя точки, соответствующие нужному символу. Нажмите g или h, чтобы ввести символ, когда вы добавите все точки. Если вы допустили ошибку при вводе символа, вы можете убрать точки перед его вводом, нажав t или y. В английской клавиатуре QWERTY используются следующие клавиши:

source: Left hand: f, d, s, r, e, w, a, q for dots 1, 2, 3, 4, 5, 6, 7 and 8.
ru: Левая рука: f, d, s, r, e, w, a, q для точек 1, 2, 3, 4, 5, 6, 7 и 8.

source: Right hand: j, k, l, u, i, o, ; (semicolon), p for dots 1, 2, 3, 4, 5, 6, 7 and 8.
ru: Правая рука: j, k, l, u, i, o, ; (точка с запятой), p для точек 1, 2, 3, 4, 5, 6, 7 и 8.

source: You can press most other keys as normal, including space, backspace, enter and function keys. Take care about not pressing alt+shift, since changing the keyboard layout may affect the entered dots.
ru: Вы можете нажимать большинство других клавиш в обычном режиме, включая пробел, бэк спэйс, enter и функциональные клавиши. Следите за тем, чтобы не нажимать alt+shift, поскольку изменение раскладки клавиатуры может повлиять на вводимые точки.

source: Press space bar in combination with braille dots to move the system cursor (or report the current line), just if you were using a braille display. For example, space+dot1 to emulate upArrow, space+dot4+dot5+dot6 to emulate control+end, space+dot1+dot4 to report the current line, etc.
ru: Нажимайте пробел в сочетании с брайлевскими точками, чтобы перемещать системный курсор (или объявить текущую строку), так, как при использовании брайлевского дисплея. Например, пробел+точка1 для эмуляции стрелки вверх, пробел+точка4+точка5+точка6 для эмуляции control+end, пробел+точка1+точка4 для объявления текущей строки и т.д.

source: Press NVDA+0 to disable braille input.
ru: Нажмите NVDA+0, чтобы выключить ввод по брайлю.

source: Important Notes
ru: Важные Примечания

source: This add-on uses NVDA's in-built braille input support.
ru: Это дополнение использует встроенную в NVDA поддержку брайлевского ввода.

source: Therefore, the input table used is that specified in NVDA's Braille Settings dialog.
ru: Таким образом, используется Брайлевская таблица ввода, указанная в диалоге настроек брайля NVDA.

source: Some keyboards, particularly laptop keyboards, cannot handle certain combinations of keys being pressed.
ru: Некоторые клавиатуры, особенно клавиатуры ноутбуков, не могут справиться с нажатием определённых комбинаций клавиш.

source: When this happens, certain keys are simply ignored.
ru: Когда это происходит, некоторые клавиши просто игнорируются.

source: Unfortunately, there is nothing that can be done to fix this, as the keys are simply never received by Windows or NVDA.
ru: К сожалению, это невозможно исправить, так как одиночные клавиши не воспринимаются как комбинации в Windows или в NVDA.

source: In some cases, using the upper row of keys with either or both hands might help, as your keyboard may allow these keys.
ru: В некоторых случаях может помочь использование верхнего ряда клавиш одной или обеими руками, так как ваша клавиатура может использовать эти клавиши.

source: Changes for 44.0.0
ru: Изменения в 44.0.0

source: Added kannada.cti table.
ru: Добавлена таблица kannada.cti.

source: Changes for 28.0.0
ru: Изменения в 28.0.0

source: Changed default values for One hand mode.
ru: Изменены значения по умолчанию для режима работы одной рукой.

source: Changes for 2023.02.23
ru: Изменения в 2023.02.23

source: Added ability to configure keys used to type dots in one hand mode.
ru: Добавлена возможность настройки клавиш, используемых для ввода точек одной рукой.

source: Now you can configure keys that should be ignored when typing in braille.
ru: Теперь вы можете настроить клавиши, которые следует игнорировать при наборе текста по брайлю.

source: A restore to defaults button has been added to the add-on settings panel.
ru: На панели настроек дополнения добавлена кнопка восстановления настройки по умолчанию.

source: Compatible with NVDA 2023.1.
ru: Совместимо с NVDA 2023.1.

source: Changes for 2022.1
ru: Изменения в 2022.1

source: Added ability to configure keys to send and clear dots when writing with one hand. Also, it's possible to set a timeout to send dots automatically, without pressing confirmation keys.
ru: Добавлена возможность настройки клавиш для отправки и удаления точек при письме одной рукой. Кроме того, можно установить время ожидания для автоматической отправки точек без нажатия клавиш подтверждения.

source: Changes for 2021.1
ru: Изменения в 2021.1

source: NVDA won't try to speak dots when One hand mode is not active or if space has been pressed.
ru: NVDA не будет пытаться произносить точки, если режим одной руки не активен или если был нажат пробел.

source: Compatible with NVDA 2021.1.
ru: Совместимо с NVDA 2021.1.

source: Changes for 2020.1
ru: Изменения в 2020.1

source: You can press space bar in combination with braille dots to emulate gestures, similar to commands available in braille displays.
ru: Вы можете нажимать клавишу пробела в сочетании с брайлевскими точками для имитации жестов, аналогичных командам, доступным на брайлевских дисплеях.

source: Added an option to speak single dots typed in one hand mode.
ru: Добавлена возможность произносить отдельные точки, набранные одной рукой.

source: Contributors
ru: Участники
