Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/pcKbBrl/*/pcKbBrl.po
Languages: fi, pt_pt, ru, tr, zh_tw

source: Toggles braille input from the PC keyboard.
fi: Ottaa käyttöön tai poistaa käytöstä pistekirjoituksen syötön PC:n näppäimistöltä.
pt_pt: Alterna a introdução de braille a partir do teclado do PC.
ru: Переключает ввод Брайля с клавиатуры ПК.
tr: PC klavyesinden braille girişini açıp kapatır.
zh_tw: 切換透過 PC 鍵盤進行點字輸入。

source: Braille input from PC keyboard disabled
fi: Pistekirjoituksen syöttö PC:n näppäimistöltä poistettu käytöstä
pt_pt: Entrada de Braille a partir do teclado do PC desactivada
ru: Ввод брайля с клавиатуры ПК выключен
tr: PC klavyesinden Braille girişi devre dışı
zh_tw: 已停用 PC 鍵盤的點字輸入

source: Braille input from PC keyboard enabled
fi: Pistekirjoituksen syöttö PC:n näppäimistöltä käytössä
pt_pt: Entrada de Braille a partir do teclado do PC activada
ru: Ввод брайля с клавиатуры ПК включён
tr: PC klavyesinden Braille girişi etkin
zh_tw: 已啟用 PC 鍵盤的點字輸入

source: Shows the {summary} settings.
fi: Näyttää {summary} -lisäosan asetukset.
pt_pt: Mostra as definições {summary}.
ru: Показывает настройки {summary}.
tr: {summary} Ayarlarını gösterir.
zh_tw: 顯示{summary}設定。

source: &Type using one hand
fi: &Kirjoita yhdellä kädellä
pt_pt: &Escrever usando uma mão
ru: &Ввод одной рукой
tr: &Tek elle yazma
zh_tw: 使用單手輸入(&T)

source: &Speak dot when typing with one hand
fi: &Puhu piste yhdellä kädellä kirjoitettaessa
pt_pt: &Dizer os pontos quando escrever com uma mão
ru: &Произносить точки при наборе одной рукой
tr: Tek elle yazarken noktaları &seslendir
zh_tw: 單手輸入時讀出點位(&S)

source: &Timeout to send dots when writing with one hand (in ms)
fi: Pisteiden lähettämisen &aikakatkaisu yhdellä kädellä kirjoitettaessa (ms)
pt_pt: &Tempo limite para enviar pontos quando se escreve com uma mão (em ms)
ru: &Время ожидания для отправки точек при наборе одной рукой (в мс)
tr: &Tek elle yazarken noktaları göndermek için zaman aşımı (ms olarak)
zh_tw: 單手輸入時傳送點字的逾時時間 (毫秒)(&T)

source: Characters to con&firm when writing with one hand:
fi: Va&hvistusmerkit yhdellä kädellä kirjoitettaessa:
pt_pt: Digite os caracteres a con&firmar ao escrever com uma mão:
ru: Символы под&тверждения при наборе одной рукой:
tr: Tek elle yazarken onaylanacak karakterler:
zh_tw: 單手輸入時用以確認的字元(&F)：

source: Characters to cance&l when writing with one hand:
fi: Pe&ruutusmerkit yhdellä kädellä kirjoitettaessa:
pt_pt: Digite os caracteres a cancelar&l ao escrever com uma mão:
ru: Символы отмен&ы при наборе одной рукой:
tr: Tek elle yazarken iptal edilecek karakterler:
zh_tw: 單手輸入時用以取消的字元(&F)：

source: Characters for &dot1 when writing with one hand:
fi: &Pisteen 1 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Digite os caracteres a cancelar&l ao escrever com uma mão:
ru: Символы для &точки 1 при наборе одной рукой:
tr: &Tek elle yazarken nokta1 için karakterler:
zh_tw: 單手輸入時代表第一點的字元(&D)：

source: Characters for dot2 when writing with one hand:
fi: Pisteen 2 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto2 quando se escreve com uma mão:
ru: Символы для точки 2 при наборе одной рукой:
tr: Tek elle yazarken nokta2 için karakterler:
zh_tw: 單手輸入時代表第二點的字元：

source: Characters for dot3 when writing with one hand:
fi: Pisteen 3 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto3 quando se escreve com uma mão:
ru: Символы для точки 3 при наборе одной рукой:
tr: Tek elle yazarken nokta3 için karakterler:
zh_tw: 單手輸入時代表第三點的字元：

source: Characters for dot4 when writing with one hand:
fi: Pisteen 4 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto4 quando se escreve com uma mão:
ru: Символы для точки 4 при наборе одной рукой:
tr: Tek elle yazarken nokta4 için karakterler:
zh_tw: 單手輸入時代表第四點的字元：

source: Characters for dot5 when writing with one hand:
fi: Pisteen 5 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto5 quando se escreve com uma mão:
ru: Символы для точки 5 при наборе одной рукой:
tr: Tek elle yazarken nokta5 için karakterler:
zh_tw: 單手輸入時代表第五點的字元：

source: Characters for dot6 when writing with one hand:
fi: Pisteen 6 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto6 quando se escreve com uma mão:
ru: Символы для точки 6 при наборе одной рукой:
tr: Tek elle yazarken nokta6 için karakterler:
zh_tw: 單手輸入時代表第六點的字元：

source: Characters for dot7 when writing with one hand:
fi: Pisteen 7 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto7 quando se escreve com uma mão:
ru: Символы для точки 7 при наборе одной рукой:
tr: Tek elle yazarken nokta7 için karakterler:
zh_tw: 單手輸入時代表第七點的字元：

source: Characters for dot8 when writing with one hand:
fi: Pisteen 8 merkit yhdellä kädellä kirjoitettaessa:
pt_pt: Caracteres para ponto8 quando se escreve com uma mão:
ru: Символы для точки 8 при наборе одной рукой:
tr: Tek elle yazarken nokta8 için karakterler:
zh_tw: 單手輸入時代表第八點的字元：

source: Characters to be &ignored when typing in braille:
fi: &Ohitettavat merkit pistekirjoituksella kirjoitettaessa:
pt_pt: Caracteres a &ignorar quando se escreve em braille:
ru: Символы, которые следует &пропускать при наборе брайля:
tr: Bra&ille ile yazarken yok sayılacak karakterler:
zh_tw: 點字輸入時要忽略的字元(&I)：

source: &Restore defaults
fi: &Palauta oletukset
pt_pt: &Restaurar predefinições
ru: &Восстановить значения по умолчанию
tr: Va&rsayılanları geri yükle
zh_tw: 還原預設值(&R)

source: None or all dots should be configured.
fi: Ei mitään tai kaikki pisteet pitää olla määritettyinä.
pt_pt: Nenhum ou todos os pontos devem ser configurados.
ru: Ни одна из точек или все точки должны быть настроены.
tr: Hiçbiri veya tüm noktalar yapılandırılmalıdır.
zh_tw: 應配置所有點位或不配置任何點位。

source: Error
fi: Virhe
pt_pt: Erro
ru: Ошибка
tr: Hata
zh_tw: 錯誤

source: Configured keys for pcKbBrl shouldn't be repeated.
fi: Tämän lisäosan määritettyjä näppäimiä ei voi käyttää.
pt_pt: As teclas configuradas para pcKbBrl não devem ser repetidas.
ru: Настроенные клавиши для pcKbBrl не должны повторяться.
tr: PcKbBrl için yapılandırılmış anahtarlar tekrarlanmamalıdır.
zh_tw: 為 pcKbBrl 設定的按鍵不應重複。

source: Set at least a confirm key if timeout for one hand mode is 0.
fi: Määritä vähintään vahvistusnäppäin, jos yksikätisen tilan aikakatkaisu on 0.
pt_pt: Definir pelo menos uma tecla de confirmação se o tempo limite para o modo de uma mão for 0.
ru: Установите хотя бы клавишу подтверждения, если время ожидания при наборе одной рукой равно 0.
tr: Tek el modu için zaman aşımı 0 ise en az bir onay tuşu ayarlayın.
zh_tw: 若單手模式的逾時時間為 0，則至少應設定一個確認鍵。

source: PC Keyboard Braille Input
fi: Pistekirjoituksen syöttö PC:n näppäimistöllä
pt_pt: Entrada em Braille a partir de teclado de PC
ru: Ввод брайля с клавиатуры ПК
tr: PC Klavyesinden Braille Girişi
zh_tw: PC 鍵盤點字輸入

source: Allows braille to be entered via the PC keyboard.
fi: Mahdollistaa pistekirjoituksen syötön PC:n näppäimistöltä.
pt_pt: Permite a introdução de braille através do teclado do PC.
ru: Позволяет вводить шрифт Брайля с помощью клавиатуры компьютера.
tr: PC klavyesi aracılığıyla braille girişine olanak tanır.
zh_tw: 允許透過 PC 鍵盤輸入點字。

source: Kannada cti
ru: Каннада CTI
zh_tw: 卡納達文 cti
