Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/numpadNavMode/*/numpadNavMode.xliff
Languages: ru, tr

source: Numpad Nav Mode
ru: Режим Навигации Цифровой Клавиатурой
tr: Numaratör Gezinme Modu

source: Author: Luke Davis (Open Source Systems, Ltd.)
ru: Автор: Luke Davis (Open Source Systems, Ltd.)
tr: Yazar: Luke Davis (Open Source Systems, Ltd.)

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı sürümü indir][1]

source: Numpad Nav Mode is an [NVDA][2] add-on, which allows you to easily switch your keyboard's numpad between NVDA's navigation controls and the non-screenreader Windows navigation controls. This can be especially useful for users migrating from Jaws to NVDA. This add-on also gives granular control over the numlock key toggle, both when NVDA starts, and optionally in profiles.
ru: Режим навигации цифровой клавиатурой - это дополнение для [NVDA][2], которое позволяет вам легко переключать цифровую клавиатуру между элементами управления навигацией NVDA и элементами управления навигацией Windows, не предназначенными для чтения с экрана. Это может быть особенно полезно для пользователей, переходящих с Jaws на NVDA. Оно также предоставляет детальный контроль над переключением клавиш numlock как при запуске NVDA, так и при необходимости в профилях.
tr: Sayısal Tuş Gezinme Modu, klavyenizin sayısal tuş takımını NVDA'nın gezinme kontrolleri ile ekran okuyucu olmayan Windows gezinme kontrolleri arasında kolayca değiştirmenize olanak tanıyan bir [NVDA][2] eklentisidir. Bu özellikle Jaws'tan NVDA'ya geçiş yapan kullanıcılar için yararlı olabilir. Bu eklenti aynı zamanda hem NVDA başladığında hem de isteğe bağlı olarak profillerde numlock tuşu geçişi üzerinde ayrıntılı kontrol sağlar.

source: Navigation modes explanation and features
ru: Объяснение режимов навигации и их особенности
tr: Gezinme modları açıklama ve özellikleri

source: The normal functions of the PC number pad, with numlock off, are: page up, page down, home, end, four-way arrow keys, and a delete key.
ru: Обычные функции цифровой клавиатуры ПК с отключенной блокировкой numlock: page up, page down, home, end, четырёхпозиционные клавиши стрелок и клавиша delete.
tr: Numara kilidi kapalıyken PC sayısal tuş takımının normal işlevleri şunlardır: sayfa yukarı, sayfa aşağı, ana sayfa, son, dört yönlü ok tuşları ve bir silme tuşu.

source: But NVDA completely takes over the numpad, to provide review keys, mouse controls, and object navigation controls. This is true even in laptop keyboard mode, which also duplicates those functions on non-numpad keys.
ru: Но NVDA полностью заменяет цифровую клавиатуру, предоставляя клавиши обзора, управления мышью и навигации по объектам. Это справедливо даже в режиме клавиатуры ноутбука, который также дублирует эти функции на клавишах, отличных от цифровой клавиатуры.
tr: Ancak NVDA, inceleme tuşları, fare kontrolleri ve nesne gezinme kontrolleri sağlamak için sayısal tuş takımını tamamen devralır. Bu, bu işlevleri sayısal tuş takımı olmayan tuşlarda da çoğaltan dizüstü bilgisayar klavye modunda bile geçerlidir.

source: However some users do have a numpad on their laptop, and would prefer to use it for Windows navigation purposes (at least some of the time), especially because some laptops do not provide home, end, or other such keys. That is where this add-on can help.
ru: Однако у некоторых пользователей на ноутбуках есть цифровой блок, и они предпочли бы использовать его для навигации по Windows (по крайней мере, некоторое время), особенно потому, что на некоторых ноутбуках нет клавиш home, end или других подобных клавиш. Вот где может помочь это дополнение.
tr: Bununla birlikte, bazı kullanıcıların dizüstü bilgisayarlarında bir sayısal tuş takımı vardır ve özellikle bazı dizüstü bilgisayarlarda ev, bitiş veya benzeri başka tuşlar bulunmadığından, bunu Windows gezinme amaçları için (en azından bazı zamanlar) kullanmayı tercih ederler. Bu eklentinin yardımcı olabileceği yer burasıdır. Ek olarak, bazı masaüstü kullanıcıları, örneğin JAWS'ta sayısal tuş takımının çalışmasına alışık olanlar, bazen bu eklentinin etkinleştirdiği normal NVDA tuşları yerine söz konusu klavye işlevleri için sayısal tuş takımını kullanmayı uygun bulabilir. Bu, bu eklentinin bazı eski kullanıcılarından özel bir özellik isteği olan, sonuna kadar okuma için popüler JAWS komutu NumpadInsert+Numpad2'yi içerir.

source: Additionally, some desktop users, for example those used to the way the numpad works in JAWS, may sometimes find it convenient to use the numpad for those keyboard functions rather than the normal NVDA keys, which this add-on enables.
ru: Кроме того, некоторым пользователям настольных компьютеров, например, тем, кто привык к работе с цифровой клавиатурой в JAWS, иногда может показаться удобным использовать цифровой блок для этих функций клавиатуры, а не обычные клавиши NVDA, которые позволяет это дополнение.
tr: Ek olarak, bazı masaüstü kullanıcıları, örneğin sayısal tuş takımının JAWS'ta çalışma şekline alışkın olanlar, bazen bu klavye işlevleri için bu eklentinin etkinleştirdiği normal NVDA tuşları yerine sayısal tuş takımını kullanmayı uygun bulabilirler.

source: This includes the popular JAWS command NumpadInsert+Numpad2, for read to end, which was a specific feature request from some early users of this add-on.
ru: Это включает в себя популярная команда JAWS NumpadInsert+Numpad2 для чтения до конца, которая была запросом некоторых первых пользователей этого дополнения.
tr: Buna, bu eklentinin bazı ilk kullanıcılarından gelen belirli bir özellik isteği olan, sonuna kadar okuma için popüler JAWS komutu NumpadInsert+Numpad2 de dahildir.

source: How it works
ru: Как это работает
tr: Nasıl çalışır

source: With numlock off, no matter what keyboard layout you are using, this add-on will let you press Alt+NVDA+NumpadPlus (which is usually the long key second up on the right), to quickly and easily switch between the normal NVDA navigation controls, and the classic Windows navigation controls. This key can be remapped under Input Gestures, in the Input section.
ru: При выключенном numlock, независимо от используемой раскладки клавиатуры, это дополнение позволит вам нажимать Alt + NVDA + NumpadPlus (обычно это длинная клавиша, вторая справа вверху), чтобы быстро и легко переключаться между обычными навигационными элементами NVDA и классическими навигационными элементами Windows. Эту клавишу можно переназначить в разделе Жестов ввода в категории Ввод.
tr: Numara kilidi kapalıyken, hangi klavye düzenini kullandığınızdan bağımsız olarak, bu eklenti, NVDA tuşları ve windows standart navigasyon tuşları arasında Alt+NVDA+NumpadPlus'a (genellikle sağda ikinci uzun tuştur) basarak hızlı ve kolay bir şekilde geçiş yapmanıza olanak tanır. Bu hareket, tercihler menüsünden Girdi Hareketleri iletişim kutusunda yeniden atanabilir.

source: Note that this add-on doesn't disable the use of numpad insert as an NVDA modifier, if you have it set as such. If you want that feature, please let me know, although you can manually turn off numpad insert as a modifier in NVDA keyboard settings. It also doesn't change the NVDA function of numpad delete (key between zero and enter)--contact me if you desire this.
ru: Обратите внимание, что это дополнение не отключает использование numpad insert в качестве модификатора NVDA, если оно у вас установлено как таковое. Если вам нужна эта функция, пожалуйста, дайте мне знать, хотя вы можете вручную отключить функцию numpad insert в качестве модификатора в настройках клавиатуры NVDA. Это также не изменяет функцию NVDA numpad delete (клавиша между нулем и enter) - свяжитесь со мной, если вам это нужно.
tr: Eklenti numaratör insert tuşunun işlevine müdahale etmez. BU tuşu da NVDA tuşu olarak belirlediyseniz, windows standart navigasyonu modunda da aynı işlev için kullanmaya devam edebilirsiniz. Bu özelliği istiyorsanız, lütfen bana bildirin, ancak numaratör insert tuşunu NVDA tuşu olarak kullanmak istemiyorsanız halihazırda bunu NVDA ayarları klavye kategorisi altından yapabilirsiniz.

source: If you would prefer to have NVDA start with the Windows nav mode active by default, you can configure that in NVDA configuration. Go to NVDA's preferences, then settings, and find the Numpad Nav Mode settings panel. There you will be able to select a checkbox to turn Windows Nav Mode on by default when you start NVDA.
ru: Если вы предпочитаете, чтобы NVDA запускалась с включенным по умолчанию навигационным режимом Windows, вы можете настроить это в настройках NVDA. Перейдите в параметры NVDA, затем в настройки и найдите панель настроек режима навигации цифровой клавиатурой. Там вы сможете установить флажок, чтобы включить режим навигации Windows по умолчанию при запуске NVDA.
tr: NVDA'nın varsayılan olarak Windows gezinme modu etkin başlamasını tercih ederseniz, bunu NVDA ayarlarında yapılandırabilirsiniz. NVDA'nın tercihler menüsü, ayarlar iletişim kutusunda Sayısal Tuş Takımı Modu (numaratör gezinme modu) kategorisini bulun ve NVDA'yı başlattığınızda Windows gezinme Modunu varsayılan olarak etkinleştir onay kutusunu işaretleyin.

source: To get there quickly, press NVDA+N, P, S, then N one or more times until you hear "Numpad Nav Mode".
ru: Чтобы быстро перейти к этому, нажмите NVDA+N, П, Н, затем Р один или несколько раз, пока не услышите "Режим навигации цифровой клавиатурой".
tr: Oraya hızlı bir şekilde ulaşmak için, "Sayısal Tuş Takımı Gezinme Modu" sözlerini duyana kadar NVDA+N, T, l ve ardından S tuşlarına bir veya daha fazla kez basın.

source: Numlock features
ru: Особенности Numlock
tr: Numara kilidi özellikleri

source: By default, nothing is done with the numlock key.
ru: По умолчанию с помощью клавиши numlock ничего не делается.
tr: Varsayılan olarak, numara kilidi tuşuyla hiçbir şey yapılmaz.

source: However, if you share your computer with a sighted user who prefers that numlock always be turned on, but you like having it off so that the numpad works with NVDA, you may want the numlock to automatically turned off when NVDA starts.
ru: Однако, если вы используете компьютер совместно со зрячим пользователем, который предпочитает, чтобы numlock всегда был включен, но вам нравится, когда он выключен, чтобы цифровая панель работала с NVDA, вы можете захотеть, чтобы numlock автоматически отключался при запуске NVDA.
tr: Ancak, bilgisayarınızı Numara kilidinin her zaman açık olmasını tercih eden gören bir kullanıcıyla paylaşıyorsanız, fakat Sayısal Tuş takımının NVDA ile çalışması için onu kapatmaktan hoşlanıyorsanız, NVDA başladığında Numara kilidinin otomatik olarak kapatılmasını isteyebilirsiniz. Alternatif olarak, çok fazla veri girebilir ve bu nedenle NVDA'yı başlattığınızda Numara kilidinin her zaman açık olmasını tercih edebilirsiniz.

source: Alternatively, you may enter a lot of data, and so prefer the numlock to always be on when you start NVDA.
ru: В качестве альтернативы, вы можете вводить много данных и поэтому предпочитаете, чтобы numlock всегда был включён при запуске NVDA.
tr: Alternatif olarak, çok fazla veri girebilir ve bu nedenle NVDA'yı başlattığınızda numara kilidinin her zaman açık olmasını tercih edebilirsiniz.

source: Go to NVDA menu, Preferences, Settings, Numpad Nav Mode, and use the "state of numlock when NVDA starts or profile loads" selector. This has three options. The first, "do not change", is the default, and won't touch the numlock. It will be in whatever state it was in before NVDA started.
ru: Перейдите в меню NVDA, Параметры, Настройки, режим навигации цифровой клавиатуры и выберите "состояние numlock при запуске NVDA или загрузке профиля". Здесь есть три варианта. Первый, "не изменять", используется по умолчанию и не затрагивает numlock. Он будет находиться в том же состоянии, в каком был до запуска NVDA.
tr: NVDA menüsü, Tercihler, Ayarlar, Sayısal Tuş Takımı Moduna gidin ve "NVDA başladığında veya profil yüklendiğinde numara kilidiğ durumu" seçicisini kullanın. Bunun üç seçeneği vardır. İlki, "değiştirme", varsayılandır ve numara kilidine dokunmaz. NVDA başlamadan önce hangi durumdaysa o durumda kalacaktır. İkinci seçenek, NVDA başladığında Numara kilidini her zaman kapatacak olan "Numara kilidini kapat" seçeneğidir. Üçüncü seçenek olan "Numara Kilidini Aç" NVDA başladığında numara kilidi kapalıysa açacaktır. İkinci veya üçüncü seçeneklerden birini seçerseniz, NVDA'dan çıktığınızda numara kilidi daha önce hangi durumdaysa o duruma geri getirilecektir. Örneğin, "Numara kilidini kapat" seçeneğini seçip ve NVDA'yı başlattığınızda numara kilidi açıksa: NVDA'yı kullanırken kapatılacak, ancak NVDA'dan çıktığınızda tekrar açılacaktır.

source: The second option, is "turn numlock off", which will always turn the numlock off when NVDA starts. The third option, "Turn numlock on", will turn the numlock on if it was off when NVDA started.
ru: Второй вариант - "выключить numlock", который всегда отключает numlock при запуске NVDA. Третий вариант, "Включить numlock", включает numlock, если он был выключен при запуске NVDA.
tr: İkinci seçenek, NVDA başladığında numara kilidini her zaman kapatacak olan "numara kilidini kapat"tır. Üçüncü seçenek olan "Numara kilidini aç", NVDA başlatıldığında kapalıysa numara kilidini açacaktır.

source: If you choose either the second or third option, the numlock will be restored to whatever state it was in before, when you exit NVDA. For example, if you choose "Turn numlock off", and numlock was on when you started NVDA: it will be turned off while you use NVDA, but will be turned back on when you exit NVDA.
ru: Если вы выберете второй или третий вариант, numlock будет восстановлен до того состояния, в котором он был раньше, когда вы выйдете из NVDA. Например, если вы выберете "Выключить numlock", а numlock был включен, когда вы запускали NVDA: он будет выключен, пока вы используете NVDA, но снова включится при выходе из NVDA.
tr: İkinci veya üçüncü seçeneği seçerseniz, NVDA'dan çıktığınızda numara kilidi daha önce bulunduğu duruma geri yüklenecektir. Örneğin, "Numara kilidini kapat" seçeneğini seçerseniz ve NVDA'yı başlattığınızda numara kilidi açıksa: NVDA'yı kullanırken kapanacak, ancak NVDA'dan çıktığınızda tekrar açılacaktır.

source: Advanced use cases
ru: Расширенные варианты использования
tr: Gelişmiş kullanım durumları

source: If you use NVDA's powerful configuration profiles, and you would like the numlock to automatically turn on when you enter certain profiles, do the following:
ru: Если вы используете мощные профили конфигурации NVDA и хотите, чтобы функция numlock автоматически включалась при вводе определенных профилей, выполните следующие действия:
tr: NVDA'nın güçlü yapılandırma profillerini kullanıyorsanız ve belirli profillere girdiğinizde numara kilidinin otomatik olarak açılmasını istiyorsanız, aşağıdakileri yapın:

source: While in the "normal profile", go to the Numpad Nav Mode settings panel described above. Check the box for "Initial numlock state is configuration profile dependent". This option is unchecked by default.
ru: Находясь в "обычном профиле", перейдите на панель настроек режима навигации цифровой клавиатурой, описанную выше. Установите флажок "Начальное состояние numlock зависит от профиля конфигурации". По умолчанию этот параметр не установлен.
tr: "Normal profil"deyken, yukarıda açıklanan Sayısal tuş takımı Gezinme Modu ayarları paneline gidin. "İlk numlock durumu yapılandırma profiline bağlıdır" kutusunu işaretleyin. Bu seçenek varsayılan olarak işaretli değildir.

source: Select OK.
ru: Нажмите ОК.
tr: Tamam'ı seçin.

source: Change to the profile where you want numlock to be always turned off or on.
ru: Перейдите в профиль, в котором вы хотите, чтобы numlock всегда был выключен или включен.
tr: Numara kilidinin her zaman kapalı veya açık olmasını istediğiniz profile geçin.

source: Go back to the Numpad Nav Mode settings panel, and select the option to Turn numlock off or on, as you prefer.
ru: Вернитесь на панель настроек режима навигации цифровой клавиатурой и выберите опцию включения или выключения numlock, как вам больше нравится.
tr: Sayısal Tuş Takımı Gezinme Modu ayarları paneline geri dönün ve tercihinize göre numara kilidini kapatma veya açma seçeneğini seçin.

source: Then select OK. Now, whenever you enter this profile, the numlock will automatically change to the desired state.
ru: Затем нажмите "ОК". Теперь всякий раз, когда вы входите в этот профиль, numlock автоматически переходит в желаемое состояние.
tr: Ardından Tamam'ı seçin. Şimdi, bu profile her girdiğinizde, numara kilidi otomatik olarak istenen duruma geçecektir.

source: Note that this is a new feature, and I don't know if anyone has use for this feature. If you find one, please send an email or open [an issue][3], to let me know how you have found to make use of it.
ru: Обратите внимание, что это новая функция, и я не знаю, пользуется ли кто-нибудь ею. Если вы её найдёте полезной, пожалуйста, отправьте электронное письмо или откройте [проблему][3], чтобы сообщить мне, как вы нашли способ её использования.
tr: Bu yeni bir özellik ve bu özelliği kullanan var mı bilmiyorum. Eğer bir tane bulursanız, lütfen bir e-posta gönderin veya [bir sorun][3] dosyasını açarak onu nasıl kullanabileceğinizi bulduğunuzu bana bildirin.

source: Or, better yet, leave a [review][4] for the add-on, and comment on it there!
ru: Или, что ещё лучше, оставьте [отзыв][4] о дополнении и прокомментируйте его!
tr: Veya daha da iyisi, eklenti için bir [inceleme][4] bırakın ve orada yorum yapın! Bu özelliği kullansanız da kullanmasanız da incelemeler çok faydalıdır!

source: Reviews are very helpful, whether or not you use that feature.
ru: Отзывы очень полезны, независимо от того, используете вы эту функцию или нет.
tr: Bu özelliği kullansanız da kullanmasanız da incelemeler çok yararlıdır.

source: New features
ru: Новые возможности
tr: Yeni özellikler

source: I encourage you to post an [issue][3], or email with any feature suggestions, or other use cases that I haven't listed here, or just to let me know you find the add-on useful!
ru: Я рекомендую вам опубликовать сообщение о [проблеме][3] или отправить электронное письмо с любыми предложениями по функциям или другими вариантами использования, которые я здесь не перечислил, или просто сообщить мне, что вы считаете это дополнение полезным!
tr: Bir [sorun][3] yayınlamanızı, herhangi bir özellik önerisini veya burada listelemediğim diğer kullanım örneklerini e-postayla göndermenizi ya da eklentiyi yararlı bulduğunuzu bana bildirmenizi öneririm! Ancak yukarıda da belirtildiği gibi, eğer faydalı bulursanız lütfen bir [inceleme][4] bırakın!

source: But as mentioned above, if you do find it useful, please leave a [review][4].
ru: Но, как упоминалось выше, если вы сочтёте это полезным, пожалуйста, оставьте [отзыв][4].
tr: Ancak yukarıda belirtildiği gibi, yararlı bulursanız, lütfen bir [inceleme][4] bırakın.

source: History
ru: История
tr: Geçmiş

source: This add-on was the direct result of requests I've heard from users over the years, and a GitHub discussion in [#9549](https://github.com/nvaccess/nvda/issues/9549). With thanks to @Qchristensen and @feerrenrut.
ru: Это дополнение было прямым результатом запросов, которые я получал от пользователей на протяжении многих лет, и обсуждения на GitHub в [#9549](https://github.com/nvaccess/nvda/issues/9549). Спасибо @Qchristensen и @feerrenrut.
tr: Bu eklenti, yıllar boyunca kullanıcılardan duyduğum isteklerin ve [#9549](https://github.com/nvaccess/nvda/issues/9549) adresindeki GitHub tartışmasının doğrudan sonucuydu. @Qchristensen ve @feerrenrut'a teşekkürler. Numara kilidi özelliklerinin temel uygulaması, Noelia Ruiz (@GitHub'da nvdaes) ve diğerleri tarafından eski NumLock Manager eklentisinden ödünç alınmıştır. İzin alınarak kullanılmıştır.

source: The basic implementation of the numlock features was borrowed from the legacy NumLock Manager add-on, by Noelia Ruiz (@nvdaes on GitHub), and others. Used with permission.
ru: Базовая реализация функций numlock была заимствована из устаревшего дополнения NumLock Manager Noelia Ruiz (@nvdaes на GitHub) и другими разработчиками. Используется с разрешения.
tr: Numara kilidi özelliklerinin temel uygulaması, Noelia Ruiz (@nvdaes on GitHub) ve diğerleri tarafından geliştirilen eski NumLock Manager eklentisinden alınmıştır. İzin alınarak kullanılmıştır.

source: Changelog
ru: Журнал изменений
tr: Değişiklik günlüğü

source: (This changelog is incomplete. See Git log for full details.)
ru: (Этот список изменений неполон. Более подробную информацию смотрите в журнале Git.)
tr: (Bu değişiklik günlüğü eksik. Tüm ayrıntılar için Git günlüğüne bakın.)

source: 24.1.0: NVDA 2024.X compatibility.
ru: 24.1.0: совместимость с NVDA 2024.X.
tr: 24.1.0: NVDA 2024.X uyumluluğu.

source: 23.1.0: Added numlock management features. Better logging. Improved config profile handling (WIP).
ru: 23.1.0: Добавлены функции управления numlock. Улучшено ведение журнала. Улучшена обработка конфигурационных профилей (WIP).
tr: 23.1.0: Numara kilidi yönetim özellikleri eklendi. Daha iyi günlük kaydı. Geliştirilmiş yapılandırma profili işleme (WIP).

source: 23.0: NVDA 2023.X compatibility.
ru: 23.0: совместимость с NVDA 2023.X.
tr: 23.0: NVDA 2023.X uyumluluğu.
