Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/objWatcher/*/objWatcher.xliff
Languages: ru, tr

source: objWatcher
ru: наблюдатель объектов
tr: nesne İzleyici

source: **This NVDA add-on watches changes to attributes of navigation objects.**
ru: **Это дополнение NVDA отслеживает изменения атрибутов навигационных объектов.**
tr: **Bu NVDA eklentisi, gezinme nesnelerinin özniteliklerindeki değişiklikleri izler.**

source: Authors: Cary-rowen (<manchen_0528@outlook.com>), hwf1324 (<1398969445@qq.com>)
ru: Авторы: Cary-rowen (<manchen_0528@outlook.com>), hwf1324 (<1398969445@qq.com>)
tr: Yazarlar: Cary-rowen (<manchen_0528@outlook.com>), hwf1324 (<1398969445@qq.com>)

source: Compatibility: NVDA 2023.1 or later
ru: Совместимость: NVDA-2023.1 или выше
tr: Uyumluluk: NVDA 2023.1 veya sonrası

source: Possible Use Cases
ru: Возможные варианты использования
tr: Olası Kullanım Örnekleri

source: **Subtitles and Lyrics Watching:**
ru: **Отслеживание субтитров и текстов песен:**
tr: **Altyazı ve Şarkı Sözleri İzleme:**

source: Watch subtitle or lyric objects of certain players, enabling automatic reporting when they refresh.
ru: Смотрите субтитры или текстовые фрагменты некоторых проигрывателей и включайте автоматические отчеты при обновлении.
tr: Belirli oynatıcıların altyazılarını veya şarkı sözlerini izleyebilir ve yenilendiğinde otomatik raporlamayı etkinleştirebilir.

source: **Chat Activity Watching:**
ru: **Отслеживание активности чата:**
tr: **Sohbet Etkinliği İzleme:**

source: Watch items of interest within group chat lists in messaging apps such as Unigram or WeChat. Automatically report new messages, even when working in the background.
ru: Просматривайте интересующие вас темы в списке групповых чатов в Unigram или WeChat. Можно автоматически сообщать о новых сообщениях, даже при работе в фоновом режиме.
tr: Unigram veya WeChat konuşma listesindeki grup sohbeti listesinde ilgi çekici öğeleri izle. Yeni mesajlar otomatik olarak raporlanabilir ve arka plan raporlaması desteklenir.

source: **Testing and Debugging:**
ru: **Тестирование и отладка:**
tr: **Test ve hata ayıklama:**

source: Watch the status bar of applications like Notepad to automatically report changes in rows and columns during editing.
ru: Наблюдайте за строкой состояния приложений, таких как Блокнот, чтобы автоматически сообщать об изменениях в строках и столбцах во время редактирования.
tr: Düzenleme sırasında satır ve sütunlardaki değişiklikleri otomatik olarak bildirmek için not defteri gibi uygulamaların durum çubuğunu izler.

source: Gestures
ru: Жесты
tr: Kısayollar

source: Watcher Layer Commands
ru: Команды уровня наблюдателя
tr: İzleyici Katmanı Komutları

source: Press `NVDA+Alt+W` to activate the watcher layer, where you can perform watching actions:
ru: Нажмите `NVDA+Alt+W` для активации уровня наблюдателя, Где вы можете выполнять действия по наблюдению:
tr: `NVDA+Alt+W` tuşlarına basarak izleme katmanını etkinleştirin. Burada izleme eylemlerini gerçekleştirebilirsiniz:

source: - **Numeric Keys (0–9):** Add the current navigator object to a specific position or report the status of an object already being watched at that position.
ru: - **Цифры (0–9):** Добавить текущий объект Navigator в определенную позицию или сообщить о состоянии объекта, уже наблюдаемого на этой позиции.
tr: - **Sayısal tuşlar (0-9):** Geçerli gezgin nesnesini belirli bir konuma ekler veya o konumda zaten izlenmekte olan bir nesnenin durumunu bildirir.

source: - **Delete:** Press once to remove the last watched object; press twice to remove all watched objects.
ru: - **Delete:** Однократное нажатие, чтобы удалить последний наблюдаемый объект; Двойное нажатие - удалить все наблюдаемые объекты.
tr: - **Sil:** Son izlenen nesneyi kaldırmak için bir kez basın; İzlenen tüm nesneleri kaldırmak için iki kez basın.

source: - **T:** Toggle the watch status of the current foreground window.
ru: - **T:** Переключить состояние наблюдения текущего окна переднего плана.
tr: - **T:** Geçerli ön plan penceresinin izleme durumunu değiştirir.

source: - **P:** Pause or resume all watching activities.
ru: - **P:** Приостановить или возобновить все активные наблюдения.
tr: - **P:** Tüm izleme etkinliklerini duraklatır veya devam ettirir.

source: - **Escape:** Exit the watcher layer.
ru: - **Escape:** Выйти из уровня наблюдения.
tr: - **Escape:** İzleyici katmanından çıkar.

source: When entering the watcher layer, the add-on announces the current status:
ru: При входе в уровень наблюдателя дополнение объявляет текущее состояние:
tr: İzleyici katmanına girerken eklenti mevcut durumu duyurur:

source: - *"No items are being watched. Please add items to watch."*
ru: - *"Ни один объект не наблюдается. Добавьте элементы для наблюдения."*
tr: - *"Hiçbir öğe izlenmiyor. Lütfen izlenecek öğeler ekleyin."*

source: - *"Watching in progress. {n} items are being tracked."*
ru: - *"Идёт наблюдение. Отслеживается {n} элементов."*
tr: - *"İzleme devam ediyor. {n} öğe izleniyor."*

source: - *"Watching paused. {n} items in the watch list."*
ru: - *"Наблюдение приостановлено. {n} элементов в списке наблюдения."*
tr: - *"İzleme duraklatıldı. {n} öğe izleme listesinde."*

source: Other Gestures
ru: Другие Жесты
tr: Diğer Kısayollar

source: The following actions are supported but have no default gestures assigned. Users can assign gestures to these actions via the Input Gestures dialog:
ru: Следующие действия поддерживаются, но им не присвоены жесты по умолчанию. Пользователи могут назначать жесты этим действиям с помощью диалога жестов ввода:
tr: Aşağıdaki eylemler desteklenir ancak atanmış varsayılan hareketler yoktur. Kullanıcılar, Girdi Hareketleri iletişim kutusu aracılığıyla bu eylemlere hareketler atayabilir:

source: - **Add current navigator object to watchlist.**
ru: - **Добавить текущий объект навигатора в список наблюдения.**
tr: - **Geçerli gezgin nesnesini izleme listesine ekler.**

source: - **Note:** This action can only be assigned to gestures where the main key is a numeric key (0–9) with a modifier, such as `NVDA+Alt+0–9`.
ru: - **Примечание:** Это действие может быть назначено только на жесты, где основная клавиша является цифрой (0–9) с модификатором, таким как `NVDA+Alt+0–9`.
tr: - **Not:** Bu eylem yalnızca ana tuşun bir değiştirici ile birlikte sayısal bir tuş (0–9) olduğu hareketlere atanabilir, örneğin `NVDA+Alt+0–9`.

source: - **Toggle the watch status of the current window.**
ru: - **Переключить состояние наблюдения текущего окна.**
tr: - **Geçerli pencerenin izleme durumunu değiştirir.**

source: - **Toggle pause/resume watching.**
ru: - **Переключить приостановку/возобновление наблюдения.**
tr: - **İzlemeyi duraklat/devam ettir arasında geçiş yapar.**

source: - **Press once to delete the last watched object; press twice to delete all watched objects.**
ru: - **Однократное нажатие, чтобы удалить последний наблюдаемый объект; Двойное нажатие - для удаления всех наблюдаемых объектов.**
tr: - **Son izlenen nesneyi silmek için bir kez basın; İzlenen tüm nesneleri silmek için iki kez basın.**

source: Settings
ru: Настройки
tr: Ayarlar

source: Access the settings panel from NVDA’s Preferences menu to configure the following options:
ru: Панель настроек доступна из меню настроек NVDA для настройки следующих параметров:
tr: Aşağıdaki seçenekleri yapılandırmak için NVDA’nın Tercihler menüsünden Ayarlar Paneline erişin:

source: - **Watcher Timer Interval:** Set the watching interval in milliseconds (default is 100ms)
ru: - **Интервал времени наблюдения:** Выбрать интервал наблюдения в милисекундах (по умолчанию 100мс)
tr: - **İzleyici Zamanlayıcı Aralığı:** İzleme aralığını milisaniye cinsinden ayarlayın (varsayılan 100 ms'dir)

source: Contributors
ru: Участники
tr: Katkıda bulunanlar

source: - **Authors:**
ru: - **Авторы:**
tr: - **Yazarlar:**

source: - Cary-rowen: Core developer
ru: - Cary-rowen: Основной разработчик
tr: - Cary-rowen: Çekirdek geliştirici

source: - hwf1324: Code contributor
ru: - hwf1324: Сотрудник кода
tr: - hwf1324: Kod katkısı sağlayan

source: - Ibrahim Hamadeh: Code contributor
ru: - Ibrahim Hamadeh: Сотрудник кода
tr: - Ibrahim Hamadeh: Kod katkısı sağlayan

source: - **Localization Contributors:**
ru: - **Участники Локализации:**
tr: - **Yerelleştirmeye Katkıda Bulunanlar:**

source: - Ibrahim Hamadeh: Arabic Translation
ru: - Ibrahim Hamadeh: Арабский перевод
tr: - Ibrahim Hamadeh: Arapça çeviriler

source: - VovaMobile: Ukrainian Translation
ru: - VovaMobile: Украинский перевод
tr: - VovaMobile: Ukrayna çeviriler

source: **Feel free to let me know the names of other localization contributors in any way you like.**
ru: **Не стесняйтесь сообщить мне имена других участников локализации любым способом, который вам нравится.**
tr: **Yerelleştirmeye katkıda bulunan diğer kişilerin adlarını istediğiniz şekilde bana bildirmekten çekinmeyin.**

source: Contribution
ru: Вклад
tr: Katkı

source: Submit Pull Requests (PRs) for new features or localized translations via [GitHub][GitHub].
ru: Отправьте запросы на привлечение (PRS) для новых функций или локализованных переводов через [GitHub] [GitHub].
tr: [GitHub][GitHub] aracılığıyla yeni özellikler veya yerel çeviriler için çekme isteklerini (PRS) gönderin.

source: Report bugs or provide feedback through the [GitHub Issues page][GitHubIssue].
ru: Сообщите об ошибках или предоставьте обратную связь через страницу [GitHub Issue][GitHubIssue].
tr: [GitHub Sorunları sayfası][GitHubIssue] aracılığıyla hataları bildirin veya geri bildirim sağlayın.

source: Release Notes
ru: Примечания к выпуску
tr: Sürüm Notları

source: Version 1.0.2
ru: Версия 1.0.2
tr: Sürüm 1.0.2

source: - Fixed document Markdown rendering issue.
ru: - Исправлена проблема маркировки документа.
tr: - Belge Markdown işleme sorunu düzeltildi.

source: Version 1.0.1
ru: Версия 1.0.1
tr: Sürüm 1.0.1

source: - Fixed duplicate objects being added
ru: - исправлено дублирование добавляемых объектов
tr: - Eklenen nesnelerin yinelenmesi sorunu düzeltildi

source: - Other improvements
ru: - Другие улучшения
tr: - Diğer iyileştirmeler

source: Version 1.0.0
ru: Версия 1.0.0
tr: Sürüm 1.0.0

source: - Added watcher layer commands (`NVDA+Alt+W`).
ru: - Добавлены команды уровня наблюдателя (`NVDA+Alt+W`).
tr: - İzleyici katmanı komutları eklendi ( ). NVDA+Alt+W.

source: - Introduced watching feature for multiple objects.
ru: - Введена функция наблюдения для нескольких объектов.
tr: - Birden fazla nesne için izleme özelliği eklendi.

source: - Introduced quick watching of the foreground window.
ru: - Введено быстрое наблюдение окна переднего плана.
tr: - Ön plandaki pencerenin hızlı izlenmesi eklendi.

source: - Support pause/resume watching.
ru: - Поддержка приостановки/возобновления наблюдения.
tr: - İzlemeyi duraklatma/devam ettirme desteği.

source: Version 0.4.5
ru: Версия 0.4.5
tr: Sürüm 0.4.5

source: - Localization updates.
ru: - Обновления локализации.
tr: - Yerelleştirme güncellemeleri.

source: Version 0.4.4
ru: Версия 0.4.4
tr: Sürüm 0.4.4

source: - Supported "speak on demand" mode for NVDA 2024.1.
ru: - Поддерживается режим речи "по требованию" в NVDA2024.1.
tr: - NVDA2024.1'de isteğe bağlı konuşma modu desteklenmektedir.

source: - Localization updates.
ru: - Обновления локализации.
tr: - Yerelleştirme güncellemeleri.

source: Version 0.4.0
ru: Версия 0.4.0
tr: Sürüm 0.4.0

source: - Introduced a configurable timer interval for watching objects.
ru: - Предоставлен настраиваемый интервал таймера для наблюдения за объектами.
tr: - Nesneleri izlemek için yapılandırılabilir bir zamanlayıcı aralığı eklendi.

source: [GitHubIssue]: https://github.com/cary-rowen/objWatcher/issues
tr: [Github sorun]: https://github.com/cary-rowen/objWatcher/issues
