Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/objWatcher/*/objWatcher.po
Languages: fi, ru, tr

source: objWatcher
fi: Objektien tarkkailija
ru: наблюдатель объектов
tr: nesne izleyici

source: Enter watcher layer commands
fi: Syötä tarkkailijan komentokerroskomentoja
ru: Вход в команды уровня наблюдателя
tr: İzleyici katman komutlarını girin

source: No items are being watched. Please add items to watch.
fi: Kohteita ei tarkkailla. Lisää tarkkailtavia kohteita.
ru: Ни один объект не наблюдается. Добавьте элементы для наблюдения.
tr: Hiçbir öğe izlenmiyor. Lütfen izlenecek öğeleri ekleyin.

source: Watching in progress. {} items are being tracked.
fi: Tarkkailu käynnissä. {} kohdetta seurataan.
ru: Идёт наблюдение. Отслеживается {} элементов.
tr: İzleme sürüyor. {} öğe izleniyor.

source: Watching paused. {} items in the watch list.
fi: Tarkkailu keskeytetty. Tarkkailulistalla {} kohdetta.
ru: Наблюдение приостановлено. {} элементов в списке наблюдения.
tr: İzleme duraklatıldı. İzleme listesindeki {} öğe.

source: Exited watcher layer
fi: Poistuttu tarkkailun komentokerroksesta
ru: Выход из уровня наблюдателя
tr: İzleyici katmanından çıkıldı

source: Add current navigator object to watchlist
fi: Lisää nykyinen navigointiobjekti tarkkailulistalle
ru: Добавить текущий объект навигатора в список наблюдения
tr: Geçerli dolaşım nesnesini izleme listesine ekle

source: Invalid key: '{}'. Please use a numeric key like NVDA+Alt+0~9.
fi: Virheellinen näppäin: '{}'. Käytä numeronäppäintä kuten NVDA+Alt+0–9.
ru: Неправильная клавиша: '{}'. Используйте цифровую клавишу, например NVDA+Alt+0~9.
tr: Geçersiz tuş: '{}'. Lütfen NVDA+Alt+0~9 gibi bir sayısal tuş kullanın.

source: Position {}: {}
fi: Sijainti {}: {}
ru: Положение {}: {}
tr: Konum {}: {}

source: No navigation object available to add
fi: Ei lisättävää navigointiobjektia
ru: Нет доступных объектов навигатора для добавления
tr: Eklenecek dolaşım nesnesi yok

source: This object is already being watched at position {}
fi: Tätä objektia tarkkaillaan jo sijainnissa {}
ru: Этот объект уже наблюдается в положении {}
tr: Bu nesne zaten {} konumunda izleniyor

source: Unnamed object
fi: Nimetön objekti
ru: Безымянный объект
tr: Adsız nesne

source: Added object to position {}: {}, Watching has not started.
fi: Lisätty objekti sijaintiin {}: {}. Tarkkailua ei aloitettu.
ru: Добавлен объект в положение {}: {}, Наблюдение не началось.
tr: {}: {} konumuna nesne eklendi, İzleme başlamadı.

source: Press once to delete the last watched object; press twice to delete all watched objects
fi: Poista viimeksi tarkkailtu objekti painamalla kerran tai kaikki tarkkaillut painamalla kahdesti
ru: Нажмите один раз, чтобы удалить последний наблюдаемый объект; нажмите дважды, чтобы удалить все наблюдаемые объекты
tr: Son izlenen nesneyi silmek için bir kez basın; izlenen tüm nesneleri silmek için iki kez basın

source: No objects are being watched
fi: Objekteja ei tarkkailla
ru: Ни один объект не наблюдается
tr: Hiçbir nesne izlenmiyor

source: Removed all {} watched objects
fi: Kaikki tarkkaillut objektit poistettu
ru: Удалены все {} наблюдаемые объекты
tr: İzlenen tüm {} nesneleri kaldırıldı

source: No object has been checked
fi: Objektia ei tarkistettu
ru: Ни один объект не отмечен
tr: Hiçbir nesne işaretlenmemiş

source: Removed {} from position {}
fi: Poistettu {} sijainnista {}
ru: Удалён {} из положения {}
tr: {}, {} konumundan kaldırıldı

source: The last checked object is no longer being watched
fi: Viimeksi tarkistettua objektia ei enää tarkkailla
ru: Последний отмеченный объект больше не наблюдается
tr: Son işaretli nesne artık izlenmiyor

source: {} is no longer available and has been removed from watch list
fi: {} ei enää ole käytettävissä ja se poistettiin tarkkailulistalta
ru: {} больше недоступен и удалён из списка наблюдения
tr: {} artık mevcut değil ve izleme listesinden kaldırıldı

source: {} caused an error and has been removed from watch list
fi: {} aiheutti virheen ja se poistettiin tarkkailulistalta
ru: {} вызвало ошибку и было удалено из списка наблюдения
tr: {} bir hataya neden oldu ve izleme listesinden kaldırıldı

source: Error reading attributes
fi: Virhe luettaessa määreitä
ru: Ошибка чтения атрибутов
tr: Öznitelikler okunurken hata oluştu

source: Toggle the watch status of the current window
fi: Vaihda nykyisen ikkunan tarkkailutilaa
ru: Переключить состояние наблюдения текущего окна
tr: Geçerli pencerenin izleme durumunu değiştirir

source: No foreground window available
fi: Etualan ikkunaa ei käytettävissä
ru: Недоступно окно переднего плана
tr: Ön plan penceresi yok

source: Removed window {} from watch list
fi: Ikkuna {} poistettu tarkkailulistalta
ru: Окно {} удалено из списка наблюдения
tr: {} penceresi izleme listesinden kaldırıldı

source: Unnamed window
fi: Nimetön ikkuna
ru: Безымянное окно
tr: Adsız pencere

source: Added window {} to watch list
fi: Ikkuna {} lisätty tarkkailulistalle
ru: Окно {} добавлено в список наблюдения
tr: İzleme listesine {} penceresi eklendi

source: Toggle pause/resume watching
fi: Keskeytä/jatka tarkkailua
ru: Переключить паузу/возобновление наблюдения
tr: İzlemeyi duraklatma/devam ettirme arasında geçiş yapar

source: Watching resumed
fi: Tarkkailua jatketaan
ru: Наблюдение возобновлено
tr: İzleme devam ettirildi

source: Watching paused
fi: Tarkkailu keskeytetty
ru: Наблюдение приостановлено
tr: İzleme duraklatıldı

source: ObjWatcher
fi: Objektin tarkkailija
ru: Наблюдатель объектов
tr: Nesne İzleyici

source: Watcher timer interval
fi: Tarkkailuajastimen aikaväli
ru: Интервал времени наблюдения
tr: İzleyici zamanlayıcı aralığı

source: obj Watcher
fi: Objektien tarkkailija
ru: наблюдатель объектов
tr: nesne İzleyici

source: This NVDA add-on watches changes to attributes of navigation objects.
fi: Tämä lisäosa tarkkailee navigointiobjektien määreiden muutoksia.
ru: Это дополнение NVDA отслеживает изменения атрибутов объектов навигатора.
tr: Bu NVDA eklentisi, dolaşma nesnelerinin niteliklerinde yapılan değişiklikleri izler.
