Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/evtTracker/*/evtTracker.xliff
Languages: ru

source: Event Tracker
ru: Отслеживание Событий

source: Author: Joseph Lee, Thiago Seus
ru: Автор: Joseph Lee, Thiago Seus

source: This add-on outputs information about objects for which events were fired. Properties recorded in debug log mode include object type, name, role, event, app module, and accessibility API specific information such as accName for IAccessible object and Automation Id for UIA objects.
ru: Это дополнение выводит информацию об объектах, для которых были запущены события. Свойства, записанные в режиме журнала отладки, включают тип объекта, имя, роль, событие, модуль приложения и информацию, относящуюся к API специальных возможностей, такую как accName для объекта IAccessible и идентификатор автоматизации для объектов UIA.

source: Notes:
ru: Примечания:

source: This add-on is designed for developers and power users needing to track events coming from apps and various controls.
ru: Это дополнение предназначено для разработчиков и опытных пользователей, которым необходимо отслеживать события, происходящие из приложений и различных элементов управления.

source: In order to use the add-on, NVDA must be logging in debug mode (configured from general settings/logging level, or restart with debug logging enabled).
ru: Чтобы использовать дополнение, NVDA должна входить в систему в режиме отладки (настроенной на основе общих настроек/уровня ведения журнала или перезапущенной с включенным ведением журнала отладки).

source: It might be possible that add-ons loaded earlier than Event Tracker may not pass on the event to other add-ons, including Event Tracker. If this happens, Event Tracker will not be able to log events.
ru: Возможно, что дополнения, загруженные раньше, чем Отслеживание Событий, могут не передавать события другим дополнениям, включая Отслеживанию Событий. Если это произойдёт, Отслеживание Событий не сможет регистрировать события.

source: Events are handled from global plugins, app modules, tree interceptors, and NVDA objects, in that order.
ru: События обрабатываются из глобальных плагинов, модулей приложений, древовидных перехватчиков и объектов NVDA в указанном порядке.

source: Events and their information
ru: События и информация о них

source: The following events are tracked and recorded:
ru: Отслеживаются и записываются следующие события:

source: Focus manipulation: gain focus, lose focus, focus entered, foreground
ru: Манипулирование фокусом: получение фокуса, потеря фокуса, ввод фокуса, передний план

source: Changes: name, value, state, description, live region
ru: Изменения: название, значение, состояние, описание, живой регион

source: Other events: alert
ru: Другие события: оповещение

source: UIA events: controller for, drag drop and drop target effects, element selected, item status, layout invalidated, notification, system alert, text change, tooltip open, window open
ru: События UIA: контроллер для, перетаскивание целевых эффектов, выбран элемент, состояние элемента, макет недействителен, уведомление, системное оповещение, изменение текста, открыта всплывающая подсказка, открыто окно

source: For each event, the following information will be recorded:
ru: Для каждого события будет записана следующая информация:

source: Event name
ru: Название события

source: Object
ru: Объект

source: Object name
ru: Название объекта

source: Object role
ru: Роль объекта

source: Object value or state depending on events
ru: Значение или состояние объекта в зависимости от событий

source: App module
ru: Модуль приложения

source: For IAccessible objects: acc name, child ID
ru: Для объектов IAccessible: acc name, child ID

source: For UIA objects: Automation Id, class name, notification properties if recording notification event information, child count for layout invalidated event, properties for item status, drag drop, and drop target effect if defined
ru: Для объектов UIA: Идентификатор автоматизации, название класса, свойства уведомления при записи информации о событии уведомления, количество дочерних элементов для события, признанного недействительным в макете, свойства состояния элемента, перетаскивания и целевого эффекта перетаскивания, если они определены

source: You can also assign a gesture to view the events on a list (NVDA menu/Preferences/Input gestures, Event Tracker category). The list saves up to 100 latest events processed.
ru: Вы также можете назначить жест для просмотра событий в списке (меню NVDA/Параметры/Жесты ввода, категория отслеживания событий). В списке сохраняется до 100 последних обработанных событий.

source: If you find this add-on useful, please [review it][1] in the NVDA Add-on Store.
ru: Если вы считаете это дополнение полезным, пожалуйста, [оставьте отзыв о нём][1] в магазине дополнений NVDA.

source: Version 25.1.0
ru: Версия 25.1.0

source: NVDA 2025.1 compatibility.
ru: Совместимость с NVDA 2025.1.

source: NVDA 2024.1 or later is required due to Python 3.11 upgrade.
ru: Требуется NVDA 2024.1 или выше из -за обновления Python 3.11.

source: Restored limited support for Windows 8.1.
ru: Восстановлена ограниченная поддержка Windows 8.1.

source: Made the add-on code more robust with help from Pyright (a Python static type checker).
ru: Код дополнения сделан более надёжно с помощью Pyright (проверка статического типа Python).

source: NVDA will record actual control role name instead of integers when reporting events.
ru: NVDA будет записывать фактическое имя роли управления вместо целых чисел при сообщении о событиях.

source: Version 24.1.0
ru: Версия 24.1.0

source: NVDA 2024.1 compatibility.
ru: Совместимость с NVDA 2024.1.

source: opensourcesys/evtTracker #4: the first event's description no longer missing when first opening the event viewer. Contributed by: WangFeng Huang (hwf1324)
ru: opensourcesys/evtTracker #4: Описание первого события больше не отсутствует при первом открытии просмотрщика событий. При участии: WangFeng Huang (hwf1324)

source: Version 23.02
ru: Версия 23.02

source: NVDA 2022.4 or later is required.
ru: Требуется NVDA 2022.4 или выше.

source: Windows 10 21H2 (November 2021 Update/build 19044) or later is required.
ru: Требуется Windows 10 21H2 (обновление от ноября 2021 года/сборка 19044) или позднее.

source: Alert event (mostly for IAccessible objects) will be tracked.
ru: Событие оповещения (в основном для объектов, доступных для IAccessible) будет отслеживаться.

source: Version 23.01
ru: Версия 23.01

source: NVDA 2022.3 or later is required.
ru: Требуется NVDA 2022.3 или выше.

source: Windows 10 or later is required as Windows 7, 8, and 8.1 are no longer supported by Microsoft as of January 2023.
ru: Требуется Windows 10 или выше, поскольку Windows 7, 8 и 8.1 больше не поддерживаются Корпорацией Майкрософт с января 2023 года.

source: Version 22.12
ru: Версия 22.12

source: Added events list dialog (command unassigned) to list up to 100 recent events recorded by the add-on (Thiago Seus).
ru: Добавлен диалог списка событий (команда не назначена) для отображения до 100 последних событий, записанных дополнением (Thiago Seus).

source: Additional event information such as UIA notification properties are recorded at the same time as events.
ru: Дополнительная информация о событиях, такая как свойства уведомлений UIA, записывается одновременно с событиями.

source: Version 22.10
ru: Версия 22.10

source: NVDA 2022.2 or later is required due to security.
ru: В целях безопасности требуется NVDA 2022.2 или выше.

source: The following UIA property changes are tracked: drag drop effect, drop target effect.
ru: Отслеживаются следующие изменения свойств UIA: эффект перетаскивания, эффект перетаскивания цели.

source: UIA item status property text is logged.
ru: Регистрируется текст свойства статуса элемента UIA.

source: NVDA will no longer play error tones or appear to do nothing if an object does not define a window class name.
ru: NVDA больше не будет воспроизводить сигналы об ошибках или, как представляется, ничего не будет делать, если объект не определяет имя класса окна.

source: Version 22.06
ru: Версия 22.06

source: NVDA 2021.3 or later is required due to security.
ru: В целях безопасности требуется NVDA 2021.3 или выше.

source: Version 21.10
ru: Версия 21.10

source: NVDA 2021.2 or later is required due to changes to NVDA that affects this add-on.
ru: Требуется NVDA 2021.2 или выше из-за изменений в NVDA, которые влияют на это дополнение.

source: UIA layout invalidated event will be tracked.
ru: Событие, при котором макет UIA был признан недействительным, будет отслеживаться.

source: Object role and states information will resemble developer info found in more recent NVDA releases.
ru: Информация о роли и состояниях объекта будет похожа на информацию разработчика, которую можно найти в более поздних версиях NVDA.

source: Version 21.07
ru: Версия 21.07

source: Initial release.
ru: Первоначальный выпуск.
