Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/columnsReview/*/columnsReview.xliff
Languages: tr

source: Columns Review
tr: Sütun İncelemesi

source: Author: Alberto Buffolino, Łukasz Golonka, other contributors
tr: Yazarlar: Alberto Buffolino, Łukasz Golonka ve diğer katkıda bulunanlar

source: NVDA compatibility: 2019.3 and beyond
tr: NVDA uyumluluğu: 2019.3 ve sonrası

source: Columns Review is an add-on to enhance NVDA experience with lists.
tr: Sütun İncelemesi, listelerle NVDA deneyimini geliştirmek için bir eklentidir.

source: Its features include:
tr: Özellikleri şunları içerir:

source: customizable actions on column header and/or content (available actions are read, copy, spell and show in browse mode);
tr: sütun başlığı ve/veya içerik üzerinde özelleştirilebilir eylemler (mevcut eylemler okuma, kopyalama, kodlama ve tarama kipinde gösterme);

source: ability to cycle between columns in ten-by-ten intervals;
tr: onar onar aralıklarla sütunlar arasında geçiş yapma yeteneği;

source: simplified header management (mouse clicks);
tr: basitleştirilmiş başlık yönetimi (fare tıklamaları);

source: on-demand reading of relative current item position (i.e.: item 7 of 10);
tr: göreli geçerli öğe konumunun isteğe bağlı okuması (öğe 7/10 gibi);

source: customizable gestures with or without numpad;
tr: numaratörün kullanıldığı ya da kullanılmadığı özelleştirilebilir hareketler;

source: "0 items" announcement when list is empty;
tr: Liste boş olduğunda "0 öğe" duyurusu;

source: top/bottom edge reporting via speech or beeps;
tr: konuşma veya bip sesleri yoluyla üst/alt kenar bildirimi;

source: say all support;
tr: tümünü okuma desteği;

source: report of selected items (amount and item names);
tr: seçilen öğelerin bildirimi (miktar ve öğe adları);

source: list search (with item multiselection, if checked/supported).
tr: liste araması (işaretliyse/destekleniyorsa öğe çoklu seçimli).

source: Gestures
tr: Hareketler

source: Default keys for columns, headers and position are NVDA+control, but you can customize them from add-on settings (not "Input gestures" dialog!).
tr: Sütunlar, başlıklar ve konum için varsayılan tuşlar NVDA+kontroldür, ancak bunları eklenti ayarlarından özelleştirebilirsiniz ("Girdi hareketleri" iletişim kutusu değil!).

source: Note that your keyboard could have problems processing some key combinations, so try all add-on gestures and adjust them for better results.
tr: Klavyenizin bazı tuş kombinasyonlarını işlemede sorun yaşayabileceğini unutmayın, bu nedenle tüm eklenti hareketlerini deneyin ve daha iyi sonuçlar için gerekli ayarları yapın.

source: See also add-on preferences for numpad mode, keyboard layout (without numpad), and the four available actions for columns.
tr: Ayrıca numaratör modu, klavye düzeni (numaratör olmadan) ve sütunlar için kullanılabilen dört eylem için eklenti tercihlerine bakın.

source: NVDA+control+digits from 1 to 0 (keyboard mode) or from 1 to 9 (numpad mode): by default, read the chosen column if pressed once, copy it if pressed twice;
tr: 1'den 0'a (klavye modu) veya 1'den 9'a (sayısal tuş takımı modu) NVDA+kontrol+haneleri: varsayılan olarak, bir kez basıldığında seçilen sütunu okuyun, iki kez basıldığında kopyalayın;

source: NVDA+control+numpadMinus (numpad mode): like NVDA+control+0 in keyboard mode, read or copy the 10th, 20th, etc column;
tr: NVDA+kontrol+numaratörEksi (numaratör modu): klavye modunda NVDA+kontrol+0 gibi, 10., 20., vb. sütunu okuyun veya kopyalayın;

source: NVDA+control+- (keyboard mode, EN-US layout): in a list with 10+ columns, change interval and process columns from 11 to 20, from 21 to 30, and so on (change last char according to your layout, from settings);
tr: NVDA+control+- (varsayılan, EN-US düzeni, klavye modu): 10'dan fazla sütunlu bir listede, aralığı değiştirmenize ve 11'den 20'ye, 21'den 30'a vb. sütunları okumanıza yarar; düzeninize göre son karakteri değiştirmek için ayarlara bakın;

source: NVDA+control+numpadPlus (numpad mode): like previous command;
tr: NVDA+kontrol+numaratörArtı (numaratör modu): önceki komuta benzer;

source: NVDA+control+enter (numpadEnter in numpad mode): open header manager;
tr: NVDA+control+enter (numaratörde numaratörEnter): sütun başlıkları yöneticisini açar;

source: NVDA+control+delete (numpadDelete in numpad mode): read relative current item position (i.e.: item 7 of 10);
tr: NVDA+kontrol+sil (numaratörde numaratör sil): göreli geçerli öğe konumunu oku (öğe 7/10 gibi);

source: Arrows and NVDA+tab (in empty list): repeat "0 items" message;
tr: Oklar ve NVDA+sekmesi (boş listede): "0 öğe" mesajını tekrarlar;

source: NVDA+downArrow (desktop layout) or NVDA+a (laptop layout): start say all (this gesture depends on original one under "Input gestures"/"System caret");
tr: NVDA+aşağı ok (masaüstü düzeni) veya NVDA+a (dizüstü düzeni): tümünü oku (bu hareket "Girdi hareketleri"/"Sistem düzenleme imleci" altındaki orijinal harekete bağlıdır);

source: NVDA+shift+upArrow (desktop layout) or NVDA+shift+s (laptop layout): report amount and names of current selected list items (like previous command for customization);
tr: NVDA+shift+yukarı ok (masaüstü düzeni) veya NVDA+shift+s (dizüstü düzeni): mevcut seçili liste öğelerinin miktarını ve adlarını bildir (önceki komut gibi NVDA'nın seçilen öğelerin bildirimiyle ilgili girdi hareketine bağlı);

source: NVDA+control+f: open find dialog (not customizable);
tr: NVDA+control+f: bul iletişim kutusunu aç (özelleştirilemez);

source: NVDA+f3: find next occurrence of previously entered text (not customizable);
tr: NVDA+f3: sonrakini bul (özelleştirilemez);

source: NVDA+shift+f3: find previous occurrence (not customizable).
tr: NVDA+shift+f3: öncekini bul (özelleştirilemez).

source: Support
tr: Destek

source: This add-on provide a general support for more common lists (see below), and some specific applications. Main author (Alberto Buffolino) cannot guarantee compatibility/functionality for those applications he not uses, like Outlook and Windows Mail, but he'll be happy to collaborate with their users or accept a pull request for them (note: Outlook is covered now, but user reports are still welcome).
tr: Bu eklenti, daha yaygın listeler (aşağıya bakın) ve bazı özel uygulamalar için genel bir destek sağlar. Ana yazar (Alberto Buffolino), Outlook ve Windows Mail gibi kullanmadığı uygulamalar için uyumluluğu/işlevselliği garanti edemez, ancak kullanıcılarıyla işbirliği yapmaktan veya onlar için bir çekme talebini kabul etmekten memnuniyet duyacaktır.

source: Following list types are supported:
tr: Aşağıdaki liste türleri desteklenir:

source: DirectUIHWND (present in 64-bit systems);
tr: DirectUIHWND (64 bit sistemlerde bulunur);

source: WindowsForms10.SysListView32.* (applications that use .NET);
tr: WindowsForms10.SysListView32.* (.NET kullanan uygulamalar);

source: multi-column treeview like as that presents in [RSSOwlnix][rss];
tr: [RSSOwlnix] [rss] de sunduğu gibi çok sütunlu ağaç görünümü;

source: Thunderbird messages table (thread-grouping supported);
tr: Thunderbird ileti tablosu (iş parçacığı gruplaması desteklenir);

source: Outlook messages table (but list search is not recommended in thread view).
tr: Outlook iletileri tablosu (ancak ileti dizisi görünümünde liste araması önerilmez).
