Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/columnsReview/*/columnsReview.po
Languages: fi, ru, tr

source: Mono-item list:
fi: Luettelossa yksi kohde:
ru: Список с одним элементом:
tr: Tek öğeli liste:

source: List bottom:
fi: Luettelon loppu:
ru: Конец списка:
tr: Liste sonu:

source: List top:
fi: Luettelon alku:
ru: Начало списка:
tr: Liste başı:

source: {name} (DO NOT EDIT!)
fi: {name} (ÄLÄ MUOKKAA!)
ru: {name} (НЕ РЕДАКТИРУЙТЕ!)
tr: {name} (Düzenlemeyin!)

source: No more columns available
fi: Ei enempää sarakkeita käytettävissä
ru: Больше нет доступных столбцов
tr: Başka sütun yok

source: No more visible columns available
fi: Ei enempää näkyviä sarakkeita käytettävissä
ru: Больше нет доступных видимых столбцов
tr: Artık görünür sütun yok

source: Empty column
fi: Tyhjä sarake
ru: Пустой столбец
tr: Boş sütun

source: Returns the header and the content of the list column at the index corresponding to the number pressed
fi: Lukee luettelosarakkeen otsikon ja sisällön painettua numeroa vastaavassa indeksissä.
ru: Возвращает заголовок и содержимое столбца списка с индексом, соответствующим нажатому номеру
tr: Basılan numaraya karşılık gelen dizindeki liste sütununun başlığını ve içeriğini bildirir

source: From {start} to {end}
fi: {start} / {end}
ru: От {start} до {end}
tr: {start} - {end}

source: Cycles between a variable number of intervals of ten columns
fi: Vaihtaa siirtymisväliä kymmenen saraketta kerrallaan.
ru: Переключает между переменным числом интервалов из десяти столбцов
tr: On sütunun değişken aralık sayısı arasında döner

source: No information available
fi: Tietoja ei käytettävissä
ru: Информация отсутствует
tr: Bilgi bulunamadı

source: Announces list item position information
fi: Puhuu luettelokohteen sijaintitiedot.
ru: Объявляет информацию о местоположении элемента списка
tr: Liste öğesi konum bilgisini duyurur

source: Provides a dialog for interactions with list column headers
fi: Avaa valintaikkunan, jossa voidaan hallita luettelosarakkeiden otsikoita.
ru: Предоставляет диалог для взаимодействия с заголовками столбцов списка
tr: Liste sütun başlıklarıyla etkileşim için bir iletişim kutusu gösterir

source: {selCount} selected items: {selNames}
fi: {selCount} valittua kohdetta: {selNames}
ru: выделено {selCount} элементов: {selNames}
tr: {selCount} seçili öğeler: {selNames}

source: Reports current selected list items
fi: Ilmoittaa valitut luettelokohteet.
ru: Объявляет текущие выбранные элементы списка
tr: Geçerli seçili liste öğelerini bildirir

source: Provides a dialog for searching in item list
fi: Avaa valintaikkunan, jossa voidaan hakea kohdeluettelosta.
ru: Предоставляет диалог для поиска в списке элементов
tr: Öğe listesinde arama yapmak için bir iletişim kutusu gösterir

source: Searching...
fi: Haetaan...
ru: Поиск...
tr: Aranıyor...

source: Goes to next result of current search
fi: Siirtää nykyisen haun seuraavaan tulokseen.
ru: Переходит к следующему результату текущего поиска
tr: Geçerli aramanın sonraki sonucuna gider

source: Goes to previous result of current search
fi: Siirtää nykyisen haun edelliseen tulokseen.
ru: Переходит к предыдущему результату текущего поиска
tr: Geçerli aramanın önceki sonucuna gider

source: Starts reading all list items beginning at the item with focus
fi: Aloittaa kaikkien luettelokohteiden lukemisen aktiivisesta kohteesta alkaen.
ru: Запускает чтение всех элементов списка, начиная с элемента в фокусе
tr: Odaklanılan öğeden başlayarak tüm liste öğelerini okumaya başlar

source: {foregroundColors} over {backgroundColors}
fi: Edustan väri: {foregroundColors}, taustan väri: {backgroundColors}
ru: {foregroundColors} на {backgroundColors}
tr: {backgroundColors} üzerinde {foregroundColors}

source: reports foreground and background colors of the current list item.
fi: Ilmoittaa nykyisen kohteen edustan ja taustan värin.
ru: объявляет цвета переднего и заднего плана текущего элемента списка.
tr: geçerli liste öğesinin ön plan ve arka plan renklerini bildirir.

source: Current selection info not available
fi: Valinnan tietoja ei käytettävissä
ru: Текущая информация о выделении недоступна
tr: Geçerli seçim bilgisi mevcut değil

source: Cannot search here.
fi: Haku ei toimi tässä.
ru: Здесь невозможно искать.
tr: Burada arama yapılamıyor.

source: Use multiple selection
fi: Käytä monivalintaa
ru: Использовать множественное выделение
tr: Çoklu seçim kullan

source: Do nothing
fi: Älä tee mitään
ru: Ничего не делать
tr: Hiçbir şey yapma

source: Read column
fi: Lue sarake
ru: Прочитать столбец
tr: Sütunu oku

source: Copy column
fi: Kopioi sarake
ru: Копировать столбец
tr: Sütunu kopyala

source: Spell column
fi: Tavaa sarake
tr: Sütunu kodlayarak seslendir

source: Show column content in browse mode
fi: Näytä sarakkeen sisältö selaustilassa
ru: Показать содержимое столбца в режиме обзора
tr: Sütun içeriğini tarama kipinde göster

source: %s item
fi: %s kohde
ru: %s элемент
tr: %s öğe

source: On first press:
fi: Ensimmäisellä painalluksella:
ru: При однократном нажатии:
tr: İlk basışta:

source: On second press:
fi: Toisella painalluksella:
ru: При двукратном нажатии:
tr: İkinci basışta:

source: On third press:
fi: Kolmannella painalluksella:
ru: При трёхкратном нажатии:
tr: Üçüncü basışta:

source: On fourth press:
fi: Neljännellä painalluksella:
ru: При четырёхкратном нажатии:
tr: Dördüncü basışta:

source: Read the column header
fi: Lue sarakkeen otsikko
ru: Прочитать заголовок столбца
tr: Sütun başlığını oku

source: Copy the column header
fi: Kopioi sarakkeen otsikko
ru: Копировать заголовок столбца
tr: Sütun başlığını kopyala

source: Columns Review
fi: Sarakkeiden tarkastelu
ru: Просмотр Столбцов
tr: Sütun İncelemesi

source: When pressing combination to read column:
fi: Sarakkeen lukemisen pikanäppäin:
ru: При нажатии комбинации для чтения столбца:
tr: Sütunu okumak için ilgili kombinasyona basıldığında:

source: Choose the keys you want to use with numbers:
fi: Valitse numeroiden kanssa käytettävät näppäimet:
ru: Выберите клавиши, которые вы хотите использовать с цифрами:
tr: Numaralarla kullanmak istediğiniz tuşları seçin:

source: Use numpad keys to navigate through the columns
fi: Käytä laskinnäppäimistön näppäimiä sarakkeissa liikkumiseen
ru: Использовать клавиши цифровой клавиатуры для навигации по столбцам
tr: Sütunlar arasında gezinmek için sayısal tuş takımındaki tuşları kullan

source: Insert the char after "0" in your keyboard layout, or another char as you like:
fi: Lisää näppäinasettelussasi merkki 0:n tai muun haluamasi merkin jälkeen:
ru: Вставьте символ после "0" в вашей раскладке клавиатуры или другой символ, который вам нравится:
tr: Klavye düzeninizde "0"dan sonra gelen karakteri veya istediğiniz gibi başka bir karakteri girin:

source: Announce empty list
fi: Ilmoita tyhjästä luettelosta
ru: Объявлять пустой список
tr: Boş listeyi duyur

source: Announce list bounds (top, mono-item, bottom)
fi: Ilmoita luettelon rajat
ru: Объявлять границы списка (верх, с одним элементом, низ)
tr: Liste sınırlarını duyur (üst, tek öğe, alt)

source: voice
fi: puheella
ru: голоса
tr: ses

source: beep
fi: merkkiäänellä
ru: сигнала
tr: bip

source: Announce with:
fi: Ilmoita:
ru: Объявлять спомощью:
tr: Şununla duyur:

source: Please input a frequency for top beep, a frequency for bottom beep, and their duration in milliseconds (each of three values must be a positive number, separated by comma):
fi: Syötä kolme positiivista lukua pilkuilla eroteltuna (ylin ja alin taajuus hertseinä sekä kesto millisekunteina):
ru: Введите частоту для сигнала верха, сигнала низа и их длительность в милисекундах (каждое из трёх значений должно быть положительным числом, отделяемым запятой):
tr: Lütfen üst bip sesi için bir frekans, alt bip sesi için bir frekans ve bunların süresini milisaniye cinsinden girin (üç değerin her biri virgülle ayrılmış pozitif bir sayı olmalıdır):

source: Beep values
fi: Merkkiäänen arvot
ru: Значения сигнала
tr: Bip Değerleri

source: Please input valid values for beep.
fi: Syötä kelvolliset merkkiäänen arvot.
ru: Пожалуйста, введите правильные значения для сигнала.
tr: Lütfen bip sesi için geçerli bir değer girin.

source: Error!
fi: Virhe
ru: Ошибка!
tr: Hata!

source: Headers manager
fi: Otsikoiden hallinta
ru: Управление заголовками
tr: Üstbilgi yöneticisi

source: Unnamed header
fi: Nimetön otsikko
ru: Безымянный заголовок
tr: Adsız başlık

source: Headers:
fi: Otsikot:
ru: Заголовков:
tr: Başlıklar:

source: Left click
fi: Vasen napsautus
ru: Левый щелчок
tr: Sol tık

source: Right click
fi: Oikea napsautus
ru: Правый щелчок
tr: Sağ tık

source: {headerName} header clicked
fi: {headerName}-otsikkoa napsautettu
ru: щелчок по заголовку {headerName}
tr: {headerName} başlık tıklandı

source: Previous add-on settings will be lost. Please configure it again, from NVDA preferences.
fi: Lisäosan aiemmat asetukset menetetään. Määritä ne uudelleen NVDA:n asetuksista.
ru: Предыдущие настройки дополнения будут потеряны. Пожалуйста, настройте его заново в настройках NVDA.
tr: Önceki eklenti ayarları kaybolacak. Lütfen NVDA tercihlerinden yeniden yapılandırın.

source: Add-on settings reset
fi: Lisäosan asetukset nollattu
ru: Сброс настроек дополнения
tr: Eklenti ayarları sıfırlandı

source: You have installed {another_addon} by {another_author}, that causes problems with empty folder feature of ColumnsReview (if enabled); do you want to remove it now?
fi: Sinulla on asennettuna tekijän {another_author} {another_addon} -lisäosa, joka aiheuttaa ongelmia Sarakkeiden tarkastelun tyhjän kansion ilmoitusominaisuuden kanssa, mikäli se on käytössä. Haluatko poistaa sen nyt?
ru: Вы установили {another_addon} {another_author}, что вызывает проблемы с функцией пустых папок в ColumnsReview (если она включена); Удалить его сейчас?
tr: {another_author} tarafından {another_addon} eklentisini yüklediniz, bu Sütun bilgisi (etkinleştirilmişse) boş klasör özelliğinde sorunlara neden oluyor; onu şimdi kaldırmak istiyor musun?

source: Warning!
fi: Varoitus
ru: Предупреждение!
tr: Uyarı!

source: A better experience with lists
fi: Parempi luetteloiden käyttökokemus
ru: Лучший опыт работы со списками
tr: Listelerle daha iyi bir deneyim
