Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/eMule/*/eMule.po
Languages: fi, ru, tr

source: Reads the specified column for the current list item.
fi: Lukee määrätyn sarakkeen nykyiselle listakohteelle.
ru: Читает указанный столбец текущего элемента списка.
tr: Mevcut liste öğesi için belirtilen sütunu okur.

source: Copies the last read column of the selected list item to clipboard.
fi: Kopioi valitun listakohteen viimeksi luetun sarakkeen leikepöydälle.
ru: Копирует последний прочитанный столбец выбранного элемента списка в буфер обмена.
tr: Mevcut liste ögesiyle ilgili en son okunan sütunu panoya kopyalar.

source: %s copied to clipboard
fi: %s kopioitu leikepöydälle
ru: %s скопировано в буфер обмена
tr: %s panoya kopyalandı

source: Moves the system focus and mouse to the main Tool Bar.
fi: Siirtää järjestelmäkohdistuksen ja hiiren päätyökaluriville.
ru: Перемещает системный фокус и мышь на главную панель инструментов.
tr: Sistem odağı ve fareyi ana araç çubuğuna taşır.

source: Reports the current window.
fi: Lukee nykyisen ikkunan.
ru: Объявляет текущее окно.
tr: Mevcut pencereyi okur.

source: Moves the system focus to the Name field of the Search window.
fi: Siirtää järjestelmäkohdistuksen Haku-ikkunan Nimi-kenttään.
ru: Перемещает системный фокус на поле Имя окна поиска.
tr: Sistem odağını arama penceresinde isim alanına taşır.

source: Moves the system focus and mouse to the search parameters list or Edit field for each option, in the Search window.
fi: Siirtää järjestelmäkohdistuksen ja hiiren Haku-ikkunassa hakuparametrien listaan tai jokaisen vaihtoehdon muokkauskenttään.
ru: Перемещает системный фокус и мышь к списку параметров поиска или полю редактирования для каждой опции окна поиска.
tr: Sistem odağını ve fareyi arama penceresinde arama parametreleri veya düzenleme alanına taşır.

source: Moves the system focus to the first list in the current window. For example the results list in the Search window, downloads in Transfer, etc.
fi: Siirtää järjestelmäkohdistuksen nykyisen ikkunan ensimmäiseen listaan. Esimerkiksi Haku-ikkunan hakutulosten listaan, Siirrot-ikkunan Lataukset-listaan jne.
ru: Перемещает системный фокус к первому списку в текущем окне. Например список результатов в окне поиска, загрузки в отдаче и т.д.
tr: Sistem odağını mevcut penceredeki ilk liste öğesine taşır. Örneğin, the arama penceresinde sonuç listesi, transfer edilen indirmeler, vs.

source: Moves the system focus to read-only edit boxes in the current window. For example the IRC received messages.
fi: Siirtää järjestelmäkohdistuksen nykyisen ikkunan vain luku -muokkausruutuihin. Esimerkiksi vastaanotettuihin IRC-viesteihin.
ru: Перемещает системный фокус к полям редактирования только для чтения в текущем окне. Например, входящие сообщения IRC.
tr: Sistem odağını salt okunur metin alanlarına taşır. Örneğin IRC alınan mesajlar alanına.

source: Moves the navigator object and mouse to the current list headers.
fi: Siirtää navigointiobjektin ja hiiren nykyisen listan otsikoihin.
ru: Перемещает объект навигатора и мышь к текущим заголовкам списка.
tr: Sistem odağı ve nesne sunucusunu mevcut listenin başlık alanına taşır.

source: Reports first object of the Status Bar.
fi: Lukee tilarivin ensimmäisen objektin.
ru: Объявляет первый объект в строке состояния.
tr: Durum çubuğunda ilk nesneyi okur.

source: Reports second object of the Status Bar.
fi: Lukee tilarivin toisen objektin.
ru: Объявляет второй объект в строке состояния.
tr: Durum çubuğunda ikinci nesneyi okur.

source: Reports third object of the Status Bar.
fi: Lukee tilarivin kolmannen objektin.
ru: Объявляет третий объект в строке состояния.
tr: Durum çubuğunda üçüncü nesneyi okur.

source: Reports fourth object of the Status Bar.
fi: Lukee tilarivin neljännen objektin.
ru: Объявляет четвёртый объект в строке состояния.
tr: Durum çubuğunda dördüncü nesneyi okur.

source: Toggles on and off the usage of an alternative approach to read sliders
fi: Ottaa käyttöön vaihtoehtoisen liukusäädinten lukutavan tai poistaa sen käytöstä
ru: Переключает использование альтернативного подхода для чтения ползунков
tr: Kaydırıcıları okumak için alternatif bir yaklaşımın kullanımını açar ve kapatır

source: Use alternative approach to read slides on
fi: Vaihtoehtoinen liukusäädinten lukutapa käytössä
ru: Альтернативный подход для чтения ползунков включён
tr: Kaydırıcıları okumak için alternatif yaklaşım kullan Açık

source: Use alternative approach to read slides off
fi: Vaihtoehtoinen liukusäädinten lukutapa ei käytössä
ru: Альтернативный подход для чтения ползунков выключен
tr: Kaydırıcıları okumak için alternatif yaklaşım kullan Kapalı

source: Improves eMule's accessibility with NVDA. eMule is a P2P program to search and share files. You can get more information about eMule at http://www.emule-project.net
fi: Parantaa eMulen saavutettavuutta NVDA:n kanssa. eMule on P2P-asiakasohjelma tiedostojen etsimiseen ja jakamiseen. Saat lisätietoja osoitteesta http://www.emule-project.net
ru: Улучшает доступность eMule с NVDA. eMule это P2P программа для поиска и обмена файлами. Вы можете получить более подробную информацию об eMule на https://www.emule-project.net
tr: NVDA ile eMule'un erişilebilirliğini artırır. eMule arama ve dosya paylaşımı için bir P2P programıdır. eMule hakkında daha fazla bilgi için http://www.emule-project.net
