Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/eMule/*/eMule.xliff
Languages: pt_pt, ru, tr

source: Authors: Noelia, Chris, Alberto.
pt_pt: Autores: Noelia, Chris, Alberto.
ru: Авторы: Noelia, Chris, Alberto.
tr: Yazarlar: Noelia, Chris ve Alberto.

source: This add-on helps to improve accessibility of eMule with nVDA.
pt_pt: Esse complemento ajuda a melhorar a acessibilidade do eMule com o nVDA.
ru: Дополнение позволяет улучшить доступность eMule в NVDA.
tr: Bu eklenti NVDA ile eMule erişilebilirliğinin geliştirilmesine yardımcı olur.

source: It also provides additional keyboard commands for moving in different windows and gives Useful information about eMule.
pt_pt: Ele também fornece comandos de teclado adicionais para movimentação em diferentes janelas e fornece informações úteis sobre o eMule.
ru: Оно также предоставляет дополнительные клавиатурные команды для перемещения между окнами и даёт полезную информацию об eMule.
tr: Ayrıca farklı pencerelerde hareket etmek için ek klavye komutları sağlar ve Emule hakkında yararlı bilgiler verir.

source: It's based on the eMuleNVDASupport add-on, developed by the same author. You should uninstall that old add-on to use this one, since both have common keystrokes and features.
pt_pt: Ele é baseado no complemento eMuleNVDASupport, desenvolvido pelo mesmo autor. Você deve desinstalar esse complemento antigo para usar este, pois ambos têm teclas e recursos comuns.
ru: Оно основано на дополнении eMuleNVDASupport того же автора. Вы должны удалить его старую копию перед использованием этой, потому что оба имеют общие функции и комбинации клавиш.
tr: Bu eklenti aynı yazar tarafından geliştirilen eMuleNVDASupport adlı eklentiye dayanılarak geliştirildi. Her ikisin ortak tuş komutlarına ve benzer özelliklere sahip olduğu için bunu kurmadan önce eskisini kaldırmalısınız.

source: Tested on [eMule][1] 0.50a and 70b.
pt_pt: Testado no [eMule][1] 0.50a e 70b.
ru: Проверено на [eMule][1] 0.50a и 70b.
tr: [eMule][1] 0.50a ve 70b test edilmiştir.

source: Key Commands: ##
pt_pt: Teclas de atalho
ru: Команды Клавиш: ##
tr: Tuş komutları: ##

source: control+shift+h: Moves focus and mouse to main toolbar.
pt_pt: control+shift+h: Move o foco e o mouse para a barra de ferramentas principal.
ru: control+shift+h: Перемещение фокуса и мыши к главной панели инструментов.
tr: kontrol+shift+h: odak ve fareyi Ana araç çubuğuna taşır.

source: control+shift+t: Reads the current window.
pt_pt: control+shift+t: Lê a janela atual.
ru: control+shift+t: Чтение текущего окна.
tr: kontrol + shift + t: Geçerli pencereyi okur.

source: control+shift+n: Moves the focus to the Name field in the Find window.
pt_pt: control+shift+n: Move o foco para o campo Nome na janela Localizar.
ru: control+shift+n: Перемещает фокус на поле Имя в окне поиска.
tr: kontrol + shift + n: Bul penceresinde odağı Ad alanınna taşır.

source: control+shift+p: In the Search window, moves focus and mouse to the list of search parameters, or edit field options.
pt_pt: control+shift+p: Na janela Pesquisar, move o foco e o mouse para a lista de parâmetros de pesquisa ou para as opções do campo de edição.
ru: control+shift+p: В окне поиска, перемещает фокус и мышь в список параметров поиска или в поле редактирования вариантов.
tr: kontrol + shift + p: Arama penceresinde, odağı ve fareyi arama parametreleri listesine veya alan düzenleme seçeneklerine taşır.

source: control+shift+b: Move the focus to the list in the current window. For example usable in the Search window, downloads in Transfer window, etc.
pt_pt: control+shift+b: Move o foco para a lista na janela atual. Por exemplo, utilizável na janela Pesquisar, downloads na janela Transferir, etc.
ru: control+shift+b Переместить фокус в список текущего окна. Например, используется в окне поиска, загрузки в окне передачи и т.д.
tr: kontrol+shift+b: Odağı geçerli penceredeki listeye taşır. Örneğin, Arama penceresinde kullanılabilir, transfer penceresinde indirilenler vb.

source: control+shift+o: Move the focus to read-only edit boxes in the current window. For example the IRC received messages, available Servers, etc.
pt_pt: control+shift+o: Move o foco para caixas de edição somente leitura na janela atual. Por exemplo, as mensagens recebidas do IRC, os servidores disponíveis, etc.
ru: control+shift+o: Переместить фокус в поля редактирования только для чтения текущего окна. Например, полученные сообщения IRC, доступные серверы и т.д.
tr: kontrol+shift+o: Odağı geçerli penceredeki salt okunur düzenleme kutularına taşır. Örneğin, IRC alınan mesajlar, mevcut Sunucular vb.

source: control+NVDA+f: If the caret is located in a read only edit box, opens a find dialog to use the commands for searching text available in NVDA.
pt_pt: control+NVDA+f: Se o cursor estiver localizado em uma caixa de edição somente leitura, abrirá uma caixa de diálogo de localização para usar os comandos de pesquisa de texto disponíveis no NVDA.
ru: control+NVDA+f: Если каретка находится в поле редактирования только для чтения, откроется диалог поиска, доступный в NVDA.
tr: kontrol+NVDA+f: İmleç salt okunur bir düzenleme kutusunda bulunuyorsa, NVDA'da bulunan metin arama komutlarını kullanmak için bir bul iletişim kutusu açar.

source: control+shift+l: Moves the navigator object and mouse to the headers of the current list.
pt_pt: control+shift+l: Move o objeto do navegador e o mouse para os cabeçalhos da lista atual.
ru: control+shift+l: Перемещает объект навигатора и мышь к заголовкам текущего списка.
tr: kontrol + shift + l: Fare ve nesne sunucusunu Mevcut listenin başlıkları üzerine taşır.

source: control+shift+q: Reads the first object in the status bar; provides information about recent activity.
pt_pt: control+shift+q: lê o primeiro objeto na barra de status; fornece informações sobre a atividade recente.
ru: control+shift+q: Читает первый объект строки состояния; предоставляет информацию о последних действиях.
tr: kontrol + shift + q: durum çubuğunda ilk nesneyi okur; son etkinlik hakkında bilgi verir.

source: control+shift+w: Reads the second object of the status bar; contains information about files and users on the current server.
pt_pt: control+shift+w: Lê o segundo objeto da barra de status; contém informações sobre arquivos e usuários no servidor atual.
ru: control+shift+w: Читает второй объект строки состояния; содержит информацию о файлах и пользователях текущего сервера.
tr: kontrol + shift + w: geçerli sunucu üzerinde dosya ve kullanıcılar hakkında bilgi içeren durum çubuğunun ikinci nesnesini okur.

source: control+shift+e: Reads the third object of the status bar; useful to know the UpLoad/DownLoad speed.
pt_pt: control+shift+e: Lê o terceiro objeto da barra de status; útil para saber a velocidade de UpLoad/DownLoad.
ru: control+shift+e: Читает третий объект строки состояния; полезно знать скорость загрузки / выгрузки.
tr: kontrol + shift + e: yükleme ve indirme hızıyla ilgili bilgi veren durum çubuğunun üçüncü nesnesini okur.

source: control+shift+r: Reads The fourth object of the status bar; reports on connecting of eD2K and Kad network.
pt_pt: control+shift+r: Lê O quarto objeto da barra de status; informa sobre a conexão do eD2K e da rede Kad.
ru: control+shift+r: Читает четвёртый объект строки состояния; объявления о подключении к eD2K и Kad сетям.
tr: kontrol+Shift+R: Durum çubuğunun dördüncü nesnesini okur; eD2K ve KAD Network'ün bağlanmasına ilişkin raporlar.

source: Not assigned: Toggles the usage of an alternative approach to read sliders.
pt_pt: Não atribuído: Alterna o uso de uma abordagem alternativa para ler os controles deslizantes.
ru: Не назначена: Переключает использование альтернативного подхода для чтения ползунков.
tr: Atanmadı: Kaydırıcıları okumak için alternatif bir yaklaşımın kullanımını açıp kapatır.

source: Managing columns. ##
pt_pt: Gerenciando colunas. ##
ru: Управление столбцами. ##
tr: Sütunların yönetimi. ##

source: When within a list, you can move the caret between the rows and columns using alt+control+ Arrows.
pt_pt: Em uma lista, você pode mover o cursor entre as linhas e colunas usando alt+control+ setas.
ru: Находясь в списке, можно перемещать каретку между строками и столбцами с помощью alt+ctrl+ стрелки.
tr: Bir liste içindeyken, alt + kontrol + yön tuşlarıyla satır ve sütunlar arasında dolaşabilirsiniz.

source: In this Add-on the following key commands are also available:
pt_pt: Nesse complemento, os seguintes comandos principais também estão disponíveis:
ru: В этом дополнении также доступны следующие команды клавиш:
tr: Bu Eklentide aşağıdaki tuş komutları da mevcuttur:

source: nvda+control+1-0: Reads the first 10 columns.
pt_pt: nvda+control+1-0: Lê as 10 primeiras colunas.
ru: nvda+control+1-0: читает первые 10 столбцов.
tr: nvda + kontrol + 1-0: ilk 10 sütunu okur.

source: nvda+shift+1-0: Reads columns 11 to 20.
pt_pt: nvda+shift+1-0: Lê as colunas 11 a 20.
ru: nvda+shift+1-0: читает столбцы с 11 по 20.
tr: nvda + shift + 1-0: 11-20 sütunları okur.

source: nvda+shift+C: Copies the contents of the last read column to the clipboard.
pt_pt: nvda+shift+C: copia o conteúdo da última coluna lida para a área de transferência.
ru: nvda+shift+C: копирует содержимое последнего прочитанного столбца в буфер обмена.
tr: nvda + shift + C: son okunan sütunun içeriğini panoya kopyalar .

source: Changes for 20.0.0
pt_pt: Alterações para a versão 20.0.0
ru: Изменения в версии 20.0.0
tr: 20.0.0 İçin Değişiklikler

source: Some edit boxes and sliders are labelled, thanks to the [labelAutofinderCore project](https://github.com/ABuffEr/labelAutofinderCore) developed by Alberto Buffolino, one of the authors of this add-on.
pt_pt: Algumas caixas de edição e controles deslizantes são rotulados, graças ao projeto [labelAutofinderCore] (https://github.com/ABuffEr/labelAutofinderCore) desenvolvido por Alberto Buffolino, um dos autores desse complemento.
ru: Большинство полей редактирования и ползунков были промаркированы, благодаря [проекту labelAutofinderCore](https://github.com/ABuffEr/labelAutofinderCore), разрабатываемого Alberto Buffolino, одним из авторов этого дополнения.
tr: Bu eklentinin yazarlarından Alberto Buffolino tarafından geliştirilen [LabelautofinderCore Projesi] (https://github.com/abuffer/labelautofindercore) sayesinde bazı düzenleme kutuları ve kaydırıcılar etiketlenmiştir.

source: A command (not assigned) has been added to toggle the usage of an alternative approach to read sliders (off by default).
pt_pt: Foi adicionado um comando (não atribuído) para alternar o uso de uma abordagem alternativa para ler os controles deslizantes (desativado por padrão).
ru: Добавлена команда (не назначена) для переключения использование альтернативного подхода для чтения ползунков (выключено по умолчанию).
tr: Kaydırıcıları okumak için alternatif bir yaklaşımın kullanımını değiştirmek için bir komut (atanmamış) eklendi (varsayılan olarak kapalı).

source: Changes for 7.0
pt_pt: Alterações para a versão 7.0
ru: Изменения в версии 7.0
tr: 7.0 İçin Değişiklikler

source: Compatible with NVDA 2023.1.
pt_pt: Compatibilidade com NVDA 2023.1
ru: Совместимо с NVDA 2023.1.
tr: NVDA 2023.1 ile uyumlu.

source: Changes for 6.0
pt_pt: Alterações para a versão 6.0
ru: Изменения в версии 6.0
tr: 6.0 İçin Değişiklikler

source: Requires NVDA 2022.1 or later.
pt_pt: Requer o NVDA 2022.1 ou posterior.
ru: Требуется NVDA 2022.1 или позже.
tr: NVDA 2022.1 veya sonraki sürümünü gerektirir.

source: Changes for 5.0
pt_pt: Alterações para a versão 5.0
ru: Изменения в версии 5.0
tr: 5.0 İçin Değişiklikler

source: Compatible with NVDA 2021.1.
pt_pt: Compatível com o NVDA 2021.1.
ru: Совместимо с NVDA 2021.1.
tr: NVDA 2021.1 ile uyumlu.

source: Changes for 4.0 ##
pt_pt: Alterações para a versão 4.0 ##
ru: Изменения в версии 4.0 ##
tr: 4.0 İçin Değişiklikler ##

source: Requires NVDA 2019.3 or later.
pt_pt: Requer NVDA 2019.3 ou superiores.
ru: Требуется NVDA 2019.3 или позже.
tr: NVDA 2019.3 veya sonraki sürümünü gerektirir.

source: Changes for 3.0 ##
pt_pt: Alterações para a versão 3.0 ##
ru: Изменения в версии 3.0 ##
tr: 3.0 İçin Değişiklikler ##

source: To search text in the readonly edit boxes, the find dialog can be used, such as nvda+control+f to activate the find dialog.
pt_pt: Para pesquisar texto nas caixas de edição somente leitura, a caixa de diálogo localizar pode ser usada, como nvda+control+f para ativar a caixa de diálogo localizar.
ru: Для поиска текста в полях редактирования, доступных только для чтения, можно использовать диалог поиска, например, nvda+control+f.
tr: Salt okunur düzenleme kutularında metin aramak için bulma iletişim kutusunu etkinleştirmek amacıyla nvda+control+f gibi bulma iletişim kutusu kullanılabilir.

source: Changes for 2.0 ##
pt_pt: Alterações para a versão 2.0 ##
ru: Изменения в версии 2.0 ##
tr: 2.0 İçin Değişiklikler ##

source: Add-on help is available from the Add-ons Manager.
pt_pt: A ajuda do add-on está disponível no Add-ons Manager.
ru: Справка дополнения доступна в диспетчере дополнений.
tr: Eklenti yardımı, Eklenti Mağazasından edinilebilir.

source: Changes for 1.2 ##
pt_pt: Alterações para a versão 1.2 ##
ru: Изменения в версии 1.2 ##
tr: 1.2 İçin Değişiklikler ##

source: When moving to the IRC messages, the selected text is reported properly.
pt_pt: Ao passar para as mensagens do IRC, o texto selecionado é relatado corretamente.
ru: При перемещении к сообщениям IRC, выделенный текст сообщается правильно.
tr: IRC mesajları arasında dolaşılırken, seçilen metin düzgün bildiriliyor.

source: The keystroke used for moving to the Search results list has been generalized to be able to move focus to any available list in the current window.
pt_pt: O pressionamento de tecla usado para mover para a lista de resultados da pesquisa foi generalizado para poder mover o foco para qualquer lista disponível na janela atual.
ru: Комбинации клавиш, использующиеся для перемещения в список результатов поиска, были обобщены, чтобы иметь возможность перемещать фокус на любой доступный список текущего окна.
tr: Arama sonuçları listesine gitmek için kullanılan Kısayol tuşu, odağı geçerli pencerede mevcut herhangi bir listeye taşıyabilecek şekilde genelleştirilmiştir.

source: The command used to focus the IRC messages has been generalized to move to any read-only edit box, making it possible to review connection information in the Servers window.
pt_pt: O comando usado para focalizar as mensagens de IRC foi generalizado para ser movido para qualquer caixa de edição somente leitura, possibilitando a revisão das informações de conexão na janela Servidores.
ru: Команда, используемая для просмотра сообщений IRC, была обобщена, чтобы переходить к любому полю редактирования только для чтения, что делает возможным просмотреть информацию о соединении в окне сервера.
tr: IRC mesajlarına odaklanmak için kullanılan komut, herhangi bir salt okunur düzenleme kutusuna taşınacak şekilde genelleştirildi, bu da Sunucular penceresinde bağlantı bilgilerinin gözden geçirilmesini mümkün kıldı.

source: When moving mouse and focus to the toolbar, in some cases it was announced twice. This has been fixed.
pt_pt: Ao mover o mouse e o foco para a barra de ferramentas, em alguns casos ela era anunciada duas vezes. Isso foi corrigido.
ru: При перемещении мыши и фокуса на панель инструментов, в некоторых случаях были двукратные объявления. Это было исправлено.
tr: Fare ve odak araç çubuğuna taşınırken, bazı durumlarda iki kez anons ediliyordu. Bu düzeltildi.

source: Changes for 1.1 ##
pt_pt: Alterações para a versão 1.1 ##
ru: Изменения в версии 1.1 ##
tr: 1.1 İçin Değişiklikler ##

source: Fixed bug in eMule item under NVDA's help menu, when the user config folder name contains non latin characters.
pt_pt: Foi corrigido o erro no item do eMule no menu de ajuda do NVDA, quando o nome da pasta de configuração do usuário contém caracteres não latinos.
ru: Исправлена ошибка элемента меню eMule в пункте меню помощи NVDA, когда имя папки конфигурации Пользователя содержит не латинские буквы.
tr: NVDA'nın yardım menüsündeki eMule öğesinde, kullanıcı Konfigürasyon klasörü adı Latin alfabesi dışındaki karakterler içerdiğinde ortaya çıkan hata düzeltildi.

source: Shortcuts can now be reassigned using the NVDA gesture input dialog.
pt_pt: Os atalhos agora podem ser reatribuídos usando a caixa de diálogo de entrada de gestos do NVDA.
ru: Горячие клавиши могут теперь быть переназначены с помощью диалога жестов ввода NVDA.
tr: Kısayollar artık NVDA girdi hareketleri iletişim kutusu kullanılarak yeniden atanabilir.

source: Changes for 1.0 ##
pt_pt: Alterações para 1.0 ##
ru: Изменения в версии 1.0 ##
tr: 1.0 İçin Değişiklikler ##

source: Initial version.
pt_pt: Versão inicial.
ru: Начальная версия.
tr: İlk sürüm.
