Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/wordNav/*/wordNav.xliff
Languages: fi, ru, tr

source: nvda-word-nav
tr: nvda-kelime-dolaşımı

source: WordNav NVDA add-on improves built-in navigation by word, as well as adds extra word navigation commands with different definition for the word. It also provides word selection commands.
fi: Sananavigointi-lisäosa parantaa sisäänrakennettua sananavigointia sekä lisää ylimääräisiä komentoja, joilla voi siirtyä eri tavalla määritettyjen sanojen välillä. Lisäosassa on myös sananvalintakomentoja.
ru: Дополнение WordNav NVDA улучшает встроенную навигацию по словам, а также добавляет дополнительные команды навигации по словам с другим определением слова. Оно также предоставляет команды выделения слов.
tr: Kelime Dolaşımı NVDA eklentisi, yerleşik kelime dolaşımını geliştirmenin yanı sıra, kelimenin farklı tanımıyla ekstra kelime dolaşımı komutları da ekler. Ayrıca kelime seçme komutları da sağlar.

source: Most text editors support Control+LeftArrow/RightArrow commands for word navigation. However the definition of the word changes from one program to another. This is especially true of modern web-based text editors, such as Monaco. NVDA should know the definition of word in given program in order to speak words correctly. If NVDA doesn't know the exact definition, then either words are going to be skipped, or pronounced multiple times. Moreover, some web-based text editors position the cursor in the end of the word, instead of the beginning, making editing much harder for visually impaired users. In order to combat this problem I have created enhanced word navigation commands, that take the word definition from Notepad++ and they do not rely on program's definition of words, but rather parse lines into words on NVDA's side. The Control+LeftArrow/RightArrow gesture is not even sent to the program, thus ensuring the consistency of the speech.
fi: Useimmat tekstieditorit tukevat Ctrl+Nuoli vasemmalle/oikealle -komentoja sananavigointia varten. Sanan määritelmä kuitenkin muuttuu ohjelmasta toiseen. Tämä pätee erityisesti nykyaikaisiin verkkopohjaisiin tekstieditoreihin, kuten Monaco. NVDA:n tulee tietää sanan määritelmä tietyssä ohjelmassa voidakseen puhua sanat oikein. Jos NVDA ei tiedä tarkkaa määritelmää, sanat joko ohitetaan tai ne puhutaan useita kertoja. Lisäksi jotkin verkkopohjaiset tekstieditorit sijoittavat kohdistimen sanan loppuun alun sijaan, mikä tekee muokkaamisesta paljon vaikeampaa näkövammaisille käyttäjille. Tämän ongelman torjumiseksi on luotu parannettuja sananavigointikomentoja, jotka ottavat sanamääritelmän Notepad++:sta eivätkä luota ohjelman sanamäärittelyyn vaan jäsentävät rivit sanoiksi NVDA:n sisällä. Ctrl+Nuoli vasemmalle/oikealle -komentoa ei edes lähetetä ohjelmalle, mikä varmistaa puheen johdonmukaisuuden.
ru: Большинство текстовых редакторов поддерживают команды Control+Стрелка влево / Стрелка вправо для навигации по словам. Однако определение слова меняется от одной программы к другой. Это особенно актуально для современных текстовых редакторов на основе веб-технологий, таких как Monaco. NVDA должна знать определение слова в данной программе, чтобы правильно произносить слова. Если NVDA не знает точного определения, то либо слова будут пропущены, либо произнесены несколько раз. Более того, некоторые текстовые веб-редакторы помещают курсор в конец слова, а не в начало, что значительно усложняет редактирование для слабовидящих пользователей. Для борьбы с этой проблемой я создал улучшенные команды навигации по словам, которые берут определение слова из Notepad++ и не полагаются на определение слов в программе, а разбирают строки на слова на стороне NVDA. Команда Control + Стрелка влево / Стрелка вправо даже не передается в программу, что обеспечивает согласованность речи.
tr: Çoğu metin düzenleyicisi, kelimeler arasında dolaşmak için Control+Sol OK/Sağ Ok tuşlarını destekler. Ancak kelimenin ne olarak tanımlandığı bir programdan diğerine değişiklik gösterebilir. Bu durum özellikle Monako gibi modern web tabanlı metin düzenleyicileri için geçerlidir. NVDA, kelimeleri doğru tanımlayabilmesi için verilen programdaki kelimenin tanımını bilmelidir. NVDA tam tanımı bilmiyorsa, ya kelimeleri atlar, ya da kelimeleri birçok kez tekrar eder. Ayrıca, bazı web tabanlı metin düzenleyicileri, imleci kelimenin başına değil sonuna yerleştirir ve bu da görme engelli kullanıcılar için düzenlemeyi çok daha zor hale getirir. Bu sorunlara çözüm getirebilmek için kelimenin tanımını Notepad++'dan alan ve odaklanan programın kelime tanımını yoksayan, bunun yerine NVDA tarafından satırları sözcüklere ayrıştıran gelişmiş kelime dolaşım komutları oluşturdum. Control +sağ ve Sol ok tuşları kullanılan programa gönderilmez ve böylece konuşma tutarlılığı sağlanır.

source: Word navigation and word definitions
fi: Sananavigointi ja sanojen määritelmät
ru: Навигация по словам и определения слов
tr: Kelime dolaşımı ve kelime tanımları

source: Currently WordNav supports five definitions of the word, assigned to different gestures:
fi: Sananavigointi-lisäosa tukee tällä hetkellä viittä sanamääritelmää, joille on määritetty eri näppäinkomennot:
ru: В настоящее время WordNav поддерживает пять определений слова, присвоенных различным жестам:
tr: Şu anda Kelime Dolaşımı, kelimenin farklı hareketlere atanmış beş tanımını desteklemektedir:

source: - `Left Control+Arrows`: Notepad++ definition, that treats alphanumeric characters as words, and adjacent punctuation marks are also treated as words. This should be the most convenient word definition for the majority of users.
fi: Vasen Ctrl+Nuolinäppäimet: Notepad++-määritelmä, joka käsittelee aakkosnumeerisia merkkejä ja vierekkäisiä välimerkkejä sanoina. Tämä sopii todennäköisesti parhaiten valtaosalle käyttäjistä.
ru: `Левый Control+Стрелки`: Определение Notepad++, которое рассматривает буквенно-цифровые символы как слова, а соседние знаки препинания также рассматриваются как слова. Это должно быть наиболее удобное определение слова для большинства пользователей.
tr: "SolKontrol+Ok tuşları": Alfanümerik karakterleri ve bitişik noktalama işaretleri de kelime olarak tanımlayan Notepad++ tanımı. Bu çoğu kullanıcının kullandığı genel kelime tanımıdır.

source: - `RightControl+Arrows`: Fine word definition splits `camelCaseIdentifiers` and `underscore_separated_identifiers` into separate parts, thus allowing the cursor to go into long identifiers.
fi: `Oikea Ctrl+Nuolinäppäimet`: Tarkka sanamääritelmä jakaa `karavaaniTyyliset` sekä `alaviivalla_erotetut_merkkijonot` erillisiksi osiksi, mikä mahdollistaa kohdistimella liikkumisen pitkissä merkkijonoissa.
ru: `Правый Control+Стрелки`: Тонкое определение слова разделяет `camelCaseIdentifiers` и `underscore_separated_identifiers` на отдельные части, что позволяет курсору переходить к длинным идентификаторам.
tr: "Sağ control+ ok tuşları": CamelCase tanımlayıcısının kullanıldığı veya alt çizgi karakteriyle ayrılan cümlecikleri bölünmesinden oluşan tanımdır. CamelCase: olarak adlandırılan bir bileşik kelimenin ikinci kelimesinin büyük harfle başlaması.

source: - `LeftControl+Windows+Arros`: Bulky word definition treats almost all punctuation symbols adjacent to text as part of a single word, therefore it would treat paths like `C:\directory\subdirectory\file.txt` as a single word.
fi: `Vasen Ctrl+Win+Nuolinäppäimet`: Laaja sanamääritelmä käsittelee lähes kaikki tekstissä kiinni olevat välimerkit yhteen sanaan kuuluvina, jolloin esimerkiksi tiedostopolut kuten `C:\hakemisto\alihakemisto\tiedosto.txt` tulkitaan yhdeksi sanaksi.
ru: `Левый Control+Windows+Стрелки`: Определение громоздкого слова рассматривает почти все знаки препинания, расположенные рядом с текстом, как часть одного слова, поэтому пути типа `C:\directory\subdirectory\file.txt` будут рассматриваться как одно слово.
tr: `SolKontrol+Windows+ok tuşları`: Hacimli kelime tanımı, metne bitişik hemen hemen tüm noktalama işaretlerini tek bir kelimenin parçası olarak ele alır, bu nedenle yolları tek bir kelime gibi ele alır. C:\directory\subdirectory\\file.txt.

source: - `RightControl+Windows+Arros`: Multiword definition, that groups several words together. The amount of words is configurable.
fi: `Oikea Ctrl+Win+Nuolinäppäimet`: Monisanamääritelmä, joka ryhmittelee useita sanoja yhteen. Sanojen määrä on muutettavissa.
ru: `Правый Control+Windows+Стрелки`: Многословное определение, которое группирует несколько слов вместе. Количество слов настраивается.
tr: "SağKontrol+Windows+Ok tuşları": Birkaç kelimeyi bir arada gruplayan çok kelimeli tanım. Kelime sayısı yapılandırılabilir.

source: - Unassigned: custom regular expression word definition: allows user to define a custom regular expression for word boundaries.
fi: Ei määritetty: Mukautetun sääntölausekkeen sanamääritelmällä käyttäjä voi määritellä sanan rajat mukautetun säännöllisen lausekkeen avulla.
ru: Неназначено: пользовательское регулярное выражение определения слова: позволяет пользователю определить пользовательское регулярное выражение для границ слов.
tr: Atanmamış: özel normal ifade kelime tanımı: kullanıcının kelime sınırları için özel bir normal ifade tanımlamasına olanak tanır.

source: Gestures can be customized in WordNav settings panel.
fi: Näppäinkomentoja on mahdollista muuttaa Sananavigoinnin asetuspaneelissa.
ru: Жесты могут быть настроены в панели настроек навигации по словам.
tr: Hareketler, Kelime Dolaşımı ayarları iletişim kutusundan özelleştirilebilir.

source: Word selection
fi: Sanan valitseminen
ru: Выделение слова
tr: Kelime seçimi

source: Word selection is supported starting with WordNav v2.0. Just add `shift` modifier to any word navigation gestures to select words. There is also one extra gesture for word selection:
fi: Sanan valitsemista tuetaan lisäosan versiosta 2.0 lähtien. Valitse sanoja lisäämällä mihin tahansa sananavigointikomentoon `Vaihto`-näppäin. Sanan valintaa varten on myös yksi lisäkomento:
ru: Выделение слов поддерживается начиная с WordNav v2.0. Просто добавляйте модификатор `shift` к любым жестам навигации, чтобы выделять слова. Также есть один дополнительный жест для выделения слова:
tr: Kelime seçimi, Kelime Dolaşımı v2.0'dan itibaren desteklenmektedir. Kelimeleri seçmek için herhangi bir kelime dolaşım hareketine "shift" değiştiricisini eklemeniz yeterlidir. Kelime seçimi için ayrıca ekstra bir hareket daha vardır:

source: `control+shift+numpad1` and `control+windows+shift+numpad1` select word to the right similar to their `rightArrow` counterparts, but they also include trailing spaces into selection.
fi: `Ctrl+Vaihto+Laskinnäppäimistön 1` ja `Ctrl+Win+Vaihto+Laskinnäppäimistön 1` valitsevat sanan kohdistimen oikealta puolelta samaan tapaan kuin niiden `oikeaa nuolinäppäintä` käyttävät vastineet, mutta ne sisällyttävät valintaan myös sanan jälkeiset välilyönnit.
ru: `control+shift+1 на цифровом блоке` и `control+windows+shift+1 на цифровом блоке` выделить слово справа аналогично их аналогам с `стрелкой вправо`, но они также включают в выделение конечные пробелы.
tr: `CTRL+shift+sayısal tuş takımı 1` ve `CTRL+windows+shift+sayısal tuş takımı 1`, `sağ ok` karşılıklarına benzer şekilde sağa doğru kelime seçer, ancak seçime sondaki boşlukları da eklerler.

source: Please note, however, that currently used accessibility APIs have multiple issues related to word selection. Please get yourself familiar with the following list of issues and workarounds:
fi: Huomioithan kuitenkin, että tällä hetkellä käytössä olevissa saavutettavuusrajapinnoissa on useita sanan valintaan liittyviä ongelmia. Tutustu seuraavaan luetteloon ongelmista ja niiden kiertotavoista:
ru: Но обратите внимание, что используемые в настоящее время API-интерфейсы специальных возможностей имеют множество проблем, связанных с выбором слов. Пожалуйста, ознакомьтесь со следующим списком проблем и способов их устранения:
tr: Ancak, şu anda kullanılan erişilebilirlik API'lerinin kelime seçimiyle ilgili birden fazla sorunu olduğunu lütfen unutmayın. Lütfen aşağıdaki sorunlar ve geçici çözümler listesini öğrenin:

source: UIA applications (e.g. Notepad, Visual Studio, Microsoft Word) don't support setting caret at the beginning of selection. In those applications caret location is stored on WordNav side. As an adverse side effect, word navigation commands might not play well with line and paragraph selection commands (`shift+up/downArrow`, `control+shift+up/downArrow`) and results might be unpredictable. For convenience, character selection commands (`shift+left/rightArrow`) have been updated in WordNav for UIA applications and should work well.
fi: UIA-sovellukset (esim. Muistio, Visual Studio ja Microsoft Word) eivät tue kohdistimen siirtämistä valinnan alkuun. Näissä sovelluksissa kohdistimen sijainti tallennetaan Sananavigoinnin puolella. Haittavaikutuksena on, että sananavigointikomennot eivät välttämättä toimi saumattomasti rivin- ja kappaleenvalintakomentojen kanssa (`Vaihto+Ylä/alanuoli`, `Ctrl+Vaihto+Ylä/alanuoli`), ja tulokset voivat olla ennakoimattomia. Käytännön syistä merkinvalintakomennot (`Vaihto+Vasen/oikea nuoli`) on päivitetty Sananavigoinnissa UIA-sovelluksia varten ja niiden pitäisi toimia hyvin.
ru: Приложения UIA (например, Блокнот, Visual Studio, Microsoft Word) не поддерживают установку курсора в начале выделения. В этих приложениях расположение курсора сохраняется на стороне WordNav. В качестве побочного эффекта команды навигации по тексту могут плохо сочетаться с командами выделения строк и абзацев (`shift+стрелка вверх/вниз`, `control+shift+стрелка вверх/вниз`), и результаты могут быть непредсказуемыми. Для удобства команды выделения символов (`shift+стрелка влево/вправо`) были обновлены в WordNav для приложений UIA и должны работать хорошо.
tr: UIA uygulamaları (örneğin Notepad, Visual Studio, Microsoft Word) seçimin başında işaret ayarlamayı desteklemez. Bu uygulamalarda caret konumu Kelime Dolaşımı tarafında saklanır. Olumsuz bir yan etki olarak, kelime dolaşımı komutları satır ve paragraf seçme komutlarıyla (`shift+yukarı/aşağı Ok`, `CTRL+shift+yukarı/aşağı Ok`) iyi çalışmayabilir ve sonuçlar tahmin edilemez olabilir. Kolaylık sağlamak için, karakter seçim komutları (`shift+sol/sağ ok`) UIA uygulamaları için Kelime Dolaşımı eklentisinde güncellenmiştir ve iyi çalışması gerekir.

source: Basic single line Windows edit controls also don't allow to set the caret in front of selection, so the previous point also applies to them. This affects all single line edit boxes within NVDA.
fi: Yksiriviset Windowsin perusmuokkaussäätimet eivät myöskään salli kohdistimen siirtämistä valinnan eteen, joten aiempi huomautus pätee myös niihin. Tämä vaikuttaa NVDA:ssa kaikkiin yksirivisiin muokkausruutuihin.
ru: Базовые однострочные элементы управления редактированием Windows также не позволяют устанавливать курсор перед выделением, поэтому к ним также применим предыдущий пункт. Это касается всех однострочных полей редактирования в NVDA.
tr: Temel tek satırlı Windows düzenleme kontrolleri ayrıca düzeltme işaretinin seçimin önüne ayarlanmasına izin vermez, bu nedenle önceki nokta onlar için de geçerlidir. Bu, NVDA'daki tüm tek satırlı düzenleme kutularını etkiler.

source: IAccessible2 doesn't provide a way to set selection spanning across multiple paragraphs. There is no known workaround for this issue. This affects rich multiline edit boxes in Chrome and Firefox, such as compose email text area in GMail and compose email window in Thunderbird.
fi: IAccessible2 ei tarjoa tapaa asettaa valintaa, joka jakautuu useisiin kapppaleisiin. Tähän ongelmaan ei ole tunnettua kiertotietä. Tämä vaikuttaa Chromessa ja Firefoxissa muotoiltua tekstiä sisältäviin monirivisiin muokkauskenttiin, kuten sähköpostin kirjoitusalueeseen GMailissa ja viestinkirjoitusikkunaan Thunderbirdissä.
ru: В IAccessible2 нет способа настроить выделение, охватывающее несколько абзацев. Не существует известного решения этой проблемы. Это влияет на расширенные многострочные поля редактирования в Chrome и Firefox, такие как текстовая область создания электронного письма в GMail и окно создания электронного письма в Thunderbird.
tr: IAccessible2, seçimin birden çok paragrafa yayılmasını ayarlamanın bir yolunu sağlamaz. Bu sorun için bilinen bir geçici çözüm yoktur. Bu, Gmail'deki e-posta metni oluşturma alanı ve Thunderbird'deki e-posta oluşturma penceresi gibi Chrome ve Firefox'taki zengin çok satırlı düzenleme kutularını etkiler.

source: In notepad++ selection update messages come unreasonably slow. As a workaround, WordNav announces selection on NVDA side for word selection commands and silences late notifications for the following 0.5 seconds. As a result, if you press word selection command followed by another (e.g. character) selection command in quick succession, you might miss selection notification for the latter one if it came within 0.5 seconds from the last word selection command.
fi: Notepad++:ssa valinnanpäivitysilmoitukset tulevat kohtuuttoman hitaasti. Ongelman kiertämiseksi Sananavigointi ilmoittaa valinnasta NVDA:n puolella sananvalintakomentojen yhteydessä ja hiljentää myöhästyneet ilmoitukset seuraavan 0,5 sekunnin ajaksi. Tämän seurauksena, jos painat sananvalintakomentoa ja sen jälkeen nopeasti toista komentoa (esim. merkin valitsemiseksi), saatat jäädä ilman valinnan ilmoitusta jälkimmäisestä komennosta, jos se tuli 0,5 sekunnin sisällä edellisestä sananvalintakomennosta.
ru: В notepad++ сообщения об обновлении выделения приходят неоправданно медленно. В качестве обходного решения WordNav объявляет о выделении команд выделения слов на стороне NVDA и отключает уведомления о задержке на следующие 0,5 секунд. В результате, если вы быстро нажмёте команду выделения слова, за которой последует другая команда выделения (например, символа), вы можете пропустить уведомление о выделении последней команды, если оно пришло в течение 0,5 секунд после последней команды выделения слова.
tr: Notepad++ seçiminde güncelleme mesajları makul olmayan bir şekilde yavaş geliyor. Geçici bir çözüm olarak Kelime Dolaşımı, NVDA tarafında kelime seçimi komutları için seçimi duyurur ve sonraki 0,5 saniye boyunca geç bildirimleri susturur. Sonuç olarak, kelime seçme komutuna ve ardından hızlı bir şekilde art arda başka bir (örneğin karakter) seçim komutuna basarsanız, son kelime seçme komutundan 0,5 saniye sonra geldiyse sonuncuya ilişkin seçim bildirimini kaçırabilirsiniz.

source: In multiline edit boxes supporting TOM interface NVDA incorrectly identifies cursor location when selection is present. This has been fixed in nvaccess/nvda#16455, which is scheduled to be included in NVDA v2024.2 release. Before that release word selection commands won't work correctly in TOM edit boxes, such as NVDA log viewer.
fi: NVDA tunnistaa virheellisesti kohdistimen sijainnin, kun tekstiä on valittuna TOM-rajapintaa tukevissa monirivisissä muokkauskentissä. Tämä on korjattu nvaccess/nvda#16455:ssa, joka on suunniteltu sisällytettäväksi NVDA:n 2024.2-versioon. Ennen tätä versiota sananvalintakomennot eivät toimi oikein TOM-muokkauskentissä, kuten NVDA:n lokintarkastelussa.
ru: В многострочных полях редактирования, поддерживающих интерфейс TOM, NVDA неправильно определяет местоположение курсора при выделении. Это было исправлено в nvaccess/nvda#16455, который планируется включить в версию NVDA v2024.2. До этого выпуска команды выбора слов будут работать не правильно в окнах редактирования TOM, таких как просмотрщик журнала NVDA.
tr: TOM arayüzünü destekleyen çok satırlı düzenleme kutularında NVDA, seçim mevcut olduğunda imleç konumunu yanlış tanımlıyor. Bu durum, NVDA v2024.2 sürümüne dahil edilmesi planlanan nvaccess/nvda#16455'te düzeltildi. Bu sürümden önce, kelime seçimi komutları, NVDA günlük görüntüleyici gibi TOM düzenleme kutularında düzgün çalışmayacaktır.

source: Notes
fi: Huomautuksia
ru: Примечания
tr: Notlar

source: - If you would like to use virtual desktops feature of Windows 10, please remember to disable Control+Windows+Arrows keyboard shortcuts either in WordNav Settings panel, or in NVDA Input gestures dialog.
fi: Jos haluat käyttää Windows 10:n virtuaalityöpöytäominaisuutta, muista poistaa käytöstä Ctrl+Win+Nuoli-pikanäppäimet joko Sananavigoinnin asetuspaneelissa tai NVDA:n Näppäinkomennot-valintaikkunassa.
ru: Если вы хотите использовать функцию виртуальных рабочих столов в Windows 10, пожалуйста, не забудьте отключить сочетания клавиш Control+Windows+Стрелки либо на панели настроек WordNav, либо в диалоге жестов ввода NVDA.
tr: Windows 10'un sanal masaüstleri özelliğini kullanmak istiyorsanız, lütfen Kelime Dolaşımı Ayarları iletişim kutusundan veya NVDA Girdi hareketleri iletişim kutusunda Control+Windows+Oklar klavye kısayollarını devre dışı bırakmayı unutmayın.

source: - Compatibility with VSCode requires NVDA add-on IndentNav v2.0 or later to be installed. Additionally, VSCode extension [Accessibility for NVDA IndentNav](https://marketplace.visualstudio.com/items?itemName=TonyMalykh.nvda-indent-nav-accessibility) must be installed in VSCode.
fi: Yhteensopivuus VSCoden kanssa edellyttää, että Sisennysnavigointi-lisäosasta on asennettu versio 2.0 tai uudempi. Lisäksi VSCodeen on asennettava [Accessibility for NVDA IndentNav](https://marketplace.visualstudio.com/items?itemName=TonyMalykh.nvda-indent-nav-accessibility) -laajennus.
ru: Для обеспечения совместимости с VSCode необходимо установить дополнение NVDA IndentNav версии 2.0 или более поздней. Кроме того, в VSCode должно быть установлено расширение VSCode [Специальные возможности для NVDA IndentNav](https://marketplace.visualstudio.com/items?itemName=TonyMalykh.nvda-indent-nav-accessibility).
tr: VSCode ile uyumluluk, NVDA eklentisi Girinti Dolaşımı v2.0 veya sonraki sürümlerinin kurulu olmasını gerektirir. Ayrıca, VSCode'a VSCode uzantısı [NVDA IndentNav için Erişilebilirlik](https://marketplace.visualstudio.com/items?itemName=TonyMalykh.nvda-indent-nav-accessibility) yüklenmelidir.

source: Downloads
fi: Lataukset
ru: Загрузки
tr: İndirin

source: Please install the latest version from NVDA add-on store.
fi: Asenna uusin versio NVDA:n lisäosakaupasta.
ru: Установите последнюю версию из магазина дополнений NVDA.
tr: Lütfen NVDA eklenti mağazasından en son sürümü yükleyin.
