Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/wordNav/*/wordNav.po
Languages: fi, ru, tr

source: WordNav
fi: Sananavigointi
ru: Навигация по словам
tr: Kelime Dolaşımı

source: Default NVDA word navigation (WordNav disabled)
fi: Oletusarvoinen sananavigointi (lisäosa pois käytöstä)
ru: Навигация по словам NVDA по умолчанию (WordNav отключён)
tr: Varsayılan NVDA kelime Dolaşımı (Kelime Dolaşımı devre dışı)

source: Notepad++ style navigation
fi: Notepad++-tyylinen navigointi
ru: Навигация в стиле Notepad++
tr: Notepad++ stili Dolaşma

source: Bulky word navigation
fi: Laaja sananavigointi
ru: Объёмная навигация по словам
tr: Hacimli kelime Dolaşımı

source: Fine word navigation - good for programming
fi: Tarkka sananavigointi (hyvä ohjelmointiin)
ru: Тонкая навигация по словам - хорошо для программирования
tr: İnce kelime Dolaşımı - programlama için iyi

source: MultiWord navigation - reads multiple words at once
fi: Monisananavigointi (lukee useita sanoja kerralla)
ru: Многословная навигация - одновременное чтение нескольких слов
tr: Çoklu Kelime Dolaşımı - aynı anda birden fazla kelime okur

source: Custom regular expression word navigation
fi: Sananavigointi mukautetulla sääntölausekkeella
ru: Навигация по словам с помощью пользовательских регулярных выражений
tr: Özel normal ifade kelime Dolaşımı

source: Unassigned
fi: Ei määritetty
ru: Неназначено
tr: Atanmamış

source: Enable WordNav in editables
fi: Käytä Sananavigointia muokkauskentissä
ru: Включить навигацию по словам в полях редактора
tr: Düzenleme alanlarında Kelime Dolaşımını etkinleştir

source: Enable WordNav in browse mode.
fi: Käytä Sananavigointia selaustilassa
ru: Включить навигацию по словам в режиме обзора.
tr: Gözatma modunda Kelime Dolaşımını etkinleştir.

source: Enable WordNav word selection
fi: Käytä Sananavigoinnin sananvalintaa
ru: Включить выделение слов в WordNav
tr: Kelime seçiminde Kelime Dolaşımını Etkinleştir

source: Include trailing space when selecting words with control+shift+rightArrow
fi: Sisällytä loppuvälilyönti valittaessa sanoja Ctrl+Vaihto+Nuoli oikealle -näppäinyhdistelmällä
ru: Добавлять пробел в конце слова при выделении слов с помощью клавиш control+shift+стрелка вправо
tr: CTRL+shift+sağ ok ile kelime seçerken sondaki boşluğu dahil et

source: Left control behavior:
fi: Vasemman Ctrl-näppäimen toiminta:
ru: Поведение левого Control:
tr: Sol kontrol davranışı:

source: Right control behavior:
fi: Oikean Ctrl-näppäimen toiminta:
ru: Поведение правого Control:
tr: Sağ kontrol davranışı:

source: Left Control+Windows behavior:
fi: Vasen Ctrl+Windows -näppäinyhdistelmän toiminta:
ru: Поведение комбинации клавиш левый Control+Windos:
tr: Sol Kontrol+Windows davranışı:

source: Right Control+Windows behavior:
fi: Oikea Ctrl+Windows -näppäinyhdistelmän toiminta:
ru: Поведение комбинации клавиш правый Control+Windows:
tr: Sağ Kontrol+Windows davranışı:

source: Bulky word separators:
fi: Laajojen sanojen erottimet:
ru: Объёмные разделители слов:
tr: Hacimli sözcük ayırıcılar:

source: Custom word regular expression:
fi: Mukautettu sanan sääntölauseke:
ru: Пользовательское регулярное выражение для слов:
tr: Özel kelime düzenli ifadeler:

source: Optional Custom word end regular expression for word selection:
fi: Valinnainen mukautettu sanan lopun sääntölauseke sananvalintaa varten:
ru: Необязательное пользовательское регулярное выражение конца слова для выделения слова:
tr: İsteğe bağlı Sözcük seçimi için özel sözcük sonu düzenli ifadesi:

source: Word count for multiWord navigation:
fi: Sanamäärä monisananavigointia varten:
ru: Количество слов для многословной навигации:
tr: Çoklu Kelime Dolaşımı için kelime sayısı:

source: Volume of chime when crossing paragraph border
fi: Äänimerkin voimakkuus kappalerajaa ylitettäessä
ru: Громкость сигнала при пересечении границы абзаца
tr: Paragraf sınırını geçerken zil sesi

source: Disable WordNav in applications (comma-separated list)
fi: Poista Sananavigointi käytöstä sovelluksissa (pilkulla eroteltu luettelo)
ru: Отключить навигацию по словам в приложениях (список, разделённый запятыми)
tr: Uygulamalarda Kelime Dolaşımını devre dışı bırak (virgülle ayrılmış liste)

source: Disable in Google Docs
fi: Poista käytöstä Google Docsissa
ru: Отключить в Google Документах
tr: Google Dokümanlar'da devre dışı bırak

source: WordCount must be a positive integer greater than 2.
fi: Sanamäärän on oltava positiivinen kokonaisluku ja suurempi kuin 2.
ru: Количество слов должно быть целым положительным числом больше 2.
tr: Kelime Sayısı, 2'den büyük bir pozitif tam sayı olmalıdır.

source: Error: in order for word navigation to work correctly in VSCode, please install the following: 1. NVDA add-on IndentNav version v2.0 or later. 2. VSCode extension: Accessibility for NVDA IndentNav. Please consult WordNav Readme file for more information.
fi: Virhe: Jotta sananavigointi toimisi oikein VSCodessa, asenna seuraavat: 1. NVDA-lisäosa: Sisennysnavigointi, versio 2.0 tai uudempi. 2. VSCode-laajennus: Accessibility for NVDA IndentNav. Katso tarkemmat ohjeet Sananavigoinnin Lueminut-tiedostosta.
ru: Ошибка: для корректной работы навигации по словам в VSCode установите следующее: 1. Дополнение NVDA IndentNav версии v2.0 или более поздней. 2. Расширение VSCode: Accessibility for NVDA IndentNav. Для получения дополнительной информации обратитесь к файлу WordNav Readme.
tr: Hata: Kelime Dolaşımı eklentisinin VSCode'da düzgün çalışması için lütfen aşağıdakileri yükleyin: 1. NVDA eklentisi Girinti Dolaşımı sürüm v2.0 veya üzeri. 2. VSCode Eklentisi: NVDA Girinti Dolaşımı için erişilebilirlik. Daha fazla bilgi için lütfen Kelime Dolaşımı Benioku dosyasına bakın.

source: WordNav error
fi: Sananavigointivirhe
ru: Ошибка WordNav
tr: Kelime Dolaşımı Hata

source: Error: in order for word navigation to work correctly in VSCode, please install the following: 1. NVDA add-on IndentNav version v2.0 or later. 2. VSCode extension: Accessibility for NVDA IndentNav. IndentNav add-on has been detected; but VSCode extension does not appear to be running.. Please consultf WordNav Readme file for more information.
fi: Virhe: Jotta sananavigointi toimisi oikein VSCodessa, asenna seuraavat: 1. NVDA-lisäosa: Sisennysnavigointi, versio 2.0 tai uudempi. 2. VSCode-laajennus: Accessibility for NVDA IndentNav. Sisennysnavigointi-lisäosa on havaittu, mutta VSCode-laajennus ei vaikuta olevan käynnissä. Katso tarkempia ohjeita Sananavigoinnin Lueminut-tiedostosta.
ru: Ошибка: для корректной работы навигации по словам в VSCode установите следующее: 1. Дополнение NVDA IndentNav версии v2.0 или позже. 2. Расширение VSCode: Accessibility for NVDA IndentNav. Дополнение IndentNav обнаружено, но расширение VSCode, похоже, не запущено. Для получения дополнительной информации обратитесь к файлу WordNav Readme.
tr: Hata: Kelime Dolaşımı eklentisinin VSCode'da düzgün çalışması için lütfen aşağıdakileri yükleyin: 1. NVDA eklentisi Girinti Dolaşımı sürüm v2.0 veya üzeri. 2. VSCode uzantısı: NVDA Girinti Dolaşımı için erişilebilirlik. Girinti Dolaşımı eklentisi algılandı; ancak VSCode uzantısı çalışmıyor gibi görünüyor. Daha fazla bilgi için lütfen Kelime Dolaşımı Benioku dosyasına bakın.

source: WordNav move by word
fi: Sananavigointi siirtää tekstissä sanoittain
ru: WordNav навигация по словам
tr: Kelime Dolaşımı kelimeye göre hareket et

source: Improved navigate by word and word selection commands.
fi: Parannellut sananavigointi- ja sananvalintakomennot.
ru: Это дополнение улучшает навигацию по словам и команды выделения слов.
tr: Kelimeye göre dolaşma ve kelime seçme komutları geliştirildi.
