Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/tonysEnhancements/*/tonysEnhancements.xliff
Languages: ru, tr

source: nvda-tonys-enhancements
tr: nvda Tony'nin geliştirmeleri

source: This add-on contains a number of small improvements to NVDA screenreader, each of them too small to deserve a separate add-on.
ru: Это дополнение содержит ряд небольших улучшений для программы экранного доступа NVDA, каждое из которых слишком незначительно, чтобы заслуживать отдельного дополнения.
tr: Bu eklenti, NVDA ekran okuyucu için her biri ayrı bir eklentiyi hak etmeyecek kadar küçük olan bir dizi küçük iyileştirme içerir.

source: This add-on is compatible with NVDA version 2024.2 or later
ru: Это дополнение совместимо с NVDA версии 2024.2 или выше
tr: Bu eklenti NVDA 2024.2 ve sonraki sürümlerle uyumludur

source: Downloads
ru: Загрузки
tr: İndirin

source: Please install the latest version from NVDA add-on store.
ru: Пожалуйста, установите последнюю версию из магазина дополнений NVDA.
tr: Lütfen NVDA eklenti mağazasından en son sürümü yükleyin.

source: Enhanced table navigation commands
ru: Улучшенные команды навигации по таблицам
tr: Geliştirilmiş tablo gezinme komutları

source: NVDA+Control+digit - jump to 1st/2nd/3rd/... 10th column in the table.
ru: NVDA+Control+цифра - перейти к 1-ому/2-ому/3-ему столбцу/... 10-ому столбцу таблицы.
tr: NVDA+Control+rakamlar - tablodaki 1./2./3./... 10. sütuna atlayın.

source: NVDA+Alt+digit - jump to 1st/2nd/3rd/... 10th row in the table.
ru: NVDA+Alt+цифра - перейти на 1-ую/2-ую/3-ю/... 10-ую строку таблицы.
tr: NVDA+Alt+rakamlar - tabloda 1./2./3./... 10. sıraya atla.

source: Copying tables to clipboard
ru: Копирование таблиц в буфер обмена
tr: Tabloları panoya kopyalama

source: With the following shortcuts you can copy either the whole table or current row or current column in a formatted way, so that you can paste it as a table to rich text editors, such as Microsoft Word or WordPad.
ru: С помощью следующих сочетаний клавиш вы можете скопировать либо всю таблицу целиком, либо текущую строку или текущий столбец в форматированном виде, чтобы затем вставить её в виде таблицы в текстовые редакторы, такие как Microsoft Word или Worpad.
tr: Aşağıdaki kısayollarla, tablonun tamamını veya geçerli satırı veya geçerli sütunu biçimlendirilmiş bir şekilde kopyalayabilir, böylece Microsoft Word veya WordPad gibi zengin metin editörlerine tablo olarak yapıştırabilirsiniz.

source: - NVDA+Alt+T - shows popup menu with options to copy table or part of it.
ru: NVDA+Alt+T - показывает всплывающее меню с опциями для копирования таблицы или её части.
tr: NVDA+Alt+T - tabloyu veya bir kısmını kopyalamak için seçenekler içeren açılır menüyü gösterir.

source: There are also separate scripts for copying tables, rows, columns and cells, but they don't have keyboard shortcuts assigned by default, custom keyboard shortcuts cfor them can be assigned in InputGestures dialog of NVDA.
ru: Существуют также отдельные скрипты для копирования таблиц, строк, столбцов и ячеек, но для них не назначены сочетания клавиш по умолчанию, пользовательские сочетания клавиш для них можно назначить в диалоге жестов ввода NVDA.
tr: Tabloları, satırları, sütunları ve hücreleri kopyalamak için ayrı komutlar da vardır, ancak bunlara varsayılan olarak atanmış klavye kısayolları yoktur; bunlar için özel klavye kısayolları NVDA'nın Girdi Hareketleri iletişim kutusunda atanabilir.

source: Clipboard history
ru: История буфера обмена
tr: Pano Geçmişi

source: As of NVDA v2024.4 built-in Windows clipboard history feature works poorly with NVDA. As a drop-in replacement, this add-on provides a fully accessible clipboard history feature. It is bound to `Windows+V` by default, so it replaces the built-in feature.
ru: По состоянию на версию NVDA 2024.4 Встроенная функция истории буфера обмена Windows работает плохо с NVDA. В качестве замены, это дополнение обеспечивает полностью доступную функцию истории буфера обмена. По умолчанию она связана с `Windows+V`, поэтому заменяет встроенную функцию.
tr: NVDA v2024.4 sürümünden itibaren, Windows'un yerleşik panoya geçmişi özelliği NVDA ile düzgün çalışmamaktadır. Bu eklenti, yerleşik özelliğin yerine geçecek şekilde, tamamen erişilebilir bir panoya geçmişi özelliği sunar. Varsayılan olarak `Windows+V` tuşlarına atanmıştır, bu nedenle yerleşik özelliğin yerini alır.

source: Automatic language switching
ru: Автоматическое переключение языка
tr: Otomatik dil değiştirme

source: Allows to automatically switch the language of your synthesizer by character set. Refgular expression for every language can be configured in the preferences window for this add-on. Please make sure that your synthesizer supports all the languages you're interested in. Switching between two Latin-based languages or two languages whose character sets are similar is not supported at this time.
ru: Позволяет автоматически переключать язык вашего синтезатора с помощью набора символов. В окне настроек этого дополнения можно настроить выражение для каждого языка. Пожалуйста, убедитесь, что ваш синтезатор поддерживает все интересующие вас языки. Переключение между двумя языками, использующими латиницу, или двумя языками со схожими наборами символов в настоящее время не поддерживается.
tr: Sentezleyicinizin dilini karakter kümesine göre otomatik olarak değiştirmenize izin verir. Bu eklenti için tercihler penceresinde her dil için refgular ifade yapılandırılabilir. Lütfen sentezleyicinizin ilgilendiğiniz tüm dilleri desteklediğinden emin olun. Latin tabanlı iki dil veya karakter kümeleri benzer olan iki dil arasında geçiş şu anda desteklenmemektedir.

source: Quicksearch commands
ru: Команды быстрого поиска
tr: Hızlı arama komutları

source: As of version v1.18, QuickSearch commands have been moved to [IndentNav add-on](https://github.com/mltony/nvda-indent-nav).
ru: Начиная с версии v1.18, команды быстрого поиска были перенесены в [дополнение IndentNav](https://github.com/mltony/nvda-indent-nav).
tr: Sürüm 1.18'den itibaren, Hızlı Arama komutları [Girinti Dolaşımı eklentisine](https://github.com/mltony/nvda-indent-nav) taşınmıştır.

source: Suppress unwanted 'unselected' speech from NVDA
ru: Подавление нежелательной 'невыбранной' речи NVDA
tr: NVDA'dan gelen istenmeyen 'seçilmemiş' konuşmayı bastırın

source: Suppose you have some text selected in text editors. Then you press a key, such as Home, or UpArrow, that is supposed to take you to another part of the document. NVDA would announce 'unselected' and then speak the former selection, which can be inconvenient at times. This feature prevents NVDA from speaking formerly selected text in situations like this.
ru: Предположим, вы выделили какой-то текст в текстовом редакторе. Затем вы нажимаете клавишу, например Home, или стрелку вверх, которая должна привести вас к другой части документа. NVDA объявляет "не выделено", а затем произносит прежний выделенный текст, что иногда может быть неудобно. Эта функция не позволяет NVDA произносить ранее выделенный текст в подобных ситуациях.
tr: Metin editörlerinde bazı metinlerin seçili olduğunu varsayalım. Ardından, sizi belgenin başka bir bölümüne götürmesi gereken Ana Sayfa veya Yukarı Ok gibi bir tuşa basarsınız. NVDA 'seçilmedi' duyurusunu yapar ve ardından eski seçimi söyler, bu bazen rahatsız edici olabilir. Bu özellik, NVDA'nın bu gibi durumlarda önceden seçilen metni konuşmasını engeller.

source: Dynamic keystrokes
ru: Динамические нажатия клавиш
tr: Dinamik kısayollar

source: You can assign certain keystrokes to be dynamic. After issuing such a keystroke, NVDA will be checking currently focused window for any updates and if the line is updated, NVDA will speak it automatically. For example, certain keystrokes in text editors should be marked dynamic, such as Jump to bookmark, jump to another line and debugging keystrokes,such as step into/step over.
ru: Вы можете назначить определенные нажатия клавиш динамическими. После выполнения такого нажатия NVDA будет проверять текущее окно на наличие обновлений, и если строка будет обновлена, NVDA автоматически проговорит ее. Например, некоторые нажатия клавиш в текстовых редакторах должны быть помечены как динамические, такие как переход к закладке, переход к другой строке и нажатия клавиш для отладки, такие как шаг вперёд/шаг назад.
tr: Belirli tuş vuruşlarını dinamik olarak atayabilirsiniz. Böyle bir tuş vuruşu yaptıktan sonra, NVDA o anda odaklanılan pencerede herhangi bir güncelleme olup olmadığını kontrol edecek ve satır güncellenirse, NVDA bunu otomatik olarak söyleyecektir. Örneğin, metin düzenleyicilerdeki bazı tuş vuruşları dinamik olarak işaretlenmelidir, örneğin yer imine atla, başka bir satıra atla ve adım at/adım atma gibi hata ayıklama tuş vuruşları.

source: The format of dynamic keystrokes table is simple: every line contains a rule in the following format:
ru: Формат таблицы динамических нажатий клавиш прост: каждая строка содержит правило в следующем формате:
tr: Dinamik kısayol tuşları tablosunun formatı basittir: her satır aşağıdaki formatta bir kural içerir:

source: appName keystroke
tr: uygulamaAdı tuş vuruşu

source: where `appName` is the name of the application where this keystroke is marked dynamic (or `*` to b marked dynamic in all applications), and`keystroke` is a keystroke in NVDA format, for example, `control+alt+shift+pagedown`.
ru: где `appName` - это название приложения, в котором это нажатие клавиши помечено как динамическое (или `*` должна быть помечена как динамическая во всех приложениях), и `keystroke` - это комбинация клавиш в формате NVDA, например, `control+alt+shift+pagedown`.
tr: burada "Uygulama adı", bahsi geçen kısayol tuşunun dinamik olarak işaretlendiği (veya "*" ile tüm uygulamalarda dinamik olarak işaretlendiği) uygulamanın adıdır ve "klavye kısayolu", NVDA biçiminde bir kısayoludur, örneğin, "control+alt+shift" +sayfa aşağı`.

source: In order to figure out appName for your application, do this:
ru: Чтобы определить appName для вашего приложения, сделайте следующее:
tr: Uygulamanız için appName'i bulmak için şunu yapın:

source: Switch to your application.
ru: Переключитесь на свое приложение.
tr: Uygulamanıza geçin.

source: Open NVDA Python Console by pressing NVDA+Shift+Z.
ru: Откройте консоль Python NVDA , нажав NVDA+Shift+Z.
tr: NVDA+Shift+Z tuşlarına basarak NVDA Python Konsolunu açın.

source: Type `focus.appModule.appName` and hit enter.
ru: Введите `focus.appModule.appName` и нажмите enter.
tr: Focus.appModule.appName yazın ve enter tuşuna basın.

source: Press F6 to go to output pane and find appName value in the last line.
ru: Нажмите F6 для перехода на панель вывода и найдите значение AppName в последней строке.
tr: Çıktı bölmesine gitmek ve son satırda appName değerini bulmak için F6'ya basın.

source: Showing and hiding windows
ru: Отображение и скрытие окон
tr: Pencereleri gösterme ve gizleme

source: As of version v1.18 show/hide commands have been moved to [Task Switcher add-on](https://github.com/mltony/nvda-task-switcher).
ru: Начиная с версии v1.18, команды отображения/скрытия были перенесены в [дополнение переключателя задач](https://github.com/mltony/nvda-task-switcher).
tr: Sürüm 1.18'den itibaren göster/gizle komutları [Görev Değiştirici eklentisine](https://github.com/mltony/nvda-task-switcher) taşınmıştır.

source: Beep when NVDA is busy
ru: Подать звуковой сигнал, когда NVDA занята
tr: NVDA meşgulken bip sesi

source: Check this option for NVDA to provide audio feedback when NVDA is busy. NVDA being busy does not necessarily indicate a problem with NVDA, but rather this is a signal to the user that any NVDA commands will not be processed immediately.
ru: Установите этот флажок, чтобы NVDA обеспечивала звуковую обратную связь, когда NVDA занята. Занятость NVDA не обязательно указывает на проблему с NVDA, скорее это сигнал пользователю о том, что любые команды NVDA не будут обработаны немедленно.
tr: NVDA meşgul olduğunda NVDA'nın sesli geri bildirim sağlaması için bu seçeneği işaretleyin. NVDA'nın meşgul olması, mutlaka NVDA ile ilgili bir sorun olduğunu göstermez, bunun yerine, bu, kullanıcıya herhangi bir NVDA komutunun hemen çalıştıramayacağının bir işaretidir.

source: Application Volume adjustment
ru: Регулировка громкости приложения
tr: Uygulama Ses ayarı

source: This feature allows you to adjust the volume of NVDA and other applications independently. The following commands are available:
ru: Эта функция позволяет независимо отрегулировать громкость NVDA и других приложений. Доступны следующие команды:
tr: Bu özellik, NVDA'nın ve diğer uygulamaların ses seviyesini bağımsız olarak ayarlamanıza olanak tanır. Aşağıdaki komutlar kullanılabilir:

source: NVDA+Ctrl+PageUp: Increases the volume of NVDA.
ru: NVDA+Ctrl+PageUp: Увеличивает громкость NVDA.
tr: NVDA+Ctrl+Sayfa Yukarı: NVDA'nın sesini artırır.

source: NVDA+Ctrl+PageDown: Decreases the volume of NVDA.
ru: NVDA+Ctrl+PageDown: Уменьшает громкость NVDA.
tr: NVDA+Ctrl+Sayfa Aşağı: NVDA'nın sesini azaltır.

source: NVDA+Alt+PageUp: Increases the volume of other applications.
ru: NVDA+Alt+PageUp: Увеличивает громкость других приложений.
tr: NVDA+Alt+Sayfa Yukarı: Diğer uygulamaların ses seviyesini arttırır.

source: NVDA+Alt+PageDown: Decreases the volume of other applications.
ru: NVDA+Alt+PageDown: Уменьшает громкость других приложений.
tr: NVDA+Alt+Sayfa Aşağı: Diğer uygulamaların ses seviyesini azaltır.

source: Mute or unmute other applications: This command does not have a default gesture assigned. You can assign a custom one in NVDA's "Input Gestures" dialog.
ru: Выключить или включить звук других приложений: Эта команда не имеет по умолчанию назначенного жеста. Вы можете назначить пользовательский в диалоге жестов ввода NVDA.
tr: Diğer uygulamaların sesini kapat veya aç: Bu komuta atanmış varsayılan bir hareket yoktur. NVDA'nın "Girdi Hareketleri" iletişim kutusunda özel bir tane atayabilirsiniz.

source: Mute microphone
ru: Выключить микрофон
tr: Mikrofonu sessize al

source: This add-on provides a command for switching the microphone. There is no gesture assigned to this command by default, you can assign a gesture in NVDA's "Input Gestures" dialog if needed.
ru: Это дополнение предоставляет команду для переключения микрофона. По умолчанию для этой команды не назначен жест, при необходимости вы можете назначить жест в диалоге жестов ввода NVDA.
tr: Bu eklenti mikrofonu değiştirmek için bir komut sağlar. Varsayılan olarak bu komuta atanmış bir hareket yoktur, gerekirse NVDA'nın “Girdi Hareketleri” iletişim kutusunda bir hareket atayabilirsiniz.

source: Sound split
ru: Разделение звука
tr: Ses ayırıcı

source: This functionality has been merged into NVDA core and is available in NVDA v2024.2 or later.
ru: Эта функциональность была добавлена в ядро NVDA и доступна в NVDA версии 2024.2 или выше.
tr: Bu işlevsellik NVDA çekirdeğiyle birleştirilmiştir ve NVDA v2024.2 veya sonraki sürümlerinde mevcuttur.

source: Enhanced mouse functions
ru: Расширенные функции мыши
tr: Gelişmiş fare işlevleri

source: Alt+NumPadDivide: Point mouse cursor at current object and click it.
ru: Alt+Косая черта на цифровом блоке: Навести указатель мыши на текущий объект и щёлкнуть по нему.
tr: Alt+NumPad Bölü: Fare imlecini geçerli nesneye getirin ve tıklayın.

source: Alt+NumPadMultiply: Point mouse cursor at current object and right mouse button click on it.
ru: Alt+Звёздочка на цифровом блоке: Навести указатель мыши на текущий объект и щёлкнуть по нему правой кнопкой мыши.
tr: Alt+NumPad Çarpı: Fare imlecini geçerli nesneye getirin ve farenin sağ tuşuyla üzerine tıklayın.

source: Alt+NumPadDelete: Move mouse cursor out of the way to top left corner of the screen. This can be useful to prevent unwanted hover over windows in certain applications.
ru: Alt+Delete на цифровом блоке: Переместить указатель мыши в левый верхний угол экрана. Это может быть полезно для предотвращения нежелательного наведения указателя мыши на окна некоторых приложений.
tr: Alt+NumPad Sil: Fare imlecini ekranın sol üst köşesine doğru hareket ettirin. Bu, belirli uygulamalarda istenmeyen pencerelerin üzerine gelmeyi önlemek için yararlı olabilir.

source: The functionality for mouse wheel scrolling has been merged into NVDA core and is available in NVDA v2024.3 or later.
ru: Функциональность прокрутки колеса мыши была добавлена в ядро NVDA и доступна в NVDA версии 2024.3 или выше.
tr: Fare tekerleği kaydırma işlevi NVDA çekirdeğiyle birleştirilmiştir ve NVDA v2024.3 veya sonraki sürümlerinde mevcuttur.

source: Detecting insert mode in text editors
ru: Определение режима вставки в текстовых редакторах
tr: Metin editörlerinde ekleme modunu algılama

source: If this option is enabled, NVDA will beep when it detects insert mode in text editors.
ru: Если эта опция включена, NVDA подаст звуковой сигнал при обнаружении режима вставки в текстовых редакторах.
tr: Bu seçenek etkinleştirilirse, NVDA metin editörlerinde ekleme modunu algıladığında bip sesi çıkarır.

source: Blocking double insert keystroke
ru: Блокирование двойного нажатия клавиши insert
tr: Çift insert kısayolunu engelleme

source: In NVDA pressing Insert key twice in a row toggles insert mode in applications. However, sometimes it happens accidentally and it triggers insert mode. Since this is a special keystroke, it cannot be disabled in the settings. This add-on provides a way to block this keyboard shortcut. When double insert is blocked, insert mode can stil be toggled by pressing NVDA+F2 and then Insert.
ru: В NVDA двойное нажатие клавиши Insert переключает режим вставки в приложениях. Однако иногда это происходит случайно и запускает режим вставки. Поскольку это специальное нажатие клавиши, его нельзя отключить в настройках. Это дополнение позволяет заблокировать это сочетание клавиш. Если функция двойной вставки заблокирована, режим вставки по-прежнему можно переключить, нажав NVDA+F2, а затем Insert.
tr: NVDA'da İnsört tuşuna art arda iki kez basıldığında uygulamalarda ekleme modu arasında geçiş yapılır. Ancak bazen yanlışlıkla olur ve ekleme modunu tetikler. Bu özel bir tuş vuruşu olduğundan ayarlardan devre dışı bırakılamaz. Bu eklenti, bu klavye kısayolunu engellemenin bir yolunu sağlar. Çift İnsört engellendiğinde, ekleme modu NVDA+F2 ve ardından Ekle tuşlarına basılarak değiştirilebilir.

source: This option is disabled by default and must be enabled in the settings.
ru: Эта опция отключена по умолчанию и должна быть включена в настройках.
tr: Bu seçenek varsayılan olarak devre dışıdır ve ayarlarda etkinleştirilmelidir.

source: Blocking double Caps Lock keystroke
ru: Блокировка двойного нажатия Caps Lock
tr: Büyük Harf Kilidi için çift tuş vuruşunu engelleme

source: In NVDA, when Caps Lock is set as an NVDA key, pressing it twice in a row toggles between uppercase and lowercase input modes. However, this can sometimes cause unintentional switching between these modes. Since this key’s behavior is unique and cannot be disabled through settings, this add-on offers a method to block this specific keyboard shortcut. When the double Caps Lock key press is blocked, you can still switch between uppercase and lowercase input modes by pressing NVDA+F2 followed by the Caps Lock key.
ru: В NVDA, если в качестве клавиши NVDA установлена Caps Lock, при её двойном нажатии происходит переключение между режимами ввода верхнего и нижнего регистров. Однако иногда это может привести к непреднамеренному переключению между этими режимами. Поскольку поведение этой клавиши уникально и не может быть отключено с помощью настроек, это дополнение предлагает способ заблокировать это конкретное сочетание клавиш. Если двойное нажатие клавиши Caps Lock заблокировано, вы всё-равно можете переключаться между режимами ввода прописных и строчных букв, нажав NVDA+F2, а затем клавишу Caps Lock.
tr: NVDA'da, Büyük Harf Kilidi bir NVDA tuşu olarak ayarlandığında, bu tuşa art arda iki kez basıldığında büyük harf ve küçük harf giriş modları arasında geçiş yapılır. Ancak bu durum bazen bu modlar arasında istenmeden geçiş yapılmasına neden olabilir. Bu tuşun davranışı benzersiz olduğundan ve ayarlar aracılığıyla devre dışı bırakılamadığından, bu eklenti, bu özel klavye kısayolunu engellemeye yönelik bir yöntem sunar. Büyük Harf Kilidi tuşuna çift basılması engellendiğinde, NVDA+F2 tuşlarına ve ardından Büyük Harf Kilidi tuşuna basarak büyük ve küçük harf giriş modları arasında geçiş yapabilirsiniz.

source: This option is disabled by default and must be enabled in the settings.
ru: Эта опция отключена по умолчанию и должна быть включена в настройках.
tr: Bu seçenek varsayılan olarak devre dışıdır ve ayarlarda etkinleştirilmelidir.

source: System priority of NVDA process
ru: Системный приоритет процесса NVDA
tr: NVDA işleminin sistem önceliği

source: This allows to boost system priority of NVDA process, that might improve NVDA responsiveness, especially when CPU load is high.
ru: Это позволяет повысить системный приоритет процесса NVDA, что может улучшить скорость отклика NVDA, особенно при высокой нагрузке на процессор.
tr: Bu, özellikle CPU yükü yüksek olduğunda, NVDA yanıt verme hızını artırabilen NVDA işleminin sistem önceliğini artırmaya olanak tanır.

source: Fixing a bug when focus gets stuck in the taskbar when pressing Windows+Numbers
ru: Исправлена ошибка, из-за которой фокус зависал на панели задач при нажатии клавиш Windows+Цифры
tr: Windows+sayı tuşlarına basıldığında odak görev çubuğunda takılıp kaldığında oluşan bir hatayı düzeltme

source: This feature has been removed as of version v1.18. If you need a more reliable task switching functionality, please consider using [Task Switcher add-on](https://github.com/mltony/nvda-task-switcher).
ru: Начиная с версии v1.18, эта функция была удалена. Если вам нужна более надежная функция переключения задач, пожалуйста, рассмотрите возможность использования [дополнения для переключения задач](https://github.com/mltony/nvda-task-switcher).
tr: Bu özellik v1.18 sürümünden itibaren kaldırılmıştır. Daha güvenilir bir görev değiştirme işlevine ihtiyacınız varsa lütfen [Görev Değiştirici eklentisini](https://github.com/mltony/nvda-task-switcher) kullanmayı düşünün.
