Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/tonysEnhancements/*/tonysEnhancements.po
Languages: fi, ru, tr

source: Normal,Above normal,High,Realtime
fi: Normaali,Normaalia korkeampi,Korkea,Reaaliaikainen
ru: Нормальный, Выше нормы, Высокий, В реальном времени
tr: Normal,Normalin üzerinde,Yüksek,Gerçek Zamanlı

source: Failed to set process priority to %s.
fi: Prosessin prioriteetiksi ei voitu määrittää %s.
ru: Не удалось установить приоритет процесса на %s.
tr: İşlem önceliği %s olarak ayarlanamadı.

source: Tony's enhancement add-on encountered an error
fi: Tonyn laajennukset -lisäosa kohtasi virheen
ru: Дополнение улучшений от Тони столкнулось с ошибкой
tr: Tony'nin geliştirmeleri eklentisi bir hatayla karşılaştı

source: OK
ru: ОК
tr: Tamam

source: Cancel
fi: Peruuta
ru: Отмена
tr: İptal

source: Tony's enhancements settings
fi: Tonyn laajennukset
ru: Настройки улучшений от Тони
tr: Tony'nin geliştirmeleri ayarları

source: Detect insert mode in text documents and beep on every keystroke when insert mode is on.
fi: Tunnista tekstiasiakirjojen lisäystila ja piippaa jokaisella näppäinpainalluksella sen ollessa käytössä
ru: Определять режим вставки в текстовых документах и подавать звуковой сигнал при каждом нажатии клавиши.
tr: Metin belgelerinde ekleme (insert) modunu algıla ve ekleme modu açıkken her tuşa basıldığında bip sesi çıkar.

source: Block double insert
fi: Estä Insert-näppäimen tuplapainallukset
ru: Блокировать двойной insert
tr: İnsert tuşuna iki kez basılmasını engelle

source: Block double Caps Lock
fi: Estä Caps Lock -näppäimen tuplapainallukset
ru: Блокировать двойной Caps Lock
tr: Büyük harf kilidi tuşuna iki kez basılmasını engelle

source: Beep when NVDA is busy
fi: Piippaa, kun NVDA on varattu
ru: Воспроизводить звуковой сигнал, когда NVDA занята
tr: NVDA meşgulken bip sesi çıkar

source: Suppress saying of 'unselected'.
fi: Estä "ei valittu" -ilmoituksen sanominen
ru: Не говорить 'Невыделено'.
tr: 'seçili değil' denmesini engelle.

source: Edit dynamic keystrokes table - see add-on documentation for more information
fi: Muokkaa dynaamisten näppäinpainallusten taulukkoa (katso lisätietoja lisäosan dokumentaatiosta)
ru: Изменить таблицу динамических нажатий клавиш - дополнительную информацию см. в документации к дополнению
tr: Dinamik tuş girişleri tablosunu düzenle - daha fazla bilgi için eklenti belgelerine bakın

source: Enable automatic language switching based on character set
fi: Ota käyttöön merkistöön perustuva automaattinen kielenvaihto
ru: Разрешить автоматическое переключение языка на основе набора символов
tr: Karakter setine göre otomatik dil geçişini etkinleştir

source: Edit language map
fi: Muokkaa kielimäärityksiä
ru: Изменить языковую карту
tr: Dil haritasını düzenle

source: Suppress scroll lock mode announcements
fi: Estä scroll lock -tilan ilmoitukset
ru: Подавлять сообщения о режиме блокировки scroll lock
tr: Kaydırma kilidi modu duyurularını engelle

source: NVDA process system priority:
fi: NVDA-prosessin järjestelmäprioriteetti:
ru: Системный приоритет процесса NVDA:
tr: NVDA işlem sistem önceliği:

source: Enable applications volume adjustment (requires restart)
fi: Salli sovelluskohtainen äänenvoimakkuuden säätö (edellyttää uudelleenkäynnistystä)
ru: Разрешить регулировку громкости приложений (требуется перезапуск)
tr: Uygulamaların ses ayarını etkinleştir (yeniden başlatma gerektirir)

source: Error
fi: Virhe
ru: Ошибка
tr: Hata

source: Edit dynamic keystrokes table
fi: Muokkaa dynaamisten näppäinpainallusten taulukkoa
ru: Изменить таблицу динамических нажатий клавиш
tr: Dinamik tuş girişi tablosunu düzenle

source: Not in a table cell
fi: Ei taulukon solussa
ru: Вне ячейки таблицы
tr: Tablo hücresinde değil

source: Cannot find edge of table in this direction
fi: Taulukon reunaa ei löydy
ru: Не удаётся найти границу таблицы в этом направлении
tr: Bu yönde tablo kenarı bulunamadı

source: Cannot find {axis} with index {index} in this table
fi: Taulukosta ei löydy solua, jonka akseli on {axis} ja indeksi {index}
ru: Не удаётся найти {axis} с индексом {index} в этой таблице
tr: Bu tabloda {index} endeksli {axis} bulunamadı

source: Not in a table!
fi: Ei taulukossa
ru: Не в таблице!
tr: Tabloda değil!

source: Cell copied
fi: Solu kopioitu
ru: Ячейка скопирована
tr: Hücre kopyalandı

source: Row copied
fi: Rivi kopioitu
ru: Строка скопирована
tr: Satır kopyalandı

source: Partial row copied
fi: Osittainen rivi kopioitu
ru: Часть строки скопирована
tr: Satırın bir kısmı kopyalandı

source: Column copied
fi: Sarake kopioitu
ru: Столбец скопирован
tr: Sütun kopyalandı

source: Partial column copied
fi: Osittainen sarake kopioitu
ru: Часть столбца скопирована
tr: Sütunun bir kısmı kopyalandı

source: Table copied
fi: Taulukko kopioitu
ru: Таблица скопирована
tr: Tablo kopyalandı

source: Copy ce&ll
fi: Kopioi so&lu
ru: Копировать &ячейку
tr: &Hücreyi kopyala

source: Copy &column
fi: Kopioi sara&ke
ru: &Копировать столбец
tr: S&ütunu kopyala

source: Copy column from current cell &down
fi: Kopioi sarake nykyisestä solusta a&laspäin
ru: Копировать столбец &вниз от текущей ячейки
tr: Sütunu geçerli hücre&den aşağıya doğru kopyala

source: Copy &row
fi: Kopioi r&ivi
ru: Копировать &строку
tr: &Satırı kopyala

source: Copy row from current cell to the ri&ght
fi: Kopioi rivi nykyisestä solusta &oikealle
ru: &Копировать строку вправо от текущей ячейки
tr: Satırı &geçerli hücreden sağa doğru kopyalar

source: Copy &table
fi: Kopioi ta&ulukko
ru: Копировать &таблицу
tr: &Tabloyu kopyala

source: focusable object
fi: kohdistettava objekti
ru: фокусируемый объект
tr: odaklanabilir nesne

source: current review character
fi: nykyinen tarkasteltava merkki
ru: текущий просматриваемый символ
tr: mevcut inceleme karakteri

source: navigator object
fi: navigointiobjekti
ru: объект навигатора
tr: nesne sunucusu

source: repeat
fi: toista
ru: повторить
tr: tekrar

source: Clipboard history
fi: Leikepöydän historia
ru: История буфера обмена
tr: Pano Geçmişi

source: Entries
fi: Kohteet
ru: Записи
tr: Girişler

source: &Paste
fi: &Liitä
ru: В&ставить
tr: Ya&pıştır

source: Tony's Enhancements
fi: Tonyn laajennukset
ru: Улучшения от Тони
tr: Tony'nin Geliştirmeleri

source: Move to the %d-th column in table
fi: Siirry taulukossa sarakkeeseen %d
ru: Переход к %d-му столбцу в таблице
tr: Tablodaki %d numaralı sütuna git

source: Move to the %d-th row in table
fi: Siirry taulukossa riville %d
ru: Переход к %d-й строке в таблице
tr: Tablodaki %d numaralı satıra git

source: Show popup menu with copy table to clipboard commands.
fi: Näytä ponnahdusvalikko, jossa on taulukon leikepöydälle kopioivia komentoja.
ru: Показать всплывающее меню с командами копирования таблицы в буфер обмена.
tr: Tabloyu panoya kopyalamakla ilgili komutları içeren menüyü göster.

source: Copy table cell to clipboard.
fi: Kopioi taulukon solu leikepöydälle
ru: Скопировать ячейку таблицы в буфер обмена.
tr: Tablo hücresini panoya kopyala.

source: Copy table column to clipboard.
fi: Kopioi taulukon sarake leikepöydälle
ru: Скопировать столбец таблицы в буфер обмена.
tr: Tablo sütununu panoya kopyala.

source: Copy table row to clipboard.
fi: Kopioi taulukon rivi leikepöydälle
ru: Скопировать строку таблицы в буфер обмена.
tr: Tablo satırını panoya kopyala.

source: Copy the whole table to clipboard.
fi: Kopioi koko taulukko leikepöydälle
ru: Скопировать всю таблицу в буфер обмена.
tr: Tüm tabloyu panoya kopyala.

source: Toggle microphone mute.
fi: Vaihda mikrofonin mykistyksen tilaa
ru: Переключает микрофон.
tr: Mikrofonu kapatıp aç.

source: Default microphone not found.
fi: Oletusmikrofonia ei löydy
ru: Микрофон по умолчанию не найден.
tr: Varsayılan mikrofon bulunamadı.

source: Muted microphone
fi: Mikrofoni mykistetty
ru: Микрофон выключен
tr: Mikrofon kapalı

source: Unmuted microphone
fi: Mikrofonin mykistys poistettu
ru: Микрофон включён
tr: Mikrofon açık

source: Left click on current object.
fi: Napsauta hiiren vasenta painiketta nykyisessä objektissa
ru: Левый щелчок на текущем объекте.
tr: Mevcut nesneye sol tıkla.

source: Left click on {kind}
fi: Vasen napsautus kohteessa {kind}
ru: Левый щелчок на {kind}
tr: {kind} üzerine sol tık

source: Right click on current object.
fi: Napsauta hiiren oikeaa painiketta nykyisessä objektissa
ru: Правый щелчок на текущем объекте.
tr: Mevcut nesneye sağ tıkla.

source: Move mouse pointer to top left corner.
fi: Siirrä hiiren osoitin vasempaan yläkulmaan
ru: Переместить указатель мыши в левый верхний угол.
tr: Fare imlecini sol üst köşeye taşı.

source: Mouse pointer moved to top left corner.
fi: Hiiren osoitin siirretty vasempaan yläkulmaan
ru: Указатель мыши перемещён в левый верхний угол.
tr: Fare imleci sol üst köşeye taşındı

source: Show clipboard history
fi: Näytä leikepöydän historia
ru: Показать историю буфера обмена
tr: Pano Geçmişini Göster

source: Increases the volume of other applications
fi: Lisää muiden sovellusten äänenvoimakkuutta
ru: Увеличивает громкость других приложений
tr: Diğer uygulamaların ses düzeyini arttır

source: Applications volume feature of Tony's enhancements add-on is disabled. Please enable it in settings first.
fi: Tonyn laajennukset -lisäosan sovelluskohtainen äänenvoimakkuuden säätö ei ole käytössä. Ota se ensin käyttöön asetuksista.
ru: Функция громкости дополнения улучшений от Тони отключена. Сначала разрешите её в настройках.
tr: Tony'nin geliştirmeleri eklentisinin uygulama ses düzeyi özelliği devre dışı bırakıldı. Lütfen önce ayarlarda etkinleştirin.

source: Decreases the volume of other applications
fi: Vähentää muiden sovellusten äänenvoimakkuutta
ru: Уменьшает громкость других приложений
tr: Diğer uygulamaların ses düzeyini azalt

source: Mutes or unmutes other applications
fi: Mykistää muut sovellukset tai poistaa niiden mykistyksen
ru: Отключает или включает звук других приложений
tr: Diğer uygulamaların sesini aç/kapat

source: Increases the volume of NVDA
fi: Lisää NVDA:n äänenvoimakkuutta
ru: Увеличивает громкость NVDA
tr: NVDA ses düzeyini arttır

source: {} percent NVDA volume
fi: {} prosenttia NVDA:n äänenvoimakkuus
ru: {} процентов громкости NVDA
tr: NVDA ses düzeyi yüzde {}

source: Decreases the volume of NVDA
fi: Vähentää NVDA:n äänenvoimakkuutta
ru: Уменьшает громкость NVDA
tr: NVDA ses düzeyini azalt

source: Tony's enhancements
fi: Tonyn laajennukset
ru: Улучшения от Тони
tr: Tony'nin Geliştirmeleri

source: Various NVDA enhancements.
fi: Useita NVDA:n laajennuksia
ru: Различные усовершенствования для NVDA.
tr: Çeşitli NVDA geliştirmeleri.
