Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/MSEdgeDiscardAnnouncements/*/MSEdgeDiscardAnnouncements.xliff
Languages: ru

source: MSEdgeDiscardAnnouncements #
ru: Подавление объявлений в MS Edge #

source: Author: Beqa Gozalishvili
ru: Автор: Beqa Gozalishvili

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]

source: This addon is used to suppress some of annoying notifications generated by Microsof edge browser.
ru: Это дополнение используется для подавления некоторых раздражающих уведомлений, генерируемых обозревателем Microsoft Edge.

source: All notifications can be configured in corresponding addon category of NVDA settings.
ru: Все уведомления можно настроить в соответствующей категории дополнения настроек NVDA.

source: Changes for 0.8 ##
ru: Изменения в 0.8 ##

source: Replaced checkboxes with CheckListbox.
ru: Флажки заменены на список с флажками.

source: Added a donation module.
ru: Добавлен модуль пожертвования.

source: It is now possible to suppress suggestion list while typing in the address bar.
ru: Теперь можно подавить список предложений при вводе в адресной строке.

source: NVDA 2023.1 compatibility.
ru: Совместимость с NVDA 2023.1.

source: Changes for 0.7 ##
ru: Изменения в 0.7 ##

source: Added some more notification IDs;
ru: Добавлено ещё несколько идентификаторов уведомлений;

source: Fixed a case, when there was a flud of download notifications when more than one window of Microsoft edge was opened;
ru: Исправлен случай, когда было открыто более одного уведомления загрузки при нескольких открытых окнах в Microsoft edge;

source: Updated NVDA compatibility flag.
ru: Обновлён флаг совместимости NVDA.

source: Changes for 0.6 ##
ru: Изменения в 0.6 ##

source: NVDA 2022.1 compatibility release.
ru: Реализована совместимость с NVDA 2022.1.

source: Changes for 0.5 ##
ru: Изменения в 0.5 ##

source: Added documentation and translation support.
ru: Добавлена ​​документация и поддержка перевода.

source: Changes for 0.4 ##
ru: Изменения в 0.4 ##

source: Added more notification IDs to be suppressed.
ru: Добавлено больше идентификаторов уведомлений для подавления.

source: Changes for 0.3 ##
ru: Изменения в 0.3 ##

source: Removed global plugin and moved GUI of configuration in app module itself.
ru: Убран глобальный плагин, и графический интерфейс конфигурации перемещён непосредственно в модуль приложения.

source: Changes for 0.2 ##
ru: Изменения в 0.2 ##

source: Added GUI to configure notifications which should be enabled/disabled.
ru: Добавлен графический интерфейс для настройки уведомлений, которые должны быть включены/отключены.

source: Added more notification IDs to be suppressed.
ru: Добавлено больше идентификаторов уведомлений для подавления.

source: Code cleanup.
ru: Очищен код.

source: Changes for 0.1 ##
ru: Изменения в 0.1 ##

source: Initial version.
ru: Первоначальная версия.
