Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/MSEdgeDiscardAnnouncements/*/MSEdgeDiscardAnnouncements.po
Languages: fi, ru, tr

source: &Configure MSEdge notifications
fi: &Määritä MS Edgen ilmoitusasetukset
ru: &Настройка уведомлений MSEdge
tr: &MSEdge bildirimlerini yapılandır

source: Donate via Paypal
fi: Lahjoita PayPalin kautta
ru: Пожертвовать через Paypal
tr: Paypal ile bağış yap

source: Donate via Yoomoney
fi: Lahjoita Yoomoneyn kautta
ru: Пожертвовать через Yoomoney
tr: Yoomoney ile bağış yap

source: Request for contributions to {name}
fi: Osallistumispyyntö {name}-lisäosan kehittämiseen
ru: Просьба поддержать {name}
tr: {name} için katkı isteği

source: {name} is a free add-on for NVDA. You can make a donation to its author to support further development of this and other free projects. Do you want to donate now? Choose one of the available payment methods. You will be redirected to the corresponding website to complete a donation
fi: {name} on ilmainen NVDA-lisäosa. Voit tehdä lahjoituksen kehittäjälle tukeaksesi tämän sekä muiden ilmaisten projektien jatkokehitystä. Haluatko lahjoittaa nyt? Valitse jokin käytettävissä olevista maksutavoista. Tämän jälkeen sinut uudelleenohjataan asianmukaiselle sivustolle lahjoituksen suorittamista varten.
ru: {name} — бесплатное дополнение для NVDA. Вы можете сделать пожертвование его автору для поддержки дальнейшего развития этого и других бесплатных проектов. Вы хотите сделать пожертвование сейчас? Выберите один из доступных способов оплаты. Вы будете перенаправлены на соответствующий сайт для совершения пожертвования
tr: {name}, NVDA için ücretsiz bir eklentidir. Bu ve diğer ücretsiz projelerin daha da geliştirilmesini desteklemek için geliştiricisine bağışta bulunabilirsiniz. Şimdi bağış yapmak ister misiniz? Mevcut ödeme yöntemlerinden birini seçin. Bir bağışı tamamlamak için ilgili web sitesine yönlendirileceksiniz

source: Announce loading of pages
fi: Ilmoita sivujen lataamisesta
ru: Объявлять загрузку страниц
tr: Sayfaların yüklendiğini duyur

source: Announce page refresh
fi: Ilmoita sivun päivittämisestä
ru: Объявлять обновление страницы
tr: Sayfa yenilendiğinde duyur

source: Announce closing of tab
fi: Ilmoita välilehden sulkemisesta
ru: Объявлять о закрытии вкладки
tr: Sekme kapanırken duyur

source: Announce Opening of new tab
fi: Ilmoita uuden välilehden avaamisesta
ru: Объявлять об открытии новой вкладки
tr: Yeni sekme açıldığında duyur

source: Announce window opening
fi: Ilmoita ikkunan avaamisesta
ru: Объявлять об открытии окон
tr: Yeni Pencere açıldığında duyur

source: Announce opening of inprivate window
fi: Ilmoita yksityisen ikkunan avaamisesta
ru: Объявлять открытие приватного окна
tr: Özel pencere açıldığında duyur

source: Announce starting file download
fi: Ilmoita tiedostolatauksen aloittamisesta
ru: Объявлять о начале загрузки файла
tr: Dosya indirme işlemi başladığında duyur

source: Announce download completion
fi: Ilmoita latauksen valmistumisesta
ru: Объявлять о завершении загрузки файла
tr: İndirme tamamlandığında duyur

source: Announce navigating back
fi: Ilmoita edelliselle sivulle siirtymisestä
ru: Объявлять о переходе назад в истории
tr: Geri gidildiğinde duyur

source: Announce navigating forward
fi: Ilmoita seuraavalle sivulle siirtymisestä
ru: Объявлять о переходе вперёд в истории
tr: İleri gidildiğinde duyur

source: Announce if there is no previous page to navigate
fi: Ilmoita siirryttäessä, mikäli edellistä sivua ei ole
ru: Объявить, если нет предыдущей страницы для навигации
tr: Gidilecek önceki sayfa yoksa duyur

source: Announce if there is no next page to navigate
fi: Ilmoita siirryttäessä, mikäli seuraavaa sivua ei ole
ru: Объявить, если нет следующей страницы для навигации
tr: Gidilecek sonraki sayfa yoksa duyur

source: Announce removing toolbar buttons
fi: Ilmoita työkalupalkin painikkeiden poistamisesta
ru: Объявлять об удалении кнопок панели инструментов
tr: Araç çubuğu düğmeleri kaldırıldığında duyur

source: Announce of search mode
fi: Ilmoita hakutilasta
ru: Объявление режима поиска
tr: Arama modunu duyur

source: Announce availability of search mode
fi: Ilmoita, onko hakutila käytettävissä
ru: Объявлять о доступности режима поиска
tr: Arama modunun kullanılabilirliğini duyur

source: Announce appearing of notifications
fi: Ilmoita ilmoitusten ilmestymisestä
ru: Объявлять появление уведомлений
tr: Bildirimler göründüğünde duyur

source: Announce indeterminate progress state of current download
fi: Ilmoita nykyisen latauksen epämääräisestä edistymistilasta
ru: Объявлять о неопределенном состоянии текущей загрузки
tr: Mevcut indirme durumu belirsiz olsa da duyur

source: Announce autofil suggestions
fi: Ilmoita automaattisen täytön ehdotuksista
ru: Объявлять предложения по автозаполнению
tr: Otomatik doldurma önerilerini duyur

source: Announce filling of autofill suggestions
fi: Ilmoita automaattisen täytön ehdotusten täyttämisestä
ru: Объявлять заполнение предложений автозаполнения
tr: Otomatik doldurma önerilerinin doldurulduğunu duyur

source: Announce Closing popups like hiding suggestions of autofill
fi: Ilmoita ponnahdusikkunoiden sulkemisesta (esim. automaattisen täytön ehdotusten piilottaminen)
ru: Объявлять о закрытии всплывающих окон, например, о скрытии предложений автозаполнения
tr: Otomatik doldurma önerilerinin gizlenmesi gibi açılır pencerelerin kapatıldığını duyur

source: Announce hiding autofill suggestions
fi: Ilmoita automaattisen täytön ehdotusten piilottamisesta
ru: Объявлять о скрытии предложений автозаполнения
tr: Otomatik doldurma önerilerinin gizlendiğini duyur

source: Announce microsoft edge update availability
fi: Ilmoita MS Edgen päivityksen saatavuudesta
ru: Объявлять о доступности обновления Microsoft Edge
tr: Microsoft Edge güncellemesinin kullanılabilirliğini duyur

source: Announce zoom changes
fi: Ilmoita zoomauksen muutoksista
ru: Объявлять изменения масштаба
tr: Yakınlaştırma değişikliklerini duyur

source: Show suggestions while typing in addressbar
fi: Näytä ehdotukset osoitepalkkiin kirjoitettaessa
ru: Показывать предложения ввода в адресной строке
tr: Adres çubuğuna yazarken önerileri göster

source: Microsoft Edge discard announcements
fi: Microsoft Edgen ilmoitusten hylkääminen
ru: Подавление объявлений в Microsoft Edge
tr: Microsoft Edge duyurularını devredışı bırak

source: Discards UIA announcements in Microsoft Edge such as page loading and refreshing, opening and closing tabs and windows.
fi: Hylkää Microsoft Edgen UIA-ilmoitukset, kuten sivun lataaminen ja päivittäminen sekä välilehtien ja ikkunoiden avaaminen ja sulkeminen.
ru: Подавляет объявления UIA в Microsoft Edge, такие как загрузка и обновление страниц, открытие и закрытие вкладок и окон.
tr: Microsoft Edge'de sayfa yükleme / yenileme, sekmeleri ve pencereleri açma / kapatma gibi UIA duyurularını devredışı bırakır.
