Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/BMI/*/BMI.xliff
Languages: pt_pt

source: (BMI) Calculation of the body mass index
pt_pt: (IMC) Cálculo do índice de massa corporal

source: Author: Edilberto Fonseca <edilberto.fonseca@outlook.com>.
pt_pt: Autor: Edilberto Fonseca <edilberto.fonseca@outlook.com>.

source: Creation date: 08/11/2022.
pt_pt: Data de criação: 08/11/2022.

source: License: [gpl 2.0][1]
pt_pt: Licença: [gpl 2.0][1]

source: Review date: 03/18/2024.
pt_pt: Data de revisão: 18/03/2024.

source: Introduction
pt_pt: Introdução

source: Welcome to the BMI Add-on! This is a plug-in designed to help determine the Body Mass Index (BMI), which is an international measurement used to assess a person's body fat level. With this Addon you can easily calculate your BMI by providing your height and weight. In addition, we also offer a ranking of the results, so that you can better understand your situation and take the necessary steps to achieve and maintain good health.
pt_pt: Bem-vindo ao suplemento IMC! Este é um plug-in concebido para ajudar a determinar o Índice de Massa Corporal (IMC), que é uma medida internacional utilizada para avaliar o nível de gordura corporal de uma pessoa. Com este complemento, pode calcular facilmente o seu IMC fornecendo a sua altura e peso. Além disso, também oferecemos uma classificação dos resultados, para que possa compreender melhor a sua situação e tomar as medidas necessárias para alcançar e manter uma boa saúde.

source: Note: For a proper interpretation of BMI, it is recommended to consider other factors such as body composition, fat distribution, age, gender and general health of the person. It is always recommended to consult a health professional, such as a doctor or nutritionist, for a more accurate assessment and to obtain proper guidance on health and weight.
pt_pt: Nota: Para uma interpretação correta do IMC, recomenda-se que sejam considerados outros factores, como a composição corporal, a distribuição da gordura, a idade, o sexo e o estado geral de saúde da pessoa. Recomenda-se sempre a consulta de um profissional de saúde, como um médico ou nutricionista, para uma avaliação mais exacta e para obter orientações adequadas sobre saúde e peso.

source: Installation
pt_pt: Instalação

source: Here are the step-by-step instructions for installing the BMI Add-on in NVDA:
pt_pt: Eis as instruções passo a passo para instalar a extensão IMC no NVDA:

source: Download the Add-on installation file from the Add-on Store or [BMI][1] official page.
pt_pt: Transfira o ficheiro de instalação do complemento a partir da Loja de complementos ou da página oficial do [BMI][1].

source: Note: If the add-on is downloaded from the store, installation happens automatically. Otherwise, follow the guidelines below.
pt_pt: Nota: Se o suplemento for descarregado da loja, a instalação ocorre automaticamente. Caso contrário, siga as diretrizes abaixo.

source: Press enter on the add-on you downloaded.
pt_pt: Prima enter no add-on que descarregou.

source: Follow the on-screen instructions to install the Add-on.
pt_pt: Siga as instruções no ecrã para instalar o Add-on.

source: Restart NVDA.
pt_pt: Reinicie o NVDA.

source: Press "NVDA + N" to open the "T" tools menu and verify that the IMC Add-on is listed in the tools list.
pt_pt: Prima "NVDA + N" para abrir o menu de ferramentas "T" e verifique se o suplemento IMC está listado na lista de ferramentas.

source: You are now ready to use the BMI Add-on and calculate your Body Mass Index directly from NVDA. Be sure to check out the Add-on's documentation for additional information on how to use it and customize it to your needs.
pt_pt: Está agora pronto para utilizar o suplemento IMC e calcular o seu índice de massa corporal diretamente a partir do NVDA. Não se esqueça de consultar a documentação do suplemento para obter informações adicionais sobre como utilizá-lo e personalizá-lo de acordo com as suas necessidades.

source: Settings
pt_pt: Configurações

source: There are no instructions on how to configure the add-on, its use is simple.
pt_pt: Não existem instruções sobre como configurar o add-on, a sua utilização é simples.

source: Usage
pt_pt: Utilização

source: Press "alt+windows+i", or use NVDA's menu (NVDA+N), Tools, Calculate Your BMI, to invoke the add-on. A dialog with two fields will appear:
pt_pt: Prima "alt+windows+i", ou utilize o menu do NVDA (NVDA+N), Ferramentas, Calcular o seu IMC, para invocar o suplemento. Aparecerá uma caixa de diálogo com dois campos:

source: Height, where the height in centimeters "CM" must be selected or entered.
pt_pt: Altura, onde a altura em centímetros "CM" deve ser selecionada ou introduzida.

source: Weight, where the weight in kilograms "KG" must be selected or entered.
pt_pt: Peso, onde o peso em quilogramas "KG" deve ser selecionado ou introduzido.

source: After filling in all the fields, just press the calculate button, using the "alt+A" shortcut, or press enter on the calculate button.
pt_pt: Depois de preencher todos os campos, basta premir o botão de cálculo, utilizando o atalho "alt+A", ou premir enter no botão de cálculo.

source: NVDA will verbalize a dialog with the result of the calculation. At the end of the dialog, the cursor will be positioned on the OK button. Pressing enter, the cursor will be positioned in the height field.
pt_pt: O NVDA verbalizará uma caixa de diálogo com o resultado do cálculo. No final da caixa de diálogo, o cursor será posicionado no botão OK. Premindo enter, o cursor será posicionado no campo da altura.

source: Hotkeys
pt_pt: Teclas de atalho

source: main dialog
pt_pt: Diálogo principal

source: “alt+A”: Performs the calculation.
pt_pt: "alt+A": Efectua o cálculo.

source: “alt+L: Clears the fields and positions the cursor in the height field.
pt_pt: "Alt+L: Limpa os campos e posiciona o cursor no campo da altura.

source: “alt+C”: Closes the dialog box, escape can also be used.
pt_pt: "alt+C": Fecha a caixa de diálogo, também pode ser utilizado o escape.

source: License
pt_pt: Licença

source: This add-on is covered by the GNU General Public License [GPL v2][1].
pt_pt: Este add-on está coberto pela Licença Pública Geral GNU [GPL v2][1].

source: Thanks
pt_pt: Obrigado

source: Special thanks to the contributors Rui Fonte, Noelia e Dalen who have helped make this version possible.
pt_pt: Um agradecimento especial aos colaboradores Rui Fonte, Noelia e Dalen que ajudaram a tornar esta versão possível.
