Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/enhancedAnnotations/*/enhancedAnnotations.xliff
Languages: tr

source: Enhanced Annotations #
tr: Gelişmiş Ek Açıklamalar

source: Authors: George Kerscher, Noelia Ruiz Martínez
tr: Yazarlar: George Kerscher, Noelia Ruiz Martínez

source: In the DAISY Consortium, best practices are developed for publishers and authors for providing extended (long) descriptions.
tr: DAISY Konsorsiyumu'nda, yayıncılar ve yazarlar için genişletilmiş (uzun) açıklamalar sağlamak için en iyi uygulamalar geliştirilmiştir.

source: The best practices use the HTML details element that follows the image, or a link to another file that contains the extended description.
tr: En iyi uygulamalar, görüntüyü izleyen HTML ayrıntıları öğesini veya genişletilmiş açıklamayı içeren başka bir dosyanın bağlantısını kullanır.

source: In both options, the user would need to move to the details or the link and activate it.
tr: Her iki seçenekte de kullanıcının ayrıntılara veya bağlantıya gitmesi ve etkinleştirmesi gerekir.

source: Having a keystroke to put focus on the details or the link is ideal.
tr: Ayrıntılara veya bağlantıya odaklanmak için bir tuşa basmak idealdir.

source: Our best practices recommend that the details or the link immediately follows the image, and if the link is followed, a back link to the exact location must be provided. This makes it certain that the user will not get lost.
tr: En iyi uygulamalarımız, ayrıntıların veya bağlantının resmin hemen ardından gelmesini ve bağlantı takip edilirse tam konuma bir geri bağlantı sağlanmasını önerir. Bu, kullanıcının kaybolmayacağını garanti eder.

source: However it is probable that authors in the wild will place the extended (long) description almost anywhere. In these cases, the user would want to return to the image and hence the need for a way to return to the original image.
tr: Ancak vahşi doğada yazarların genişletilmiş (uzun) açıklamayı neredeyse her yere yerleştirmesi muhtemeldir. Bu durumlarda, kullanıcı resme geri dönmek isteyecektir ve dolayısıyla orijinal resme geri dönmek için bir yola ihtiyaç duyulacaktır.

source: This add-on provides both features, in support of this [issue opened in NVDA's repository][1].
tr: Bu eklenti, bu [NVDA deposunda açılan sorun][1] için her iki özelliği de sağlar.

source: Commands ##
tr: Komutlar ##

source: NVDA+alt+d: moves the cursor to the element identified with aria-details.
tr: NVDA+alt+d: imleci aria-details ile tanımlanan öğeye taşır.

source: NVDA+alt+shift+d: moves the cursor to the original element, for example, an image with furter details like a long description. If NVDA+alt+d has been pressed several times to move to related annotations, it'll be possible to go back to each origin.
tr: NVDA+alt+shift+d: imleci orijinal öğeye, örneğin uzun bir açıklama gibi daha ayrıntılı ayrıntılara sahip bir görüntüye taşır. İlgili açıklamalara gitmek için NVDA+alt+d'ye birkaç kez basıldıysa, her bir kaynağa geri dönmek mümkün olacaktır.

source: The above commands can be modified from NVDA's menu, Preferences submenu, Input gestures dialog, Browse mode category.
tr: Yukarıdaki komutlar NVDA menüsü, Tercihler alt menüsü, Girdi hareketleri iletişim kutusundan, Tarama modu kategorisinde değiştirilebilir.

source: Changes for 2.0 ##
tr: 2.0 için değişiklikler ##

source: Added ability to move back through multiple annotation origins.
tr: Birden fazla ek açıklama kaynağı arasında geri gitme yeteneği eklendi.

source: Requires NVDA 2023.1 or later.
tr: NVDA 2023.1 veya sonraki sürümünü gerektirir.
