Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/sayProductNameAndVersion/*/sayProductNameAndVersion.xliff
Languages: ru

source: Author: Luke Davis <XLTechie@newanswertech.com>, Patrick ZAJDA <patrick@zajda.fr>
ru: Автор: Luke Davis <XLTechie@newanswertech.com>, Patrick ZAJDA <patrick@zajda.fr>

source: NVDA compatibility: 2017.3 through 2025.X
ru: Совместимость с NVDA: от 2017.3 до 2025.X

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]

source: This [NVDA](https://nvaccess.org/) add-on adds a shortcut to announce product name and version of the foreground application, or copies this information to the clipboard.
ru: Это дополнение для [NVDA](https://nvaccess.org/) добавляет горячую клавишу для объявления названия и версии продукта приложения переднего плана или копирует эту информацию в буфер обмена.

source: English shortcut: `NVDA+shift+v`
ru: Горячая клавиша в английской раскладке: `NVDA+shift+v`

source: Press it twice to copy product name and version to the clipboard.
ru: Нажмите ее дважды, чтобы скопировать название продукта и версию в буфер обмена.

source: Press it three times to copy only the version to the clipboard.
ru: Нажмите её трижды, чтобы скопировать в буфер обмена только версию.

source: This shortcut may be remapped in the Tools category of NVDA's Input Gestures.
ru: Эта горячая клавиша может быть переназначена в категории сервиса жестов ввода NVDA.

source: If you like this add-on and are willing to help others decide whether it is useful, please leave a [review][3].
ru: Если вам нравится это дополнение и вы готовы помочь другим решить, полезно ли оно, пожалуйста, оставьте [отзыв][3].

source: For change history, please read the [changelog][2].
ru: Для получения информации об истории изменений, пожалуйста, ознакомьтесь со [списком изменений][2].

source: Tips
ru: Советы

source: To find out the Windows version with this add-on, you can focus on any Windows component (such as desktop, the start menu, the run dialog, etc.), and press the shortcut key. Note, that this does not give you the release version name, such as "23H3". Instead it gives you something closer to the build version, as you would get from the second line of the "`winver`" command.
ru: Чтобы узнать версию Windows с этим дополнением, вы можете выбрать любой компонент Windows (например, рабочий стол, меню "Пуск", диалог "Выполнить" и т.д.) и нажать комбинацию клавиш. Обратите внимание, что это не даст вам название версии выпуска, например "23H3". Вместо этого вам предоставится что-то более близкое к версии сборки, как вы могли бы получить из второй строки команды "`winver`".

source: To get the NVDA version, open any NVDA dialog or menu, and press this add-on's shortcut key. For example, press `NVDA+n` to open the NVDA menu, then press `NVDA+shift+v`, then press `escape` to leave the menu.
ru: Чтобы получить версию NVDA, откройте любой диалог или меню NVDA и нажмите комбинацию клавиш этого дополнения. Например, нажмите `NVDA+n`, чтобы открыть меню NVDA, затем нажмите `NVDA+shift+v`, затем нажмите `escape`, чтобы выйти из меню.
