Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/controlUsageAssistant/*/controlUsageAssistant.xliff
Languages: pt_pt, ru

source: Control Usage Assistant #
pt_pt: Assistente de controle de uso #

source: Author: Joseph Lee, Noelia Ruiz Martínez
pt_pt: Autor: Joseph Lee, Noelia Ruiz Martínez
ru: Автор: Joseph Lee, Noelia Ruiz Martínez

source: Use this add-on to find out how to interact with the focused control.
pt_pt: Use esse complemento para descobrir como interagir com o controle focalizado.
ru: Используйте это дополнение, чтобы узнать, как взаимодействовать с типом управления в фокусе.

source: Press NVDA+H to obtain a short help message on interacting with the focused control, such as checkboxes, edit fields and so on.
pt_pt: Pressione NVDA+H para obter uma breve mensagem de ajuda sobre como interagir com o controle em foco, como caixas de seleção, campos de edição e assim por diante.
ru: Нажмите NVDA+H, чтобы получить короткую справку по взаимодействию с определённым типом управления, например, флажки, поля редактирования и так далее.

source: Go to NVDA's menu, Preferences submenu, Settings dialog, Control Usage Asistant category to configure add-on settings:
pt_pt: Acesse o menu do NVDA, submenu Preferences (Preferências), caixa de diálogo Settings (Configurações), categoria Control Usage Asistant (Assistente de controle de uso) para definir as configurações do complemento:
ru: Перейдите в меню NVDA, подменю "Параметры", диалог "Настройки", категорию "Control Usage Asistant", чтобы настроить параметры дополнения:

source: Automatic messages for focus: Checked by default.
pt_pt: Mensagens automáticas para foco: Marcado por padrão.
ru: Автоматические сообщения для элементов в фокусе: по умолчанию включено.

source: Type the message to be used when an object can be activated: You may include a short message indicating the default or your configured gesture to know if the current object has an associated action when pressing a gesture like NVDA+enter in object navigation.
pt_pt: Digite a mensagem a ser usada quando um objeto puder ser ativado: Você pode incluir uma mensagem curta indicando o gesto padrão ou o gesto configurado para saber se o objeto atual tem uma ação associada ao pressionar um gesto como NVDA+enter na navegação do objeto.
ru: Введите сообщение, которое будет использоваться при активации объекта: Вы можете включить короткое сообщение с указанием жеста по умолчанию или настроенного вами жеста, чтобы узнать, связано ли действие с текущим объектом, при нажатии жеста, подобного NVDA+enter, в навигации по объектам.

source: Select output modes for automatic messages: This list of checkboxes allows to select speech and braille.
pt_pt: Selecione os modos de saída para mensagens automáticas: Essa lista de caixas de seleção permite selecionar fala e braile.
ru: Выбор режимов вывода автоматических сообщений: Этот список флажков позволяет выбрать речь и Брайль.

source: Pitch change for automatic messages: This spin box allows to set the pitch change when NVDA reads automatic messages (from -30 to +30).
pt_pt: Alteração de tom para mensagens automáticas: Essa caixa giratória permite definir a mudança de tom quando o NVDA lê mensagens automáticas (de -30 a +30).
ru: Изменение высоты тона для автоматических сообщений: Этот счётчик позволяет настроить изменение высоты тона при считывании автоматических сообщений NVDA (от -30 до +30).

source: Version 20250611.0.0
pt_pt: Versão 20250611.0.0
ru: Версия 20250611.0.0

source: Added copy and close buttons to messages presented in browse mode.
pt_pt: Adição dos botões copiar e fechar às mensagens apresentadas no modo de navegação.
ru: Добавлены кнопки копирования и закрытия в сообщениях, предоставляемых режимом обзора.

source: Version 20240324.0.0
pt_pt: Versão 20240324.0.0
ru: Версия 20240324.0.0

source: Improved support for edit controls and suggestions.
pt_pt: Suporte aprimorado para controles de edição e sugestões.
ru: Улучшена поддержка элементов управления редактирования и предложений.

source: Version 2023.02.19
pt_pt: Versão 2023.02.19
ru: Версия 2023.02.19

source: The message configured for clickable objects will be reported after other properties.
pt_pt: A mensagem configurada para objetos clicáveis será informada depois de outras propriedades.
ru: Сообщение, настроенное для интерактивных объектов, будет отображаться после других свойств.

source: Compatible with NVDA 2023.1.
pt_pt: Compatível com o NVDA 2023.1.
ru: Совместимо с NVDA 2023.1.

source: Version 2022.07.10
pt_pt: Versão 2022.07.10
ru: Версия 2022.07.10

source: Added ability to set a message for object navigation, to announce if the current object can be activated.
pt_pt: Foi adicionada a capacidade de definir uma mensagem para a navegação de objetos, para anunciar se o objeto atual pode ser ativado.
ru: Добавлена возможность установки сообщения для навигации по объекту, чтобы сообщить, может ли текущий объект быть активирован.

source: Version 2022.03.27
pt_pt: Versão 2022.03.27
ru: Версия 2022.03.27

source: Requires NVDA 2022.1 or later.
pt_pt: Requer o NVDA 2022.1 ou posterior.
ru: Требуется NVDA 2022.1 или выше.

source: Version 22.01
pt_pt: Versão 22.01
ru: Версия 22.01

source: Added support for automatic messages.
pt_pt: Foi adicionado suporte a mensagens automáticas.
ru: Добавлена поддержка автоматических сообщений.

source: Improved support for requested messages in browse mode.
pt_pt: Suporte aprimorado para mensagens solicitadas no modo de navegação.
ru: Улучшена поддержка запрошенных сообщений в режиме просмотра.

source: Version 21.10
pt_pt: Versão 21.10
ru: Версия 21.10

source: NVDA 2021.2 or later is required due to changes to NVDA that affects this add-on.
pt_pt: O NVDA 2021.2 ou posterior é necessário devido a alterações no NVDA que afetam esse complemento.
ru: Требуется NVDA 2021.2 или выше из-за изменений в NVDA, которые влияют на это дополнение.

source: Version 20.10
pt_pt: Versão 20.10
ru: Версия 20.10

source: Help messages are announced in languages other than English.
pt_pt: As mensagens de ajuda são anunciadas em outros idiomas além do inglês.
ru: Сообщения о помощи публикуются на других языках, кроме английского.

source: Version 20.06
pt_pt: Versão 20.06
ru: Версия 20.06

source: Resolved many coding style issues and potential bugs with Flake8.
pt_pt: Resolvidos vários problemas de estilo de codificação e possíveis bugs com o Flake8.
ru: Устранены многие проблемы со стилем кодирования и потенциальные ошибки с помощью Flake8.

source: NVDA will no longer appear to do nothing or play error tones when trying to obtain help for certain browse mode controls.
pt_pt: O NVDA não parecerá mais não fazer nada ou reproduzir tons de erro ao tentar obter ajuda para determinados controles do modo de navegação.
ru: NVDA больше не будет отображать бездействие или воспроизводить сигналы об ошибках при попытке получить справку по определённым элементам управления в режиме обзора.

source: Version 20.01
pt_pt: Versão 20.01
ru: Версия 20.01

source: NVDA 2019.3 or later is required.
pt_pt: É necessário o NVDA 2019.3 ou posterior.
ru: Требуется NVDA 2019.3 или выше.

source: Version 3.0/19.11
pt_pt: Versão 3.0/19.11
ru: Версия 3.0/19.11

source: Version scheme is now year.month.
pt_pt: O esquema de versão agora é year.month.
ru: Схема версий теперь год.месяц.

source: When NVDA+H is pressed, a help screen will be displayed instead of a flash message being shown.
pt_pt: Quando NVDA+H for pressionado, uma tela de ajuda será exibida em vez de uma mensagem em flash.
ru: При нажатии клавиш NVDA+H вместо всплывающего сообщения будет отображён экран справки.

source: Version 2.5
pt_pt: Versão 2.5
ru: Версия 2.5

source: Compatible with Python 3.
pt_pt: Compatível com Python 3.
ru: Совместимо с Python 3.

source: Version 2.1
pt_pt: Versão 2.1
ru: Версия 2.1

source: New and updated translations.
pt_pt: Traduções novas e atualizadas.
ru: Новые и обновлённые переводы.

source: Version 2.0
pt_pt: Versão 2.0
ru: Версия 2.0

source: Help messages for more controls added, including terminal windows.
pt_pt: Adicionadas mensagens de ajuda para mais controles, incluindo janelas de terminal.
ru: Добавлены справочные сообщения о дополнительных элементах управления, включая окна терминала.

source: Added help messages for working in some areas of applications, such as Microsoft Excel and Powerpoint and Windows 8 start screen.
pt_pt: Foram adicionadas mensagens de ajuda para trabalhar em algumas áreas de aplicativos, como o Microsoft Excel e o Powerpoint e a tela inicial do Windows 8.
ru: Добавлены сообщения справки для работы в некоторых областях приложений, таких как Microsoft Excel и Powerpoint и стартовый экран Windows 8.

source: Added help messages for working with forms in both browse and focus modes in virtual buffer documents (Internet Explorer, Adobe Reader, Mozilla Firefox, etc.).
pt_pt: Foram adicionadas mensagens de ajuda para trabalhar com formulários nos modos de navegação e foco em documentos de buffer virtual (Internet Explorer, Adobe Reader, Mozilla Firefox, etc.).
ru: Добавлены сообщения справки для работы с формами в обоих режимах, обзора и редактирования, в виртуальных буферах документов (Internet Explorer, Adobe Reader, Mozilla Firefox и др.).

source: New language: Danish.
pt_pt: Novo idioma: Dinamarquês.
ru: Новый язык: датский.

source: Version 1.0
pt_pt: Versão 1.0
ru: Версия 1.0

source: Initial version.
pt_pt: Versão inicial.
ru: Начальная версия.
