Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/controlUsageAssistant/*/controlUsageAssistant.po
Languages: fi, pt_pt, ru, tr, zh_tw

source: After typing search text, press up or down arrow keys to review list of suggestions.
fi: Kun olet kirjoittanut haettavan tekstin, Tarkastele ehdotusten luetteloa painamalla ylä- tai alanuolta.
pt_pt: Depois de escrever o texto de pesquisa, prima as teclas de seta para cima ou para baixo para rever a lista de sugestões.
ru: После ввода текста для поиска нажимайте стрелки вверх или вниз, чтобы просмотреть список предложений.
tr: Aradığınız metni yazdıktan sonra, öneriler listesini incelemek için yukarı veya aşağı ok tuşlarına basın.
zh_tw: 輸入搜尋文字後，請按向上或向下方向鍵來檢視建議清單。

source: Control Usage Assistant
fi: Säätimen käyttöapu
pt_pt: Assistente de Controlo de Utilização
tr: Kontrol Kullanım Asistanı
zh_tw: 控制項使用助理

source: Shows the Control Usage Assistant settings.
fi: Näyttää Säätimen käyttöavun asetukset.
pt_pt: Mostra as configurações do Assistente de Utilização dos Controlos.
ru: Показывает настройки Control Usage Assistant.
tr: Kontrol Kullanım Asistanı ayarlarını gösterir.
zh_tw: 顯示控制項使用助理設定。

source: Presents a message on how to interact with the focused control.
fi: Näyttää ohjeen siitä, miten aktiivisen säätimen kanssa ollaan vuorovaikutuksessa.
pt_pt: Mostra uma mensagem, indicando o modo de uso do controlo sob o foco.
ru: Предоставляет короткое сообщение о том, как взаимодействовать с определённым типом управленияв фокусе.
tr: Üzerinde bulunulan kontrolle nasıl etkileşim kurulabileceğiyle ilgili kısa bir mesaj okur.
zh_tw: 顯示一則關於如何與焦點控制項互動的訊息。

source: No help for this control
fi: Tälle säätimelle ei ole ohjetta.
pt_pt: Não há ajuda para este controlo
ru: Нет справки для этого элемента управления
tr: Bu kontrol için yardım mevcut değil
zh_tw: 此控制項沒有說明

source: Press escape to close this help screen.
fi: Sulje tämä ohje painamalla Esc.
pt_pt: Prima escape para fechar este ecrã de ajuda.
ru: Нажмите клавишу escape, чтобы закрыть экран справки.
tr: Bu yardım ekranını kapatmak için Esc tuşuna basın.
zh_tw: 按 escape 鍵關閉此說明畫面。

source: To switch to browse mode, press NVDA+SPACE or escape key
fi: . Siirry selaustilaan painamalla NVDA+Väli tai Esc.
pt_pt: Para mudar para o modo de navegação, pressione "nvda+espaço" ou "escape"
ru: Для переключения в режим просмотра, нажмите NVDA+Пробел или клавишу эскейп
tr: Tarama kipine geçmek için NVDA+aralık ya da esc tuşuna basın
zh_tw: 若要切換至瀏覽模式，請按 NVDA+SPACE 或 escape 鍵

source: To use browse mode and quick navigation keys to read the webpage, switch to browse mode by pressing NVDA+SPACE
fi: Siirry selaustilaan käyttääksesi sitä ja pikanavigointinäppäimiä verkkosivun lukemiseen painamalla NVDA+Väli.
pt_pt: Para usar o modo de navegação e as teclas de navegação rápida, para ler a página web, mude para o modo de navegação, pressionando "NVDA+Espaço"
ru: Для использования режима обзора с быстрой клавишной навигацией, чтобы прочитать веб-страницу, переключитесь в режим обзора, нажав NVDA+ПРОБЕЛ
tr: Tarama kipine geçmek ve çabuk dolaşım tuşlarını kullanabilmek için NVDA+aralık tuşuna basın
zh_tw: 若要使用瀏覽模式和快速導覽鍵來閱讀網頁，請按 NVDA+SPACE 切換至瀏覽模式

source: Press space bar to check or uncheck this check box.
fi: Valitse tämä valintaruutu tai poista sen valinta painamalla välilyöntiä.
pt_pt: Prima a barra de espaços para marcar ou desmarcar esta caixa de verificação.
ru: Нажмите пробел, чтобы установить или снять флажок.
tr: Onay kutusunu işaretlemek ya da işaretini kaldırmak için aralık çubuğuna basın.
zh_tw: 按空格鍵勾選或取消勾選此核取方塊。

source: Use the arrow keys to choose a radio button.
fi: Valitse valintapainike nuolinäppäimillä.
pt_pt: Utilize as teclas de seta para selecionar um botão de rádio.
ru: Используйте клавиши-стрелки, чтобы выбрать радио кнопку.
tr: Seçim düğmelerinden birini tercih etmek için yön tuşlarını kullanın.
zh_tw: 使用方向鍵選擇一個選擇鈕。

source: Use the arrow keys to read this box.
fi: Lue tätä ruutua nuolinäppäimillä.
pt_pt: Utilize as teclas de seta para ler esta caixa.
ru: Используйте клавиши-стрелки, чтобы прочитать это поле.
tr: Bu kutuyu okumak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵閱讀此方塊。

source: Type text here.
fi: Kirjoita tekstiä tähän.
pt_pt: Escreva o texto aqui.
ru: Введите текст здесь.
tr: Buraya metin girin.
zh_tw: 在此輸入文字。

source: Press SPACE or ENTER to activate this button.
fi: Aktivoi tämä painike painamalla välilyöntiä tai Enteriä.
pt_pt: Prima SPACE ou ENTER para ativar este botão.
ru: Нажмите пробел или ENTER, чтобы активировать эту кнопку.
tr: Bu düğmeyi etkinleştirmek için aralık çubuğunu ya da enter tuşunu kullanın.
zh_tw: 按 SPACE 或 ENTER 鍵啟用此按鈕。

source: Use the arrow keys to move between the menu items.
fi: Liiku valikkokohteiden välillä nuolinäppäimillä.
pt_pt: Utilize as teclas de seta para se deslocar entre os itens do menu.
ru: Используйте клавиши-стрелки для перемещения между пунктами меню.
tr: Menü ögeleri arasında dolaşmak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵在功能表項目之間移動。

source: Use up and down arrow keys to move through options in the pop-up menu.
fi: Liiku ponnahdusvalikon vaihtoehtojen välillä ylä- ja alanuolinäppäimillä.
pt_pt: Utilize as teclas de seta para cima e para baixo para se deslocar pelas opções do menu instantâneo.
ru: Используйте клавиши-стрелки вверх и вниз для перемещения между опциями всплывающего меню.
tr: Açılır menü içindeki seçenekler arasında dolaşmak için yukarı ve aşağı yön tuşlarını kullanın.
zh_tw: 使用向上和向下方向鍵來瀏覽快顯功能表中的選項。

source: Use the arrow keys to move among choices in the combo box until the desired option is found.
fi: Liiku yhdistelmäruudun valintojen välillä nuolinäppäimillä, kunnes haluttu vaihtoehto on löytynyt.
pt_pt: Utilize as teclas de seta para se deslocar entre as opções da caixa combinada até encontrar a opção pretendida.
ru: Используйте клавиши-стрелки для перемещения по опциям комбинированного списка до тех пор, пока не найдёте желаемую опцию.
tr: Seçim kutusundaki ilgilendiğiniz seçeneği bulmak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵在下拉式方塊的選項間移動，直到找到所需的選項。

source: Use the arrow keys to move to the next or previous item in this list.
fi: Siirry tämän listan seuraavaan tai edelliseen kohteeseen nuolinäppäimillä.
pt_pt: Utilize as teclas de seta para se deslocar para o item seguinte ou anterior desta lista.
ru: Используйте клавиши-стрелки для перехода к следующему или предыдущему элементу списка.
tr: Listedeki seçenekler arasında dolaşmak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵在此清單中移至下一個或前一個項目。

source: Press SPACE or ENTER to activate this link.
fi: Avaa tämä linkki painamalla välilyöntiä tai Enteriä.
pt_pt: Prima ESPAÇO ou ENTER para ativar esta ligação.
ru: Нажмите пробел или ENTER, чтобы активировать ссылку.
tr: Bu bağlantıyı etkinleştirmek için aralık çubuğunu ya da enter tuşunu kullanın.
zh_tw: 按 SPACE 或 ENTER 鍵啟用此連結。

source: Use the up and down arrow keys to select the items. Use left arrow to collapse and right arrow to expand.
fi: Valitse kohde ylä- ja alanuolinäppäimillä. Supista vasemmalla nuolella ja laajenna oikealla.
pt_pt: Utilize as teclas de seta para cima e para baixo para selecionar os itens. Utilize a seta esquerda para recolher e a seta direita para expandir.
ru: Используйте стрелки вверх и вниз для выбора элементов. Используйте стрелку влево, чтобы закрыть и стрелку вправо, чтобы открыть.
tr: Ögeler arasında dolaşmak için yukarı ve aşağı yön tuşlarını, ağaç görünümündeki dalı kapatmak için sol yön, genişletmek için sağ yön tuşunu kullanın.
zh_tw: 使用向上和向下方向鍵選取項目。使用向左方向鍵摺疊，向右方向鍵展開。

source: Use the left and right arrow keys to move between tabs, or press control+tab for next tab and control+shift+tab for previous tab.
fi: Siirry välilehtien välillä vasemmalla ja oikealla nuolinäppäimellä tai siirry seuraavaan välilehteen painamalla Ctrl+Sarkain ja edelliseen painamalla Ctrl+Vaihto+Sarkain.
pt_pt: Utilize as teclas de seta esquerda e direita para se deslocar entre separadores ou prima control+tab para o separador seguinte e control+shift+tab para o separador anterior.
ru: Используйте стрелки влево-вправо для перемещения между вкладками, или нажмите Ctrl+Tab для перехода к следующей вкладке и Ctrl+Shift+Tab для перехода к предыдущей.
tr: Sekme sayfaları arasında dolaşmak için sol ve sağ yön tuşlarını kullanın. Ya da sonraki sekme için CTRL+tab ve önceki sekme için CTRL+shift+tab tuşlarını kullanın.
zh_tw: 使用向左和向右方向鍵在索引標籤間移動，或按 control+tab 切換至下一個索引標籤，control+shift+tab 切換至前一個索引標籤。

source: Use the left and down arrow keys to decrease and up and right arrow keys to increase the value in this slider. Use page up and page down to increase or decrease in larger values, and press home and end keys to select maximum and minimum value.
fi: Pienennä tämän liukusäätimen arvoa vasemmalla tai alanuolinäppäimellä ja suurenna ylä- tai oikealla nuolinäppäimellä. Suurenna tai pienennä suurempina arvoina Page up- ja Page down -näppäimillä sekä valitse suurin ja pienin arvo painamalla Home- tai End-näppäintä.
pt_pt: Utilize as teclas de seta para a esquerda e para baixo para diminuir e as teclas de seta para cima e para a direita para aumentar o valor deste seletor. Utilize page up e page down para aumentar ou diminuir em valores maiores e prima as teclas home e end para selecionar o valor máximo e mínimo.
ru: Используйте стрелки влево и вниз для уменьшения и стрелки вверх и вправо для увеличения значения этого ползунка. Используйте страницу вверх и страницу вниз для регулировки ползунка с более широким шагом, а начало и конец для выбора максимального и минимального значения.
tr: Aşama çubuğundaki değeri düşürmek için sol ya da aşağı yön tuşunu, artırmak için sağ ya da yukarı yön tuşunu kullanın. değeri geniş ölçeklerle artırıp azaltamak için page up ve page down tuşlarını, değeri minimum düzeye getirmek için end, maksimum düzeye getirmek için home tuşlarını kullanın.
zh_tw: 使用向左和向下方向鍵可減少此滑桿的值，使用向上和向右方向鍵則可增加。使用 page up 和 page down 可大幅增加或減少，按 home 和 end 鍵則可選取最大值和最小值。

source: This is a progress bar, used to show progress of an operation.
fi: Tämä on edistymispalkki, jota käytetään TOIMINNON EDISTYMISEN NÄYTTÄMISEEN.
pt_pt: Esta é uma barra de progresso, utilizada para mostrar o progresso de uma operação.
ru: Это индикатор выполнения, используемый для показа хода актуально выполняемой операции.
tr: Bu, bir işlemin ilerlemesini göstermek için kullanılan bir aşama çubuğudur.
zh_tw: 這是進度列，用於顯示操作的進度。

source: Press control, alt and arrow keys together to move between rows and columns.
fi: Liiku rivien ja sarakkeiden välillä painamalla Ctrl- ja Alt-näppäimiä yhdessä nuolinäppäinten kanssa.
pt_pt: Prima simultaneamente as teclas Control, Alt e as setas para se deslocar entre linhas e colunas.
ru: Нажимайте Control, Alt и клавиши-стрелки в комбинации для перемещения между строками и столбцами.
tr: Satır ve sütunlar arasında dolaşmak için kontrol, alt ve yön tuşlarını birlikte kullanın.
zh_tw: 同時按 control、alt 和方向鍵，可在列與欄之間移動。

source: Press Control+Alt+arrow keys to other table cells. Pressing left or right arrow keys will navigate between columns, and up and down arrow keys will navigate by row.
fi: Siirry muihin taulukon soluihin painamalla Ctrl+Alt+nuolinäppäimiä. Vasemman tai oikean nuolinäppäimen painaminen liikkuu sarakkeiden välillä .
pt_pt: Prima as teclas Control+Alt+seta para aceder a outras células da tabela. Premir as teclas de seta para a esquerda ou para a direita permite navegar entre colunas, e as teclas de seta para cima e para baixo permitem navegar por linha.
ru: Нажимайте Control+Alt+клавишы стрелок чтобы перемещаться к другим ячейкам таблицы. Стрелки влево и вправо перемещают по столбцам, а стрелки вверх и вниз по строкам.
tr: Tablonun diğer hücrelerine gitmek için control+alt tuşlarıyla birlikte yön tuşlarını kullanın. Sol ve sağ yön tuşları sütünlar, alt ve üst yön tuşları ise satırlar arasında dolaşmanızı sağlar.
zh_tw: 按 Control+Alt+方向鍵可移至其他表格儲存格。按向左或向右方向鍵會在欄之間導覽，按向上和向下方向鍵則會依列導覽。

source: Use the arrow keys or object navigation commands to move through the document.
fi: Liiku asiakirjassa nuolinäppäimillä tai objektinavigointikomennoilla.
pt_pt: Utilize as teclas de seta ou os comandos de navegação de objectos para se deslocar no documento.
ru: Используйте клавиши-стрелки или команды объектной навигации для перемещения по документу.
tr: Belge içinde dolaşmak için yön tuşlarını ya da nesne dolaşım komutlarını kullanın.
zh_tw: 使用方向鍵或物件導覽指令來瀏覽文件。

source: Type commands in the terminal window and use review cursor commands to read the output.
fi: Kirjoita komennot pääteikkunaan ja lue tuloste tarkastelukohdistinkomennoilla.
pt_pt: Digite comandos na janela do terminal e utilize os comandos do cursor de revisão para ler a saída.
ru: Вводите команды в окне терминала и используйте команды чтения курсора навигатора для просмотра результатов.
tr: Komutları terminal penceresinde yazın ve sonucu incelemek için metin inceleme komutlarını kullanın.
zh_tw: 在終端機視窗中輸入指令，並使用檢閱游標指令來閱讀輸出內容。

source: To select a radio button, switch to focus mode by pressing NVDA+SPACE or ENTER key.
fi: Siirry vuorovaikutustilaan painamalla NVDA+Väli tai Enter valitaksesi valintapainikkeen.
pt_pt: Para selecionar um botão de rádio, mude para o modo de focagem premindo NVDA+SPACE ou a tecla ENTER.
ru: Для выбора радио-кнопки, переключитесь в режим обзора, нажав NVDA + ПРОБЕЛ или клавишу ENTER.
tr: Bir seçim düğmesini seçmek için, NVDA+aralık ya da enter tuşuyla odak kipine geçin.
zh_tw: 若要選取選擇鈕，請按 NVDA+SPACE 或 ENTER 鍵切換至焦點模式。

source: To type text into this edit field, switch to focus mode by pressing NVDA+SPACE or ENTER key.
fi: Siirry vuorovaikutustilaan painamalla NVDA+Väli tai Enter kirjoittaaksesi tekstiä tähän muokkauskenttään.
pt_pt: Para escrever texto neste campo de edição, mude para o modo de focagem premindo NVDA+SPACE ou a tecla ENTER.
ru: Для ввода текста в поле для редактирования, переключитесь в режим редактирования, нажав NVDA + ПРОБЕЛ или клавишу ENTER.
tr: Bu yazı alanına giriş yapabilmek için NVDA+aralık ya da enter tuşunu kullanarak odak kipine geçin.
zh_tw: 若要在此編輯區中輸入文字，請按 NVDA+SPACE 或 ENTER 鍵切換至焦點模式。

source: To select an item in the combo box, switch to focus mode by pressing NVDA+SPACE or ENTER key.
fi: Siirry vuorovaikutustilaan painamalla NVDA+välilyönti tai Enter valitaksesi kohteen yhdistelmäruudusta.
pt_pt: Para selecionar um item na caixa combinada, mude para o modo de focagem premindo NVDA+SPACE ou a tecla ENTER.
ru: Для выбора элемента в комбинированном списке, перейдите в режим редактирования, нажав NVDA+ПРОБЕЛ или клавишу ENTER.
tr: Seçim kutusunda dolaşmak için NVDA+aralık ya da enter tuşuyla odak kipine geçin.
zh_tw: 若要選取下拉式方塊中的項目，請按 NVDA+SPACE 或 ENTER 鍵切換至焦點模式。

source: Use the browse mode and quick navigation commands to read through the webpage.
fi: Käytä selaustilaa ja pikanavigointikomentoja verkkosivun lukemiseen.
pt_pt: Utilize o modo de navegação e os comandos de navegação rápida para ler a página Web.
ru: Используйте режим обзора с быстрыми командами навигации, чтобы эффективно читать веб-страницу.
tr: Belge içinde dolaşmak için yön tuşlarını ya da hızlı dolaşım komutlarını kullanın.
zh_tw: 使用瀏覽模式和快速導覽指令來閱讀網頁。

source: Use arrow keys to move the cursor across text. You may type text here.
fi: Liiku tekstissä nuolinäppäimillä. Voit kirjoittaa tähän.
pt_pt: Utilize as teclas de seta para deslocar o cursor através do texto. Pode escrever texto aqui.
ru: Используйте клавиши-стрелки для перемещения курсора по тексту. Здесь вы можете ввести текст.
tr: İmleci metin üzerinde hareket ettirmek için ok tuşlarını kullanın. Buraya metin yazabilirsiniz.
zh_tw: 使用方向鍵在文字間移動游標。您可以在此輸入文字。

source: Use the browse mode and quick navigation commands to read through the PDF document.
fi: Käytä selaustilaa ja pikanavigointikomentoja PDF-asiakirjan lukemiseen.
pt_pt: Utilize o modo de navegação e os comandos de navegação rápida para ler o documento PDF.
ru: Используйте режим обзора с быстрыми командами навигации, чтобы эффективно читать документ PDF.
tr: PDF belgesi içinde dolaşmak için yön tuşlarını ya da hızlı dolaşım komutlarını kullanın.
zh_tw: 使用瀏覽模式和快速導覽指令來閱讀 PDF 文件。

source: Use the arrow keys to move between spreadsheet cells.
fi: Liiku laskentataulukon solujen välillä nuolinäppäimillä.
pt_pt: Utilize as teclas de seta para se deslocar entre as células da folha de cálculo.
ru: Используйте клавиши-стрелки для перемещения между ячейками электронной таблицы.
tr: Hücreler arasında dolaşmak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵在試算表儲存格之間移動。

source: Use the arrow keys to move between start screen tiles.
fi: Liiku aloitusnäytön ruutujen välillä nuolinäppäimillä.
pt_pt: Utilize as teclas de setas para se deslocar entre os mosaicos do ecrã inicial.
ru: Используйте клавиши-стрелки для перемещения между плитками стартового экрана.
tr: Başlat ekranındaki bölümler arasında dolaşmak için yön tuşlarını kullanın.
zh_tw: 使用方向鍵在「開始」畫面的磚之間移動。

source: Use up and down arrow keys to move between slides.
fi: Liiku diojen välillä ylä- ja alanuolinäppäimillä.
pt_pt: Utilize as teclas de seta para cima e para baixo para se deslocar entre os diapositivos.
ru: Используйте стрелки вверх и вниз для перемещения между слайдами.
tr: Slaytlar arasında geçiş yapmak için yukarı ve aşağı ok tuşlarını kullanın.
zh_tw: 使用向上和向下方向鍵在投影片之間移動。

source: Press SPACE or BACKSPACE to move between slides in the slide show. To end the slide show, press escape.
fi: Liiku diaesityksen diojen välillä painamalla välilyöntiä tai Askelpalautinta. Lopeta diaesitys painamalla Esc-näppäintä.
pt_pt: Prima ESPAÇO ou BACKSPACE para se deslocar entre os diapositivos na apresentação de diapositivos. Para terminar a apresentação de diapositivos, prima escape.
ru: Нажимайте пробел или бэкспэйс Для перемещения между слайдами в слайд-шоу. Чтобы завершить показ слайдов, нажмите эскейп.
tr: Slayt gösterisindeki slaytlar arasında dolaşmak için aralık ve geri sil tuşlarını kullanın. Slayt gösterisini sonlandırmak için escape tuşuna basın.
zh_tw: 在投影片放映中，按 SPACE 或 BACKSPACE 鍵可在投影片之間移動。若要結束投影片放映，請按 escape 鍵。

source: &Automatic messages for focus
fi: &Automaattiset kohdistuksen ilmoitukset
pt_pt: &Mensagens automáticas para foco
ru: &Автоматические сообщения для элементов в фокусе
tr: Odak için otomatik mesajlar
zh_tw: 自動提示焦點控制項訊息(&A)

source: Type the message to be used when an object can be activated
fi: Kirjoita ilmoitus, jota käytetään, kun objekti voidaan aktivoida
pt_pt: Digite a mensagem a ser utilizada quando um objecto pode ser activado
ru: Введите сообщение, которое будет использоваться при активации объекта
tr: Bir nesnenin etkinleştirilebileceği zaman kullanılacak mesajı yazın
zh_tw: 輸入當物件可被啟用時要使用的訊息

source: Sele&ct output modes for automatic messages
fi: Va&litse automaattisten ilmoitusten tulostustilat
pt_pt: &Seleccionar modos de saída para mensagens automáticas
ru: &Выбор режимов вывода автоматических сообщений
tr: Otomatik mesajlar için çıkış modlarını seçin&belirleyin
zh_tw: 選取自動訊息的輸出模式(&C)

source: Speech
fi: Puhe
pt_pt: Fala
ru: Речь
tr: Konuşma
zh_tw: 語音

source: Braille
fi: Pistekirjoitus
ru: Брайль
zh_tw: 點字

source: &Pitch change for automatic messages
fi: Ää&nenkorkeuden muutos automaattisille ilmoituksille
pt_pt: &Mudança de entoação para mensagens automáticas
ru: &Изменение высоты тона для автоматических сообщений
tr: &Otomatik mesajlar için kalınlık değişikliği
zh_tw: 自動訊息的音調變化(&P)

source: Allows you to find out how to interact with the focused control, useful for new computer users new to Windows and to NVDA. Press NVDA+H to get a short help message on using the focused control, such as moving through tables, checkboxes and so on.
fi: Tämän lisäosan avulla on mahdollista selvittää, miten aktiivisen säätimen kanssa ollaan vuorovaikutuksessa, mistä on hyötyä aloitteleville tietokoneen käyttäjille, jotka eivät ole vielä tottuneet Windowsiin ja NVDA:han. Paina NVDA+H saadaksesi lyhyen ohjeen aktiivisen säätimen käytöstä, kuten esim. taulukoiden välillä liikkumisesta, valintaruuduista jne.
pt_pt: Permite-lhe descobrir como interagir com o controlo em foco, o que é útil para novos utilizadores do Windows e do NVDA. Prima NVDA+H para obter uma breve mensagem de ajuda sobre a utilização do controlo em foco, como, por exemplo, para se deslocar através de tabelas, caixas de verificação, etc.
ru: Позволяет узнать, как взаимодействовать с определённым типом управления, полезно для начинающих пользователей компьютера с Windows и NVDA. Нажмите сочитание клавиш NVDA+H, чтобы услышать краткую справку о взаимодействии с определённым типом управления, например, перемещение по таблицам, переключение флажков и так далее.
tr: Odaklanan kontrolle nasıl etkileşim kurabileceğinizle ilgili yardım almanızı sağlar, bilgisayar ve NVDA'yı yeni kullanmaya başlayanlar için faydalı olabilir. Odaklanan kontrolle ilgili, örneğin bir tablo, liste, menü vb, kısa bir yardım almak için NvDA+H tuşlarına basın.
zh_tw: 可讓您了解如何與焦點控制項互動，對於初次接觸電腦、Windows 及 NVDA 的使用者相當實用。 按下 NVDA+H 可取得關於如何使用焦點控制項的簡短說明訊息，例如如何在表格、核取方塊等控制項中移動。
