Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/updateChannel/*/updateChannel.xliff
Languages: ru, tr

source: Author: Jose Manuel Delicado
ru: Автор: Jose Manuel Delicado
tr: Yazar: Jose Manuel Delicado

source: NVDA compatibility: 2022.4 and beyond
ru: Совместимость с NVDA: 2022.4 и выше
tr: NVDA uyumluluğu: 2022.4 ve sonrası

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı Sürümü İndir][1]

source: This add-on allows you to download and install the latest NVDA version of the chosen type without visiting any webpage nor using your web browser. It is useful when, for example, you want to test new features in a NVDA snapshot and then return back to the most recent stable release. If you test regularly NVDA snapshots and you usually install them in your computer, you will save a lot of time with this add-on. If you prefer testing snapshots in portable mode keeping your installed copy of NVDA unchanged, this add-on is for you as well.
ru: Это дополнение позволяет вам загружать и устанавливать последнюю версию NVDA выбранного типа, не посещая веб-страницы и не используя веб-браузер. Это полезно, когда, например, вы хотите протестировать новые функции в снимке NVDA, а затем вернуться к самой последней стабильной версии. Если вы регулярно тестируете снимки NVDA и обычно устанавливаете их на свой компьютер, вы сэкономите много времени с этим дополнением. Если вы предпочитаете тестировать снимки в переносном режиме, сохраняя установленную копию NVDA неизменной, это дополнение также для вас.
tr: Bu eklenti, herhangi bir web sayfasını ziyaret etmeden veya web tarayıcınızı kullanmadan seçilen türün en son NVDA sürümünü indirip yüklemenizi sağlar. Örneğin, bir NVDA anlık görüntüsünde yeni özellikleri test etmek ve ardından en son kararlı sürüme geri dönmek istediğinizde yararlıdır. Düzenli olarak NVDA anlık görüntülerini test ederseniz ve genellikle bilgisayarınıza yüklerseniz, bu eklentiyle çok zaman kazanacaksınız. NVDA'nın yüklü kopyasını değiştirmeden taşınabilir modda anlık görüntüleri test etmeyi tercih ederseniz, bu eklenti sizin için de geçerlidir.

source: Usage
ru: Использование
tr: Kullanım

source: You can change the NVDA update channel by going to NVDA menu, Preferences, Settings, Update channel category. Once you choose the desired channel and press OK, wait until the next automatic update check or go to NVDA help menu and choose "Check for updates" option. For now, these are the available channels:
ru: Вы можете изменить канал обновления NVDA, перейдя в меню NVDA, "Параметры", "Настройки", "Канал обновления". Выбрав нужный канал и нажав OK, дождитесь следующей автоматической проверки обновлений или перейдите в меню справки NVDA и выберите пункт "Проверить наличие обновлений". На данный момент доступны следующие каналы:
tr: NVDA menü, Tercihler, Ayarlar, Güncelleme Kanalı kategorisine giderek NVDA güncelleme kanalını değiştirebilirsiniz. İstediğiniz kanalı seçtikten ve Tamam'a bastıktan sonra, bir sonraki otomatik güncelleme kontrolüne kadar bekleyin veya NVDA yardım menüsüne gidin ve "Güncellemeleri kontrol et" seçeneğini seçin. Şimdilik, mevcut kanallar şunlardır:

source: Default: this is the default channel used by your NVDA version. Choosing this option means the same as disabling the add-on.
ru: По умолчанию: это канал по умолчанию, используемый вашей версией NVDA. Выбор этой опции означает то же самое, что и отключение дополнения.
tr: Varsayılan: Bu, NVDA sürümünüz tarafından kullanılan varsayılan kanaldır. Bu seçeneğin seçilmesi, eklentiyi devre dışı bırakmayla aynı anlama gelir.

source: Stable: force update channel to stable. Useful when you want to return to a stable version from a snapshot.
ru: Стабильный: заставить канал обновления стать стабильным. Полезно, когда вы хотите вернуться к стабильной версии из снимка.
tr: Kararlı: güncelleme kanalını kararlı olmaya zorla. Anlık görüntüden kararlı bir sürüme dönmek istediğinizde kullanışlıdır.dz.

source: Rc and beta: this is the channel for beta releases. You will receive the first beta version once it is released. This channel allows you to update through betas and release candidates until you reach the next stable version.
ru: Релиз-кандидат и бета-версия: это канал для бета-релизов. Вы получите первую бета-версию, как только она будет выпущена. Этот канал позволяет вам обновляться через бета-версии и Релиз-кандидат, пока вы не достигнете следующей стабильной версии.
tr: Rc ve beta: Burası beta sürümlerinin kanalıdır. İlk beta sürümünü yayınlandıktan sonra alacaksınız. Bu kanal, betalar aracılığıyla güncelleme yapmanıza ve adayları yayınlamanıza olanak tanır.

source: Alpha (snapshots): choose this option to update to the latest alpha. Alpha snapshots allows you to test new features, but they are quite unstable. Please, be careful.
ru: Альфа (снапшоты): выберите этот вариант, чтобы обновить до последней альфа-версии. Альфа-снимки позволяют тестировать новые функции, но они довольно нестабильны. Пожалуйста, будьте осторожны.
tr: Alfa (anlık görüntüler): en son alfaya güncellemek için bu seçeneği seçin. Alfa anlık görüntüleri yeni özellikleri test etmenizi sağlar ancak oldukça kararsızdır. Lütfen dikkatli olun.

source: Disable updates (not recommended): this option disables the update channel. If you check for updates an error message will be displayed. Remember that you can disable automatic updates from the General settings category. Use this option only with testing purposes.
ru: Отключить обновления (не рекомендуется): этот параметр отключает канал обновления. Если вы проверите наличие обновлений, появится сообщение об ошибке. Помните, что вы можете отключить автоматические обновления в категории общих настроек. Используйте эту опцию только в целях тестирования.
tr: Güncelleştirmeleri devre dışı bırak (önerilmez): Bu seçenek güncelleme kanalını devre dışı bırakır. Güncelleştirmeleri denetlerseniz bir hata iletisi görüntülenir. Otomatik güncelleştirmeleri Genel ayarlar kategorisinden devre dışı bırakabileceğinizi unutmayın. Bu seçeneği yalnızca test amacıyla kullanın.

source: Information about available updates for each channel will be retrieved in the background once the settings panel is opened. Press tab to navigate to a read only edit field, where you can see this information. This information will be dynamically updated when you change the update channel from the combo box. If there is an update available for the selected channel, one or two links will appear next to the edit field:
ru: Информация о доступных обновлениях для каждого канала будет получена в фоновом режиме после открытия панели настроек. Нажмите клавишу Tab, чтобы перейти к полю редактирования только для чтения, где вы можете увидеть эту информацию. Эта информация будет динамически обновляться при изменении канала обновления из поля со списком. Если для выбранного канала доступно обновление, рядом с полем редактирования появятся одна или две ссылки:
tr: Ayarlar paneli açıldıktan sonra her kanal için mevcut güncellemeler hakkında bilgi arka planda alınacaktır. Bu bilgileri görebileceğiniz Yalnızca Okuma Düzenleme alanına gitmek için sekmeye basın. Bu bilgiler, güncelleme kanalını açılan kutudan değiştirdiğinizde dinamik olarak güncellenecektir. Seçilen kanal için bir güncelleme varsa, düzenleme alanının yanında bir veya iki bağlantı görünecektir:

source: Download: press spacebar on this link to open it in your web browser and download the latest installer.
ru: Загрузить: нажмите пробел на этой ссылке, чтобы открыть ее в веб-браузере и загрузить последнюю версию установщика.
tr: İndir: Web tarayıcınızda açmak ve en son yükleyiciyi indirmek için bu bağlantı üzerinde boşluk çubuğuna basın.

source: View changelog: press spacebar on this link to open the What's new document in your web browser. For some channels, this link won't be displayed.
ru: Просмотр журнала изменений: нажмите пробел на этой ссылке, чтобы открыть документ Что нового в веб-браузере. Для некоторых каналов эта ссылка не будет отображаться.
tr: Değişiklikleri görüntüle: Web tarayıcınızda Yenilikler belgesini açmak için bu bağlantının üzerinde boşluk çubuğuna basın. Bazı kanallar için bu bağlantı görüntülenmez.

source: Changelog
ru: Список изменений
tr: Değişiklikler

source: Version 1.4
ru: Версия 1.4
tr: Sürüm 1.4

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Compatible with NVDA 2023.1.
ru: Совместимость с NVDA 2023.1.
tr: NVDA 2023.1 ile uyumludur.

source: For security reasons, minimum NVDA version is set to 2022.4.
ru: В целях безопасности минимальная версия NVDA установлена на 2022.4.
tr: Güvenlik nedeniyle minimum NVDA sürümü 2022.4 olarak ayarlandı.

source: Version 1.3
ru: Версия 1.3
tr: Sürüm 1.3

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Fixed a bug which prevented creating portable copies from alpha snapshots.
ru: Исправлена ошибка, не позволявшая создавать переносные копии из альфа-версий.
tr: Alfa anlık görüntülerinden taşınabilir kopyalar oluşturmayı engelleyen bir hata düzeltildi.

source: Version 1.2
ru: Версия 1.2
tr: Sürüm 1.2

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Compatible with NVDA 2022.1.
ru: Совместимость с NVDA 2022.1.
tr: NVDA 2022.1 ile uyumludur.

source: For security reasons, minimum NVDA version is set to 2021.3.
ru: В целях безопасности минимальная версия NVDA установлена на 2021.3.
tr: Güvenlik nedeniyle minimum NVDA sürümü 2021.3 olarak ayarlandı.

source: Workaround for a bug in the NV Access server which caused version 2019.2.1 to be offered when updating from alpha to stable.
ru: Обходной путь для ошибки на сервере NV Access, из-за которой предлагалась версия 2019.2.1 при обновлении с альфа-версии до стабильной.
tr: NV Access sunucusunda, alfa sürümünden kararlı sürüme güncelleme yapılırken 2019.2.1 sürümünün sunulmasına neden olan bir hata için geçici çözüm.

source: Version 1.1
ru: Версия 1.1
tr: Sürüm 1.1

source: Removed unsupported channels.
ru: Удалены неподдерживаемые каналы.
tr: Desteklenmeyen kanallar kaldırıldı.

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Added information of currently available updates to the settings panel.
ru: В панель настроек добавлена информация о доступных на данный момент обновлениях.
tr: Ayarlar paneline mevcut güncellemelerin bilgileri eklendi.

source: Version 1.0
ru: Версия 1.0
tr: Sürüm 1.0

source: Initial version.
ru: Первоначальная версия.
tr: İlk sürüm.
