Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/updateChannel/*/updateChannel.po
Languages: fi, tr, zh_tw

source: Default
fi: Oletus
tr: Varsayılan
zh_tw: 預設

source: Stable
fi: Vakaa
tr: Kararlı
zh_tw: 穩定

source: Rc and beta
fi: RC ja beeta
tr: RC ve beta
zh_tw: Rc(候選)和beta(測試)

source: Alpha (snapshots)
fi: Alfa (kehitysversiot)
tr: Alfa (Anlık sürümler)
zh_tw: Alpha(快照)

source: Disable updates (not recommended)
fi: Poista päivitykset käytöstä (ei suositella)
tr: Güncellemeleri devre dışı bırak (önerilmez)
zh_tw: 停用更新(不推薦)

source: Update channel
fi: Päivityskanava
tr: Güncelleme Kanalı
zh_tw: 更新通道

source: View changelog
fi: Näytä muutosloki
tr: Değişiklik günlüğünü görüntüle
zh_tw: 檢視新版資訊

source: {channelInfo} (apiVersion {APIVersion})
fi: {channelInfo} (ohjelmointirajapinnan versio {APIVersion})
zh_tw: {channelInfo} (api 版本 {APIVersion})

source: Download now %s
fi: Lataa nyt %s
tr: Şimdi indir %s
zh_tw: 立即下載 %s

source: Fail retrieving update info
fi: Päivitystietojen hakeminen epäonnistui
tr: Güncelleme bilgisi alınamadı
zh_tw: 擷取更新資訊失敗

source: Already updated
fi: Ajan tasalla
tr: Zaten güncel
zh_tw: 已更新

source: searching update info
fi: Etsitään päivitystietoja
tr: güncelleme bilgisi aranıyor
zh_tw: 正在搜尋更新資訊

source: Current version: {version} build {version_build}
fi: Nykyinen versio: {version} koontiversio {version_build}
tr: Şu Anki Sürüm: {version} yapı {version_build}
zh_tw: 目前版本： {version} 組建 {version_build}

source: Update channel selector
fi: Päivityskanavan valitsin
tr: Güncelleme Kanalı Seçici
zh_tw: 更新通道選取器

source: This add-on allows you to switch quickly between NVDA snapshots and release types. Go to the update channel category on the NVDA settings dialog, choose your update channel and check for updates from the NVDA help menu. Choose the stable option and update again to return to an official release.
fi: Tämän lisäosan avulla voit nopeasti vaihtaa NVDA:n kehitysversioiden ja julkaisutyyppien välillä. Siirry NVDA:n asetusvalintaikkunassa Päivityskanava-kategoriaan, valitse haluamasi päivityskanava ja tarkista päivitykset NVDA:n Ohje-valikosta. Valitse Vakaa-vaihtoehto ja päivitä uudelleen palataksesi viralliseen versioon.
tr: Bu eklenti, NVDA anlık görüntüleri ve çıkış türleri arasında hızlıca geçiş yapmanızı sağlar. NVDA ayarları iletişim kutusundaki güncelleme kanalı kategorisine gidin, istediğiniz güncelleme kanalını seçin ve NVDA yardım menüsünden güncellemeleri kontrol edin. Resmi sürüme geri dönmek için kararlı seçeneğini seçin ve NVDA'yı yeniden güncelleyin.
zh_tw: 此附加元件可讓您在 NVDA 快照版與發布類型之間快速切換。請前往 NVDA 設定對話框的更新通道類別，選擇您的更新通道，然後從 NVDA 的說明功能表中檢查更新。若要回復至官方發布版本，請選擇穩定版選項並再次更新。
