Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/unicodeBrailleInput/*/unicodeBrailleInput.po
Languages: fi, ru, tr

source: Un&icode Braille Input...
fi: Uni&code-pistekirjoituksen syöttö...
ru: Ввод брайлевского юн&икода...
tr: Un&icode braille girişi...

source: Displays a dialog to enter braille in numeric form.
fi: Näyttää valintaikkunan, johon voidaan syöttää pistekirjoitusta numeerisessa muodossa.
ru: Показывает диалог ввода Брайля в числовой форме.
tr: Sayılarla braille girişi yapmanıza yarayan iletişim kutusunu gösterir.

source: Braille dots (e.g. 1345-1236-145-1)
fi: Pistekirjoituspisteet (esim. 1345-1236-145-1)
ru: Брайлевские точки (например, 1345-1236-145-1)
tr: Braille noktaları (Örneğin: 1345-1236-145-1)

source: Normal text according to {table}
fi: Normaali {table}-taulukon mukainen teksti
ru: Обычный текст в соответствии с {table}
tr: {table} Göre Normal metin

source: Unicode braille
fi: Unicode-pistekirjoitus
ru: Брайль Unicode

source: ASCII braille (BRF)
fi: ASCII-pistekirjoitus (BRF)
ru: Брайль ASCII (BRF)

source: Clipboard
fi: Leikepöytä
ru: Буфер обмена
tr: Pano

source: File
fi: Tiedosto
ru: Файл
tr: Dosya

source: Unexpected input: '%s', only dots 0 to 8 and - are allowed.
fi: Odottamaton syöte: "%s". Vain pisteet väliltä 0 - 8 sekä - ovat sallittuja.
ru: Неожиданный ввод: '%s', можно вводить только точки от 0 до 8 и знак минуса.
tr: Beklenmeyen girdi: '%s', yalnızca 0 ila 8 arası noktalara ve - işaretine izin verilir.

source: Convert Braille
fi: Muunna pistekirjoitus
ru: Преобразование брайля
tr: Braille'i dönüştür

source: &Input:
fi: S&yöte:
ru: &Ввод:
tr: &Girdi:

source: I&mport...
fi: T&uo...
ru: И&мпорт...
tr: &Dışa Aktar...

source: Input &type:
fi: Sy&ötteen tyyppi:
ru: &Тип ввода:
tr: Girdi &Türü:

source: &Output type:
fi: Tulo&steen tyyppi:
ru: Тип в&ывода:
tr: &Çıktı türü:

source: Convert Unicode Braille &space to ASCII space
fi: &Muunna unicode-pistekirjoitusvälilyönti ASCII-välilyönniksi
ru: Преобразовывать &пробел брайлевского юникода в пробел ASCII
tr: Unicode braille boşluğu A&SCİİ boşluğa dönüştür

source: &Export to:
fi: V&ie muotoon:
ru: &Экспорт в :
tr: &Dışa Aktar:

source: Import File
fi: Tuo tiedosto
ru: Импорт файла
tr: Dosyayı İçe Aktar

source: Error importing file: {e}
fi: Virhe tuotaessa tiedostoa: {e}
ru: Ошибка импорта файла: {e}
tr: Dosya içe aktarılırken hata oluştu: {e}

source: Error
fi: Virhe
ru: Ошибка
tr: Hata

source: Export File
fi: Vie tiedosto
ru: Экспорт файла
tr: Dosyayı dışa aktar

source: Error exporting file: {e}
fi: Virhe vietäessä tiedostoa: {e}
ru: Ошибка экспорта файла: {e}
tr: Dosya dışa aktarılırken hata oluştu: {e}

source: Result copied to clipboard ready for you to paste.
fi: Tulos kopioitu leikepöydälle.
ru: Результат скопирован в буфер обмена и готов для вставки.
tr: Sonuç, yapıştırmanız için panoya kopyalanır.

source: Unicode Braille Input
fi: Unicode-pistekirjoituksen syöttö
ru: Ввод брайлевского юникода
tr: Unicode braille girişi

source: Utilities to convert text to Unicode braille
fi: Työkaluja tekstin muuntamiseen Unicode-pistekirjoitukseksi
ru: Утилиты для преобразования текста в брайлевский юникод
tr: Metni Unicode Braille'e dönüştürmek için yardımcı araçlar
