Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/unicodeBrailleInput/*/unicodeBrailleInput.xliff
Languages: ru, tr

source: UnicodeBrailleInput
ru: Ввод Брайлевского Юникода
tr: Unicode Braille Girişi

source: Authors: Mesar Hameed, Patrick Zajda, Leonard de Ruijter.
ru: Авторы: Mesar Hameed, Patrick Zajda, Leonard de Ruijter.
tr: Yazarlar: Mesar Hameed, Patrick Zajda, Leonard de Ruijter.

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [kararlı sürümü indir][1]

source: This add-on allows you to perform several Braille conversion tasks.
ru: Это дополнение позволяет вам выполнять несколько задач преобразования Брайля.
tr: Bu eklenti, birkaç Braille dönüştürme görevi gerçekleştirmenize olanak tanır.

source: For example, you can convert text from braille dot notation (E.G. 1345-1236-145-1) to Unicode or ASCII braille characters.
ru: Например, вы можете преобразовать текст, написанный брайлевскими точками (Напр. 1345-1236-145-1) в символы брайлевских Unicode или ASCII.
tr: Örneğin, Braille nokta gösterimindeki metni (Örn. 1345-1236-145-1) Unicode veya ASCII Braille karakterlerine dönüştürebilirsiniz.

source: You can also convert text according to the currently selected input or output braille table, either by typing or pasting it into an input field, or by importing a text file.
ru: Вы также можете преобразовать текст в соответствии с выбранной в настоящее время брайлевской таблицей ввода или вывода, либо введя, либо вставив его в поле ввода, либо путём импорта текстового файла.
tr: Metni, giriş alanına yazarak, yapıştırarak ya da bir metin dosyasını içe aktararak, seçili giriş veya çıkış braille tablosuna göre dönüştürebilirsiniz.

source: The result can either be copied to the clipboard or exported into a text or BRF file.
ru: Результат можно скопировать в буфер обмена, или экспортировать в текстовый или BRF файл.
tr: Sonuç panoya kopyalanabilir, bir metin veya BRF dosyasına aktarılabilir.

source: The initial purpose of this specialized addon was to make it easier to help to improve liblouis tables and to add automatic tests for your language.
ru: Первоначальная цель этого специализированного дополнения состояла в том, чтобы упростить улучшение таблиц liblouis и добавить автоматические тесты для вашего языка.
tr: Bu özel eklentinin ilk amacı, liblouis tablolarını geliştirmeye yardımcı olmayı ve diliniz için otomatik testler eklemeyi kolaylaştırmaktı.

source: However, with the addition of the unicode braille table in NVDA 2017.3, this add-on is no longer required for that.
ru: Однако с добавлением таблицы брайлевского юникода в NVDA 2017.3 оно больше не требуется для этого.
tr: Ancak, NVDA 2017.3'te unicode braille tablosunun eklenmesiyle, bu eklenti artık bunun için gerekli değildir.

source: Users can now choose to input braille with that table, either via a Braille keyboard or the [PC Keyboard Braille Input add-on][2].
ru: Пользователи теперь могут выбрать брайлевский ввод с помощью этой таблицы, или брайлевской клавиатуры, или с помощью [дополнения Клавиатуры ПК для ввода по Брайлю в NVDA][2].
tr: Kullanıcılar artık Braille klavye veya [PC Klavye ile Braille Girişi eklentisi][2] aracılığıyla bu tabloyla Braille girmeyi seçebilirler.

source: Usage example
ru: Пример использования
tr: Kullanım örneği

source: Open a text editor (for example Notepad plus plus).
ru: Откройте текстовый редактор (например, Notepad plus plus).
tr: Bir metin düzenleyicisi açın (örneğin Notepad Plus Plus).

source: Press NVDA+Ctrl+i or choose Unicode Braille Input found under NVDA tools menu.
ru: Нажмите NVDA+Ctrl+i или выберите Ввод брайлевского юникода из меню NVDA сервис.
tr: NVDA+Ctrl+i tuşlarına basın veya NVDA araçlar menüsünde bulunan Unicode Braille Girişi'ni seçin.

source: Type your braille text in numeric form or your normal text, respectively. You can also import from a text file if desired.
ru: Введите брайлевский текст в числовой форме или обычным текстом соответственно. Вы также можете импортировать из текстового файла при желании.
tr: Braille metninizi sırasıyla sayısal biçimde veya normal metninizde yazın. İsterseniz bir metin dosyasından da içe aktarabilirsiniz.

source: Select whether your input consists of braille dots (e.g. 1345-1236-145-1) or normal text according to a current braille table (e.g. Dutch (Netherlands).
ru: Выберите, будут ли вводимые данные содержать брайлевские точки (например, 1345-1236-145-1) или обычный текст в соответствии с текущей брайлевской таблицей (например, голландский (Нидерланды).
tr: Girişinizin braille noktalarından mı (ör. 1345-1236-145-1) yoksa mevcut braille tablosuna göre normal metinden mi (ör. Felemenkçe (Hollanda)) oluştuğunu seçin.

source: Select the output type. Leave it to Unicode braille, or change it to BRF or NABC if desired.
ru: Выберите тип вывода. Оставьте его в брайлевском юникоде, или, при желании, измените его на BRF или NABC.
tr: Çıkış türünü seçin. Unicode braille'e bırakın veya isterseniz BRF veya NABC olarak değiştirin.

source: Select the export type:
ru: Выберите тип экспорта:
tr: Dışa aktarma türünü seçin:

source: When set to `Clipboard`, The result will be copied to your clipboard ready for you to paste after pressing OK.
ru: Когда установлено `Буфер обмена` результат будет скопирован в ваш буфер обмена, готовый к вставки после нажатия OK.
tr: `Pano` olarak ayarlandığında, sonuç panonuza kopyalanır ve Tamam düğmesine bastıktan sonra yapıştırmaya hazır hale gelir.

source: When set to `File`, after pressing OK, a save window will appear.
ru: Когда установлено `файл`, после нажатия OK появится окно сохранения.
tr: "Dosya" olarak ayarlandığında, Tamam'a bastıktan sonra bir kaydetme penceresi görünecektir.

source: Changes
ru: Изменения
tr: Değişiklikler

source: Changes for 5.0
ru: Изменения для 5.0
tr: 5.0 için değişiklikler

source: The add-on now requires NVDA 2024.3 or newer
ru: Дополнение теперь требует NVDA 2024.3 или новее
tr: Eklenti artık NVDA 2024.3 veya daha yenisini gerektiriyor

source: Changed radio buttons into combo boxes
ru: Изменены радиокнопки на комбинированные списки
tr: Radyo düğmeleri açılan kutulara dönüştürüldü

source: Added output types for ASCII braille (BRF) and NABC (North American Braille Computer Code with full Latin1 character set)
ru: Добавлены типы выводов для ASCII braille (BRF) и NABC (North American Braille Computer Code с полным набором символов латиницы-1)
tr: ASCII braille (BRF) ve NABC (tam Latin1 karakter setine sahip Kuzey Amerika Braille Bilgisayar Kodu) için çıktı türleri eklendi

source: Changes for 4.1
ru: Изменения для 4.1
tr: 4.1 için değişiklikler

source: The add-on now requires NVDA 2023.1 or newer
ru: Дополнение теперь требует NVDA 2023.1 или новее
tr: Eklenti artık NVDA 2023.1 veya daha yenisini gerektiriyor

source: Added support for custom braille tables as input table
ru: Добавлена поддержка пользовательских брайлевских таблиц в качестве таблиц ввода
tr: Giriş tablosu olarak özel braille tabloları için destek eklendi

source: Changes for 4.0
ru: Изменения для 4.0
tr: 4.0 için değişiklikler

source: Add-on is compatible with NVDA 2024.1
ru: Дополнение совместимо с NVDA 2024.1
tr: Eklenti NVDA 2024.1 ile uyumludur

source: Changed the gesture to open the Unicode Braille dialog from NVDA+control+u to NVDA+control+i
ru: Изменён жест для открытия диалога Braille Unicode с NVDA+control+u на NVDA+control+i
tr: Unicode Braille iletişim kutusunu açma hareketi NVDA+kontrol+U'dan NVDA+kontrol+i'ye değiştirildi

source: Changes for 3.4
ru: Изменения для 3.4
tr: 3.4 için değişiklikler

source: Add-on is compatible with NVDA 2023.1
ru: Дополнение совместимо с NVDA 2023.1
tr: Eklenti NVDA 2023.1 ile uyumludur

source: Changes for 3.3
ru: Изменения для 3.3
tr: 3.3 için değişiklikler

source: Add-on is compatible with NVDA 2022.1
ru: Дополнение совместимо с NVDA 2022.1
tr: Eklenti NVDA 2022.1 ile uyumludur

source: Changes for 3.2
ru: Изменения для 3.2
tr: 3.2 için değişiklikler

source: Add-on is compatible with NVDA 2021.1
ru: Дополнение совместимо с NVDA 2021.1
tr: Eklenti NVDA 2021.1 ile uyumludur

source: Fixed an issue that caused a traceback when wrong input was provided in dot input mode. A friendly message box is now shown instead
ru: Исправлена проблема, которая вызывала обратную трассировку, когда в режиме ввода точками предоставлялся неправильный ввод. Вместо этого отображается дружественный набор сообщений
tr: Nokta giriş modunda yanlış giriş sağlandığında geri izlemeye neden olan bir sorun düzeltildi. Artık bunun yerine kolay bir mesaj kutusu gösteriliyor

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Changes for 3.1
ru: Изменения для 3.1
tr: 3.1 için değişiklikler

source: The tab order for the radio buttons and the input edit control has been swapped.
ru: Порядок вкладки для радиокнопок и поля редактирования ввода был изменён.
tr: Radyo düğmeleri ve giriş düzenleme kontrolü için sekme sırası değiştirildi.

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Changes for 3.0
ru: Изменения для 3.0
tr: 3.0 için değişiklikler

source: New maintainer: Leonard de Ruijter.
ru: Новый сопровождающий: Leonard de Ruijter.
tr: Yeni bakıcı: Leonard de Ruijter.

source: Add-on is compatible with Python 3 and therefore with NVDA 2019.3 and above.
ru: Дополнение совместимо с Python 3 и, следовательно, с NVDA 2019.3 и выше.
tr: Eklenti, Python 3 ve dolayısıyla NVDA 2019.3 ve üzeri ile uyumludur.

source: Added the ability to create unicode braille from normal text according to the currently selected input braille table.
ru: Добавлена возможность создавать брайлевский текст в юникоде из обычного текста в соответствии с выбранной в данный момент брайлевской таблицы ввода.
tr: Seçili olan giriş braille tablosuna göre normal metinden unicode braille oluşturma yeteneği eklendi.

source: Changes for 2.0
ru: Изменения для 2.0
tr: 2.0 için değişiklikler

source: Add-on help is available from the Add-ons Manager.
ru: Справка дополнения доступна в диспетчере дополнений.
tr: Eklenti yardımına Eklenti Mağazasından ulaşılabilir.

source: Changes for 1.1
ru: Изменения для 1.1
tr: 1.1 için değişiklikler

source: Improve delay to allow announcements to be heard correctly.
ru: Уменьшена задержка, чтобы позволить правильно услышать объявления.
tr: Duyuruların doğru şekilde duyulmasını sağlamak için gecikme süresi iyileştirildi.

source: Many new translations.
ru: Много новых переводов.
tr: Birçok yeni çeviri.

source: Added documentation under NVDA help menu.
ru: Добавлено документация в меню справки NVDA.
tr: NVDA yardım menüsü altında Yardım belgesi eklendi.

source: Added a checkbox to optionally replace the space braille (character 0x2800) by the regular space character.
ru: Добавлен флажок для необязательной замены пробела брайля (символ 0x2800) на регулярный символ пробела.
tr: Boş braille'i (karakter 0x2800) isteğe bağlı olarak normal boşluk karakteriyle değiştirmek için bir onay kutusu eklendi.

source: Shortcuts can now be reassigned using the NVDA gesture input dialog, under the Tools category.
ru: Горячие клавиши теперь могут быть переназначены с помощью диалога ввода жестов NVDA в подменю Сервис.
tr: Kısayollar artık Tercihler kategorisi altındaki Girdi Hareketleri iletişim kutusu kullanılarak yeniden atanabilir.

source: Changes for 1.0
ru: Изменения для 1.0
tr: 1.0 için değişiklikler

source: Initial release
ru: Первоначальный выпуск
tr: İlk sürüm

source: New Languages: French
ru: Новый язык: французский
tr: Yeni Diller: Fransızca
