Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/systrayList/*/systrayList.po
Languages: ko, ru, tr

source: Shows the list of buttons on the System Tray. If pressed twice quickly, shows the items on the taskbar.
ko: 시스템 트레이에 표시된 버튼을 나열합니다. 두 번 빨리 누르면 작업 표시줄에 표시된 항목들을 나열합니다.
ru: Показывает список кнопок на системном лотке. При быстром двойном нажатии, показывает элементы на панели задач.
tr: Sistem tepsisi düğmelerini gösterir. İki kez basıldığında ise, görev çubuğu simgeleri görüntülenir.

source: System Tray List
ko: 시스템 트레이 목록
ru: Список Системного Лотка
tr: Sistem tepsisi

source: Icons on the System Tray:
ko: 시스템 트레이에 표시된 아이콘:
ru: Значки Системного Лотка:
tr: Sistem tepsisindeki simgeler:

source: Taskbar List
ko: 작업 표시줄 목록
ru: Список Панели Задач
tr: Görev Çubuğu Listesi

source: Icons of running applications on the taskbar:
ko: 작업 표시줄에 표시된 실행중인 응용 프로그램 아이콘:
ru: Значки запущенных приложений на панели задач:
tr: Çalışan uygulamaların Görev çubuğundaki simgeleri:

source: &Left Click
ko: 왼쪽 버튼 클릭 (&L)
ru: &Левый Щелчок
tr: &sol tık

source: Left &Double Click
ko: 왼쪽 버튼 두번 클릭 (&D)
ru: Левый &Двойной Щелчок
tr: Sol çift &tık

source: &Right Click
ko: 오른쪽 버튼 클릭 (&R)
ru: &Правый Щелчок
tr: s&ağ tık

source: SysTrayList
ko: 시스템 트레이 목록
ru: Список Системного Лотка
tr: SisTepList

source: Shows the list of buttons on the System Tray with NVDA+F11 once, twice shows running task lists.
ko: NVDA+F11을 사용하여 시스템 트레이 목록을 알려줍니다. 두번 누르면 작업 표시줄 목록을 보여줍니다.
ru: При однократном нажатии NVDA+F11 показывает список кнопок на системном лотке, при двойном - список выполняемых задач.
tr: Sistem tepsisi simgelerini görüntüler. İki kez basıldığında ise, görev çubuğu simgeleri görüntülenir.
