Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/systrayList/*/systrayList.xliff
Languages: ru

source: systrayList #
ru: список Системного Лотка #

source: Authors: Rui Fontes, Rui Batista, Joseph Lee, NVDA Community contributors
ru: Авторы: Rui Fontes, Rui Batista, Joseph Lee, Участники сообщества NVDA

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]

source: NVDA compatibility: 2019.3 and beyond
ru: Совместимость с NVDA: 2019.3 и выше

source: This add-on allows you to read and activate icons on the system tray or the task bar, within a list box, for easy access and interaction to those items. With the add-on installed, press NVDA+f11 once for this dialog to pop-up with system tray elements, and press twice to display task bar elements, which are the currently running applications.
ru: Это дополнение позволит читать и активировать значки области уведомлений или панели задач, предоставляя их список для удобного с ними взаимодействия. После установки дополнения, нажмите NVDA+f11 однократно для вызова окна со списком значков области уведомлений или дважды быстро для вызова списка значков панели задач с запущенными приложениями.

source: Note that you can access the windows system tray in any screen reader software using the Windows+B, and the task bar by pressing Windows+T. This plugin is only useful to make the transition from JAWS for Windows smoother and to avoid some tooltips that may pop-up when cycling through the system tray with the windows keyboard means.
ru: Обратите внимание, что вы можете получить доступ к системному лотку Windows в любом программном обеспечении для чтения с экрана, нажав Windows+B, а к панели задач - нажав Windows+T. Этот плагин полезен только для того, чтобы сделать переход от JAWS к Windows более плавным и избежать некоторых всплывающих подсказок, которые могут появляться при циклическом перемещении по системному лотку с помощью клавиатуры Windows.

source: Changes for 4.0 2020-01-03 ##
ru: Изменения в версии 4.0 2020-01-03 ##

source: Requires NVDA 2019.3 or later.
ru: Требуется NVDA 2019.3 или выше.

source: No more support for Windows versions earlier than Windows 7 Service Pack 1.
ru: Более ранние версии Windows, чем Windows 7 с пакетом обновления 1, больше не поддерживаются.

source: Add-on has been renamed to "SysTrayList".
ru: Дополнение было переименовано в "SysTrayList".

source: Donation request dialog will no longer appear when installing or updating the add-on.
ru: Диалог запроса пожертвования больше не будет отображаться при установке или обновлении дополнения.

source: Changes for 3.2 2018-12-24 ##
ru: Изменения в версии 3.2 2018-12-24 ##

source: More code changes to support Python 3.
ru: Дополнительные изменения в коде для поддержки Python 3.

source: Changes for 3.1 2018-11-24 ##
ru: Изменения в версии 3.1 2018-11-24 ##

source: Internal changes to support future NVDA releases.
ru: Внутренние изменения для поддержки будущих выпусков NVDA.

source: Changes for 3.0 2018-10-25 ##
ru: Изменения в версии 3.0 2018-10-25 ##

source: Support for Windows releases earlier than Windows 7 Service Pack 1 will end in 2019.
ru: Поддержка версий Windows, более ранних, чем Windows 7 с пакетом обновления 1, завершится в 2019 году.

source: Add-on is Python 3 compatible.
ru: Дополнение совместимо с Python 3.

source: Changes for 2.0 2017-05-20 ##
ru: Изменения в версии 2.0 2017-05-20 ##

source: Systray/taskbar dialog is now centered on screen.
ru: Диалоги Системного лотка/панели задач теперь выровнены по центру экрана.

source: Fixed various user interface issues.
ru: Исправлены различные проблемы пользовательского интерфейса.

source: New and updated translations.
ru: Новые и обновленные переводы.

source: Changes for 1.5 2015-mm-dd ##
ru: Изменения в версии 1.5 2015-mm-dd ##

source: Corrected left/right click action.
ru: Исправлено действие левого/правого щелчка.

source: Add-on help is now available from add-ons manger.
ru: Справка дополнения доступна в диспетчере дополнений.

source: Translation updates.
ru: Обновления перевода.

source: Changes for 1.4 - 2013-01-19 ##
ru: Изменения в версии 1.4 - 2013-01-19 ##

source: Requires NVDA 2012.3beta2 or greater.
ru: Требуется NVDA 2012.3beta2 или выше.

source: Add donation request to installation procedure
ru: Добавлен запрос пожертвования в процедуру установки

source: Implemented taskbar support
ru: Реализована поддержка панели задач

source: New translations: Arabic, Bulgarian, Dutch, Finnish, Galician, Greek, Hungarian, Italian, Japanese, Korean, Nepali, Norwegian, Polish, Brazilian Portuguese, Russian, Slovak, Tamil, Traditional Chinese Hong Kong.
ru: Новые переводы: арабский, болгарский, голландский, финский, галисийский, греческий, венгерский, итальянский, японский, корейский, непальский, норвежский, польский, португальский, русский, словацкий, тамильский, традиционный китайский Гонконг.

source: Changes for 1.3 - 2012-05-25 ##
ru: Изменения в версии 1.3 - 2012-05-25 ##

source: Converted to an add-on package
ru: Преобразован в пакет дополнения

source: French and Turkish Translations.
ru: Французский и турецкий переводы.

source: Changes for 1.2 - 2012-04.25 ##
ru: Изменения в версии 1.2 - 2012-04.25 ##

source: Spanish and German translations. Thanks to all that contributed.
ru: Переводы на испанский и немецкий. Спасибо всем, кто внес свой вклад.

source: Changes for 1.1 - 2012-03-20 ##
ru: Изменения в версии 1.1 - 2012-03-20 ##

source: Corrected a bug that was making it impossible to use the plugin when a gettext translation is not available
ru: Исправлена ​​ошибка, которая делала невозможным использование плагина когда перевод Gettext не доступен

source: Changes for 1.0 - 2012-03-19 ##
ru: Изменения в версии 1.0 - 2012-03-19 ##

source: Initial Release
ru: Первоначальный выпуск
