Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/dayOfTheWeek/*/dayOfTheWeek.po
Languages: fi, ru, tr, zh_tw

source: You can select a day with the vertical arrows
fi: Voit valita päivän nuolinäppäimillä ylös ja alas
ru: Можно выбрать день вертикальными стрелками
tr: Yukarı-aşağı yön tuşlarıyla bir gün seçebilirsiniz
zh_tw: 您可以使用上下方向鍵選取日期

source: Select a day
fi: Valitse päivä
ru: Выберите день
tr: Gün seçin
zh_tw: 選取日期

source: You can select a month with the vertical arrows
fi: Voit valita kuukauden nuolinäppäimillä ylös ja alas
ru: Можно выбрать месяц вертикальными стрелками
tr: Yukarı-aşağı yön tuşlarıyla bir ay seçebilirsiniz
zh_tw: 您可以使用上下方向鍵選取月份

source: Select a month
fi: Valitse kuukausi
ru: Выберите месяц
tr: Ay seçin
zh_tw: 選取月份

source: You can select a year with the vertical arrows
fi: Voit valita vuoden nuolinäppäimillä ylös ja alas
ru: Можно выбрать год вертикальными стрелками
tr: Yukarı-aşağı yön tuşlarıyla bir yıl seçebilirsiniz
zh_tw: 您可以使用上下方向鍵選取年份

source: Select a year
fi: Valitse vuosi
ru: Выберите год
tr: Yıl seçin
zh_tw: 選取年份

source: Get the day of the week
fi: Selvitä viikonpäivä
ru: Узнать день недели
tr: Bu tarih hangi gün
zh_tw: 設定日期查詢

source: Type or select a date
fi: Kirjoita tai valitse päivämäärä
ru: Введите или выберите дату
tr: Yazın veya bir tarih seçin
zh_tw: 輸入或選取一個日期

source: Your day
fi: Päivä
ru: Ваш день
tr: Seçtiğiniz gün
zh_tw: 您的日期是

source: Configuration of the addon {0}
fi: {0}-lisäosan asetukset
ru: Конфигурация дополнения {0}
tr: {0} eklenti konfigürasyonu
zh_tw: {0} 附加元件的設定

source: Day of the week
fi: Viikonpäivä
ru: День недели
tr: Bu tarih hangi gün
zh_tw: 日期查詢

source: Short
fi: Lyhyt
ru: Крадко
tr: Kısa
zh_tw: 簡略

source: Long
fi: Pitkä
ru: Полно
tr: Uzun
zh_tw: 詳細

source: Off
fi: Ei käytössä
ru: Выключено
tr: Kapalı
zh_tw: 關

source: En&able the accessibility of the date selector:
fi: Ot&a käyttöön päivämäärävalitsimen saavutettavuus
ru: Вклю&чить специальные возможности для выбора даты:
tr: Tarih s&eçicinin erişilebilirliğini etkinleştir:
zh_tw: 啟用日期選取器的無障礙功能(&A)：

source: Level of the announces of &labels:
fi: Se&litteiden ilmoitustaso:
ru: Уровень объявлений &меток:
tr: Yönlendirme mesaj uzunluğu:
zh_tw: 讀出標籤的等級(&L)：

source: Enable announcements of the current date field value only, when moving &vertically:
fi: Ilmoita nykyisen päivämääräkentän arvo vain siirryttäessä &nuolilla ylös ja alas
ru: Включить объявления поля текущей даты только при движении по &вертикали:
tr: &Dikey hareket ederken yalnızca mevcut alandaki değeri seslendir:
zh_tw: 垂直移動時，僅讀出目前日期欄位的值(&V)：

source: Day of the &week...
fi: Vii&konpäivä...
ru: День &недели...
tr: &Bu tarih hangi gün...
zh_tw: 日期查詢(&W)……

source: Search a day in the calendar
fi: Etsi päivä kalenterista
ru: Поиск дня в календаре
tr: Takvimde gün arama
zh_tw: 在日曆中搜尋一天

source: {0} add-on and its settings
fi: {0}-lisäosa ja sen asetukset
ru: дополнение {0} и его настройки
tr: {0} eklentisi ve ayarları
zh_tw: {0}附加元件和設定

source: Search a &day
fi: Etsi &päivä
ru: Поиск &дня
tr: &Gün arama
zh_tw: 搜尋日期(&D)

source: {0} add-on se&ttings
fi: {0}-lisäosan a&setukset
ru: Нас&тройки дополнения {0}
tr: {0} eklenti a&yarları
zh_tw: {0}附加元件設定(&T)

source: Configure the {0} add-on
fi: Määritä {0}-lisäosan asetukset
ru: Сконфигурировать дополнение {0}
tr: {0} eklentisini konfigüre et
zh_tw: 設定{0}附加元件

source: Allows you to find the day of the week corresponding to a chosen date.
fi: Mahdollistaa valittua päivämäärää vastaavan viikonpäivän selvittämisen.
ru: Позволяет определить день недели, соответствующий указанной дате.
tr: Seçilen tarihe tekabül eden günü öğrenmenizi sağlar.
zh_tw: 可讓您找出所選日期對應的星期幾。

source: Allows you to open the {0} add-on settings dialog.
fi: Avaa {0}-lisäosan asetusvalintaikkunan.
ru: Позволяет открыть диалог настроек дополнения {0}.
tr: {0} eklenti Ayarları iletişim kutusunu açar.
zh_tw: 開啟 {0} 附加元件的設定對話框。

source: With this add-on, you'll be able to find the day of the week corresponding to a chosen date.
fi: Tällä lisäosalla on mahdollista selvittää valittua päivämäärää vastaava viikonpäivä.
ru: Это дополнение позволяет определить день недели, соответствующий указанной дате.
tr: Seçilen tarihe tekabül eden günü öğrenmenizi sağlar.
zh_tw: 透過此附加元件，您將能找出所選日期對應的星期幾。
