Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/dayOfTheWeek/*/dayOfTheWeek.xliff
Languages: ru

source: Day of the week #
ru: День недели #

source: Authors: Abdel, Noelia.
ru: Авторы: Abdel, Noelia.

source: download [stable version][1]
ru: загрузить [стабильную версию][1]

source: download [development version][2]
ru: загрузить [разрабатываемую версию][2]

source: This add-on allows you to find a day of the week corresponding to a chosen date.
ru: Это дополнение позволяет определить день недели, соответствующий указанной дате.

source: It adds a submenu in the NVDA Tools menu named "Day of the week", containing 2 items:
ru: Оно добавляет подменю "день недели" в подменю NVDA "Сервис", содержащий 2 пункта:

source: The first one named "Search a day", opens a dialog composed of 3 controls:
ru: Первый из них, "Поиск дня", открывает диалог, состоящий из 3 элементов управления:

source: A listbox to choose or type your date;
ru: Список для выбора или ввода нужной вам даты;

source: An "OK" button to display a messageBox containing your day;
ru: Кнопка "OK", которая отобразит сообщение с именем дня;

source: A "Cancel" button to close the dialog.
ru: Кнопка "Cancel", чтобы закрыть этот диалог.

source: The second one named "dayOfTheWeek add-on settings" opens the parameters of the add-on to specify whether you want to report labels for date fields or not, it is composed of the following elements:
ru: Второй, "Сконфигурировать дополнения DayOfTheWeek", открывает параметры дополнения, чтобы указать, хотите ли вы отображать метки для полей даты или нет, он состоит из следующих элементов:

source: Enable accessibility of the date selector;
ru: Включить специальные возможности для выбора даты;

source: Level of the announces of labels, you will then have 3 choices:
ru: Уровень объявлений меток, в котором у вас будет 3 варианта выбора:

source: Long (it's the default choice);
ru: Полно (это выбор по умолчанию);

source: Short (for short announcements);
ru: Кратко (для коротких объявлений);

source: Off (to disable labels announcements).
ru: Отключено (чтобы отключить объявления меток).

source: Enable announcement of the current date field value only, when moving vertically;
ru: Включить объявление только текущего значения поля даты при перемещении по вертикали;

source: An "OK" button to save your configuration;
ru: Кнопка "OK" для сохранения вашей конфигурации;

source: A "Cancel" button to cancel and close the dialog.
ru: Кнопка "Cancel" для отмены и закрытия этого диалога.

source: Notes ##
ru: Примечания ##

source: You can close these dialogs just by pressing Escape;
ru: Вы также можете закрыть эти диалоги, просто нажав клавишу Escape;

source: You can assign a shortcut to open these dialogs in "Input gestures" menu and, more precisely, in the "Day of the week" category;
ru: Вы можете назначить горячие клавиши для открытия этих диалогов в разделе "Жесты ввода", перейдя в раздел "День недели";

source: If you use NVDA 2018.2 or higher, you'll find only one item in the tool menu for searching your day, the add-on settings will be in the NVDA settings panel.
ru: Если вы используете NVDA 2018.2 или выше, в меню сервиса вы найдете только один пункт для поиска нужного дня, дополнительные настройки будут находиться на панели настроек NVDA.

source: Compatibility ##
ru: Совместимость ##

source: This add-on is compatible with the versions of NVDA ranging from 2019.3 and beyond.
ru: Это дополнение совместимо с версиями NVDA, начиная с 2019.3 и выше.

source: Changes for 20231015.0.0 ##
ru: Изменения для 20231015.0.0 ##

source: Fixed a bug detected when navigating with up arrow from the date picker in the latest versions of NVDA.
ru: Исправлена ошибка, обнаруженная при навигации со стрелкой вверх в окне выбора даты в последних версиях NVDA.

source: Changes for 20230728.0.0 ##
ru: Изменения для 20230728.0.0 ##

source: Applied the flake8 and mypy rules to the code;
ru: Применены правила к коду flake8 и mypy;

source: Changed the minimum supported NVDA version to 2019.3 to support annotations introduced in Python 3.
ru: Изменена минимальная поддерживаемая версия NVDA на 2019.3 для поддержки аннотаций, введенных в Python 3.

source: Changes for 20230607.0.0 ##
ru: Изменения для 20230607.0.0 ##

source: Added the following workflows:
ru: Добавлены следующие рабочие процессы:

source: auto-update-translations - to automatically update translations from NVDA's translation system.
ru: auto-update-translations -для автоматического обновления переводов из системы перевода NVDA.

source: release-on-tag..yaml: to build and publish the addon as soon as a new tag is pushed;
ru: release-on-tag..yaml: создать и опубликовать аддон, как только нажат новый тег;

source: manual-release.yaml: to build and release new versions of the add-on manually.
ru: manual-release.yaml: Чтобы создать и выпустить новые версии дополнения вручную.

source: Updated translations.
ru: Обновлены переводы.

source: Changes for version 20230508.0.0 and beyond ##
ru: Изменения в версии 20230508.0.0 и позже ##

source: • Changed version number, minimum NVDA version and download link according to store conventions/requirements.
ru: • Изменен номер версии, минимальная версия NVDA и ссылка для скачивания в соответствии с соглашениями/требованиями магазина.

source: Changes for 19.02 ##
ru: Изменения для 19.02 ##

source: Changed version numbering using YY.MM (The year in 2 digits, followed by a dot, followed by the month in 2 digits);
ru: Изменена нумерация версий с использованием YY.MM (Год из 2 цифр, за которым следует точка, за которой следует месяц из 2 цифр);

source: Added compatibility with the new versioning format of add-on, appeared since nvda 2019.1.
ru: Добавлена совместимость с новым форматом управления версиями дополнения, появившимся после nvda 2019.1.

source: Changes for 6.0 ##
ru: Изменения для 6.0 ##

source: added the addon settings to the NVDA settings panel for NVDA 2018.2 and higher;
ru: добавлены настройки дополнения на панель настроек NVDA для NVDA 2018.2 и выше;

source: Moved the item for searching a day to the tools menu;
ru: Пункт меню поиска дня перемещён в меню сервис;

source: Added the backward compatibility of the add-on with the NVDA versions that preceded 2018.2, which included the settings panel.
ru: Добавлена обратная совместимость дополнения с версиями NVDA, предшествовавшими 2018.2, которые включали панель настроек.

source: Changes for 5.0 ##
ru: Изменения для 5.0 ##

source: Added the compatibility of the add-on with wxPython 4.0 and Python3;
ru: Добавлена совместимость дополнения с wxPython 4.0 и Python3;

source: Fixed a bug with add-on paths that contain non-ASCII characters.
ru: Исправлена ошибка с путями дополнения, которые содержат не-ASCII символы.

source: Changes for 4.0 ##
ru: Изменения для 4.0 ##

source: The add-on is now able to recognize all the regional date formats that the user can choose;
ru: Теперь дополнение способна распознавать все региональные форматы дат, которые может выбрать пользователь;

source: Added the backward compatibility of the add-on with the NVDA versions that preceded 2016.4, which included the gui.guiHelper module.
ru: Добавлена обратная совместимость дополнения с версиями NVDA, предшествовавшими 2016.4, которые включали модуль gui.guiHelper.

source: Changes for 3.1 ##
ru: Изменения для 3.1 ##

source: Back to the previous format for the day of the week because it allows to recognize a greater number of languages;
ru: Возвращён предыдущий формат дня недели, поскольку он позволяет распознавать большее количество языков;

source: Improved the accessibility of the date selector with recognition of the 3 fields 'Day', 'Month' and 'Year', and their respective values;
ru: Улучшена доступность выбора даты благодаря распознаванию 3-х полей 'День', 'Месяц' и 'Год' и их соответствующих значений;

source: Added a technique for the integration of the Georgian language for the recognition of the days of the week;
ru: Добавлена методика интеграции грузинского языка для распознавания дней недели;

source: Added a configuration dialog box to enable or disable the accessibility of the date selector;
ru: Добавлен диалог настройки для включения или отключения доступности выбора даты;

source: Moved the add-on submenu from "Tools" to "Preferences";
ru: Подменю Дополнения перенесено из "Сервис" в "Настройки";

source: Changed the add-on category to "Day of the week".
ru: Изменена категория дополнения на "День недели".

source: Changes for 2.0 ##
ru: Изменения для 2.0 ##

source: Used the gui.guiHelper module to ensure the correct appearance of the dialog asking for a date;
ru: Использован модуль gui.guiHelper, чтобы обеспечить правильное отображение диалога с запросом о дате;

source: Added the GPL license to the addon;
ru: Для дополнения Добавлено лицензия GPL;

source: Days of the week have been translated, so that the add-on works properly in the different languages;
ru: Дни недели были переведены, так что дополнение работает правильно в разных языках;

source: Changed the day format to avoid encoding errors.
ru: Изменился формат дня, чтобы избежать ошибок кодировки.

source: Changes for 1.0 ##
ru: Изменения для 1.0 ##

source: Initial version.
ru: Первая версия.
