Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/SentenceNav/*/SentenceNav.po
Languages: fi, ru, tr

source: Always
fi: Aina
ru: Всегда
tr: Her zaman

source: Only across paragraphs with same indentation and same style level
fi: Vain kappaleissa, joilla on sama sisennys- ja tyylitaso
ru: Только в абзацах с одинаковым отступом и одинаковым уровнем стиля
tr: Yalnızca aynı girinti ve aynı stildeki paragraflar arasında

source: Never
fi: Ei koskaan
ru: Никогда
tr: Hiçbir zaman

source: Volume of chime when crossing paragraph border
fi: Äänimerkin voimakkuus, kun kappaleraja ylitetään
ru: Громкость звука при пересечении границы абзаца
tr: Paragraflar arasında geçiş yaparken zil ses seviyesi

source: Volume of chime when no more sentences available
fi: Äänimerkin voimakkuus, kun lauseita ei ole enempää
ru: Громкость звука, когда больше нет предложений
tr: Daha fazla cümle olmadığında çalacak zil ses seviyesi

source: Speak message when no next sentence available in the document
fi: Puhu ilmoitus, kun asiakirjassa ei ole enempää lauseita
ru: Произнесение сообщения, когда в документе нет следующего предложения
tr: Sonraki cümle bulunamadığında konuşarak uyar

source: Speak formatted text
fi: Puhu muotoiltu teksti
ru: Произносить форматированный текст
tr: Biçimlendirilmiş metni oku

source: Reconstruct sentences across multiple paragraphs when
fi: Muodosta uudelleen useisiin kappaleisiin jakautuvat lauseet
ru: Восстановление предложений в нескольких абзацах, когда
tr: Birden fazla paragraf arasında dolaşılırken cümleleri yeniden yapılandır

source: Take Wikipedia-style references into account
fi: Ota huomioon Wikipedia-tyyliset viittaukset
ru: Учитывать ссылки в стиле Википедии
tr: Wikipedia stili referansları dikkate al

source: Sentence breakers
fi: Lauseen lopetusmerkit
ru: Прерыватели предложений
tr: Cümle sonu işaretleri

source: Skippable punctuation marks
fi: Ohitettavat välimerkit
ru: Пропускаемые знаки препинания
tr: Atlanabilir noktalama işaretleri

source: Full width sentence breakers
fi: Lauseen täyden leveyden lopetusmerkit
ru: Прерыватели предложений полной ширины
tr: Tam genişlik cümle sonu işaretleri

source: Exceptional abbreviations, space separated, in language %s
fi: Välilyönnillä eroteltavat poikkeukselliset lyhenteet kielellä %s
ru: Исключаемые аббревиатуры, разделенные пробелами, в языке %s
tr: %s dilinde istisnai kısaltmalar, aralık ile ayrılmalı

source: Capital letters with no spaces in language %s
fi: Isot kirjaimet ilman välilyöntejä kielellä %s
ru: Заглавные буквы без пробелов в языке %s
tr: %s dilinde boşluksuz olarak büyük harfler

source: Lower case letters with no spaces in language %s
fi: Pienet kirjaimet ilman välilyöntejä kielellä %s
ru: Строчные буквы без пробелов в языке %s
tr: %s dilinde boşluksuz olarak küçük harfler

source: Phrase breakers
fi: Virkkeen lopetusmerkit
ru: Прерыватели фраз
tr: İfade kesiciler

source: Full width phrase breakers
fi: Virkkeen täyden leveyden lopetusmerkit
ru: Полноразмерные прерыватели фраз
tr: Tam genişlik ifade kesiciler

source: Disable SentenceNav in applications (comma-separated list)
fi: Poista Lausenavigointi käytöstä sovelluksissa (pilkulla eroteltu luettelo)
ru: Отключение Функции "SentenceNav" в приложениях (список, разделенный запятой)
tr: Cümle Dolaşımı eklentisinin devre dışı bırakılacağı uygulamalar, virgül ile ayrılmış liste

source: Enable experimental support for Microsoft Word and WordPad (overrides default NVDA functionality)
fi: Ota käyttöön kokeellinen Microsoft Wordin ja WordPadin tuki (ohittaa NVDA: n oletustoiminnallisuuden)
ru: Включение экспериментальной поддержки Microsoft Word и WordPad (переопределяет функции NVDA по умолчанию)
tr: Microsoft Word ve WordPad için deneysel desteği etkinleştirin (varsayılan NVDA işlevini geçersiz kılar)

source: Move to next sentence.
fi: Siirrä seuraavaan lauseeseen.
ru: Перейти к следующему предложению.
tr: Sonraki cümleye git.

source: No next sentence
fi: Ei enempää lauseita
ru: Нет следующего предложения
tr: İleride Cümle yok

source: Move to previous sentence.
fi: Siirrä edelliseen lauseeseen.
ru: Перейти к предыдущему предложению.
tr: Önceki cümleye git.

source: No previous sentence
fi: Ei enempää edellisiä lauseita
ru: Нет предыдущего предложения
tr: Geride cümle yok

source: Speak current sentence.
fi: Puhu nykyinen lause.
ru: Произнеси текущее предложение.
tr: Mevcut cümleyi oku.

source: Move to next phrase.
fi: Siirrä seuraavaan virkkeeseen.
ru: Перейти к следующей фразе.
tr: Sonraki ifadeye git.

source: No next phrase
fi: Ei enempää virkkeitä
ru: Нет следующей фразы
tr: İleride ifade yok

source: Move to previous phrase.
fi: Siirrä edelliseen virkkeeseen.
ru: Перейти к предыдущей фразе.
tr: Önceki ifadeye git.

source: No previous phrase
fi: Ei enempää edellisiä virkkeitä
ru: Нет предыдущей фразы
tr: Geride ifade yok

source: Speak current phrase.
fi: Puhu nykyinen virke.
ru: Произнеси текущую фразу.
tr: Mevcut ifadeyi oku.

source: SentenceNav
fi: Lausenavigointi
tr: Cümle Dolaşımı

source: Sentence Navigation addon. SentenceNav is an NVDA add-on that allows you to read text by sentences, as opposed to by paragraphs or words.
fi: Lausenavigointilisäosa. Lausenavigointi on lisäosa, jonka avulla tekstiä voi lukea lause kerrallaan kappaleiden tai sanojen sijaan.
ru: Дополнение навигации по предложениям. SentenceNav - это дополнение для NVDA, которая позволяет читать текст по предложениям, а не по абзацам или словам.
tr: Cümle Navigasyon eklentisi. Cümle Dolaşımı metni cümle cümle okumanıza olanak tanıyan bir eklentidir.
