Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/SentenceNav/*/SentenceNav.xliff
Languages: ru, tr

source: nvda-sentence-nav
tr: nvda cümle dolaşımı

source: SentenceNav is an NVDA add-on that allows you to read text by sentences, as opposed to by paragraphs or words.
ru: SentenceNav - это дополнение, позволяющее читать текст не только по словам и абзацам, но и по предложениям.
tr: Cümle dolaşımı, metni paragraflar veya kelimeler yerine cümlelerle okumanızı sağlayan bir NVDA eklentisidir.

source: Please note that "Jump to next paragraph with text" feature has been move to [TextNav](http://github.com/mltony/nvda-text-nav/) add-on that needs to be installed separately.
ru: Пожалуйста, обратите внимание, что функция "Перейти к следующему абзацу с текстом" была перенесена в дополнение [TextNav](http://github.com/mltony/nvda-text-nav/), которое необходимо установить отдельно.
tr: "Metin içeren bir sonraki paragrafa atla" özelliğinin ayrıca yüklenmesi gereken [MetinDolaşımı](http://github.com/mltony/nvda-text-nav/) eklentisine taşındığını lütfen unutmayın.

source: Keystrokes
ru: Комбинации клавиш
tr: Klavye Komutları

source: Alt+Down: Go to next sentence.
ru: Alt+Стрелка вниз: Перейти к следующему предложению.
tr: Alt+Aşağı: Bir sonraki cümleye gider.

source: Alt+Up: Go to previous sentence.
ru: Alt+Стрелка вверх: Перейти к предыдущему предложению.
tr: Alt+Yukarı: Önceki cümleye gider.

source: NVDA+Alt+S: Speak current sentence.
ru: NVDA+Alt+S: Произнести текущее предложение.
tr: NVDA+Alt+S: Geçerli cümleyi söyler.

source: Alt+Windows+Down: Go to next phrase.
ru: Alt+Windows+Стрелка вниз: Перейти к следующей фразе.
tr: Alt+Windows+Aşağı: Sonraki ifadeye gider.

source: Alt+Windows+Up: Go to previous phrase.
ru: Alt+Windows+Стрелка вверх: Перейти к предыдущей фразе.
tr: Alt+Windows+Yukarı: Önceki ifadeye gider.

source: Please note that "Jump to next paragraph with text" feature has been move to [TextNav](http://github.com/mltony/nvda-text-nav/) add-on that needs to be installed separately.
ru: Пожалуйста, обратите внимание, что функция "Перейти к следующему абзацу с текстом" была перенесена в дополнение [TextNav](http://github.com/mltony/nvda-text-nav/), которое необходимо установить отдельно.
tr: "Metin içeren bir sonraki paragrafa atla" özelliğinin ayrıca yüklenmesi gereken [MetinDolaşımı](http://github.com/mltony/nvda-text-nav/) eklentisine taşındığını lütfen unutmayın.

source: Notes and known issues
ru: Примечания и известные проблемы
tr: Notlar ve bilinen sorunlar

source: Sentence markup is done by heuristic algorithms and is not 100% accurate. Expect SentenceNav to occasionally make mistakes, such as breaking a sentence where it's not supposed to be broken or the other way around - missing a border between two sentences and speaking them together.
ru: Разметка предложений выполняется с помощью эвристических алгоритмов и не является точной на 100%. Ожидайте, что SentenceNav время от времени будет допускать ошибки, например, прерывать предложение там, где оно не должно было прерываться, или наоборот - пропускать границу между двумя предложениями и произносить их слитно.
tr: Cümle işaretleme sezgisel algoritmalar tarafından yapılır ve %100 doğru değildir. Cümle Dolaşımı'nın zaman zaman hatalar yapması beklenebilir, örneğin bir cümleyi kırılmaması gereken yerde kırmak veya tam tersi şekilde iki cümle arasındaki sınırı kaçırmak ve bunları birlikte konuşmak gibi.

source: Experimental support for Microsoft Word and WordPad has been added as of version 2.8.
ru: Начиная с версии 2.8 была добавлена экспериментальная поддержка Microsoft Word и WordPad.
tr: 2.8 sürümünden itibaren Microsoft Word ve WordPad için deneysel destek eklenmiştir.

source: Sentence navigation keystrokes Alt+Up/Down might conflict with built-in keystrokes in applications. SentenceNav developers strive to resolve these conflicts whenever possible. However, if you encounter such a situation, a simple workaround is to press NVDA+F2 (Pass next key through), followed by the conflicting keystroke Alt+Up/Down to make sure that this keystroke would be processed by the application and not by SentenceNav.
ru: Комбинации клавиш навигации по предложениям Alt+Up/Down могут конфликтовать со встроенными в приложения. Разработчики SentenceNav стремятся устранять эти конфликты, когда это возможно. Однако, если вы столкнётесь с такой ситуацией, простым решением будет нажать NVDA + F2 (пропуск клавиши), а затем выполнить конфликтующее нажатие клавиши Alt+Вверх / вниз, чтобы убедиться, что это нажатие будет обработано приложением, а не SentenceNav.
tr: Cümle dolaşımı tuş vuruşları Alt+Yukarı/Aşağı, uygulamalardaki yerleşik tuş vuruşlarıyla çakışabilir. Cümle Dolaşımı geliştiricileri mümkün olduğunca bu çatışmaları çözmek için çaba göstermektedir. Ancak, böyle bir durumla karşılaşırsanız, bu tuş vuruşunun Cümle Dolaşımı tarafından değil, uygulama tarafından işleneceğinden emin olmak için NVDA + F2 (Sonraki tuş vuruşunu yok say) tuşlarına basmak ve ardından çakışan tuş vuruşu Alt + Yukarı / Aşağı tuşlarına basmak basit bir çözümdür.

source: Algorithm
ru: Алгоритм
tr: Algoritma

source: SentenceNav uses a regular expression to find sentence boundaries. The regular expression is looking for:
ru: SentenceNav использует регулярное выражение для определения границ предложений. Регулярное выражение выполняет поиск:
tr: Cümle Dolaşımı, cümle sınırlarını bulmak için düzenli bir ifade kullanır. Düzenli ifadede şunlar aranır:

source: One or more "Sentence breaker" punctuation marks, such as period, exclamation sign or question sign, followed immediately by one or more spaces.
ru: Один или несколько знаков препинания "прерывающих предложение", таких как точка, восклицательный знак или вопросительный знак, за которыми сразу следует один или несколько пробелов.
tr: Nokta, ünlem işareti veya soru işareti gibi bir veya daha fazla "cümle bozucu" noktalama işareti ve hemen ardından bir veya daha fazla boşluk.

source: Sentence breakers can optionally be followed by one or more "Skippable" punctuation signs, such as closing parenthesis, or a quote.
ru: Разделители предложений могут дополнительно сопровождаться одним или несколькими "пропускаемыми" знаками препинания, такими как закрывающая скобка или кавычка.
tr: Cümle ayırıcılar isteğe bağlı olarak parantez kapatma veya tırnak işareti gibi bir veya daha fazla "Atlanabilir" noktalama işareti takip edebilir.

source: Sentence breakers can optionally be followed by a Wikipedia-style reference, e.g. [4], or [citation needed].
ru: При желании за разделителями предложений может следовать ссылка в стиле Википедии, например [4] или [требуется цитирование].
tr: Cümle ayırıcılar isteğe bağlı olarak Vikipedi tarzı bir referans takip edebilir, örneğin [4] veya [alıntı gerekli].

source: Sentence breakers must not be preceded by any of the exceptional abbreviations, such as Dr., Mr., Prof., etc. Exceptional abbreviations are language-dependent. Exceptional abbreviations are defined as abreviations spelled with a period, which in most cases does not indicate the end of the sentence.
ru: Перед фразеологизмами, прерывающими предложение, не должны стоять специальные сокращения, такие как "Доктор", "Мистер", "Профессор" и т.д. Специальные сокращения зависят от языка. Исключительные сокращения определяются как сокращения, написанные через точку, которая в большинстве случаев не указывает на конец предложения.
tr: Cümle ayırıcılardan önce Dr., Mr., Prof. vb. istisnai kısaltmalar gelmemelidir. İstisnai kısaltmalar dile bağlıdır. İstisnai kısaltmalar, çoğu durumda cümlenin sonunu göstermeyen nokta ile yazılan kısaltmalar olarak tanımlanır.

source: Sentence breakers must not be preceded by a single capital letter. This is to prevent sentences being broken at people's initials, such as George R. R. Martin. The list of capital letters is language-dependent.
ru: Разделители предложений не должны начинаться с заглавной буквы. Это делается для предотвращения прерывания предложений на инициалах людей, таких как Джордж Р. Р. Мартин. Список заглавных букв зависит от языка.
tr: Cümle ayırıcılardan önce tek bir büyük harf gelmemelidir. Bu, George R. R. Martin gibi insanların baş harflerinde cümlelerin kırılmasını önlemek içindir. Büyük harf listesi dile bağlıdır.

source: Alternatively, the regular expression can match one of the full-width sentence breakers. Full-width punctuation is used in some languages, like Chinese and Japanese and there is no requirement to be followed or preceded by anything to be counted as the boundary of sentences.
ru: В качестве альтернативы, регулярное выражение может соответствовать одному из разделителей предложений по всей ширине. В некоторых языках, таких как китайский и японский, используется пунктуация по всей ширине, и нет требования, чтобы после неё или перед ней стояло что-либо, что считалось бы границей предложений.
tr: Alternatif olarak, normal ifade, tam genişlikte cümle ayırıcılardan biriyle eşleşebilir. Çince ve Japonca gibi bazı dillerde tam genişlikte noktalama işaretleri kullanılır ve cümle sınırı olarak sayılmak için ardından veya önünde herhangi bir şeyin gelmesi gerekliliği yoktur.

source: Alternatively, double new line counts as a sentence breaker.
ru: В качестве альтернативы, двойная новая строка считается прерывателем предложения.
tr: Alternatif olarak, çift yeni satır cümle ayırıcı olarak sayılır.

source: Phrase detection is performed by another regular expression, that matches:
ru: Определение фразы выполняется с помощью другого регулярного выражения, которое соответствует:
tr: Cümle algılama, aşağıdakilerle eşleşen başka bir normal ifade tarafından gerçekleştirilir:

source: One or more "phrase breakers" punctuation marks followed immediately by one or more spaces.
ru: Один или несколько знаков препинания "прерывающих фразу", за которыми сразу следует один или несколько пробелов.
tr: Bir veya daha fazla "cümle bozucu" noktalama işareti ve hemen ardından bir veya daha fazla boşluk.

source: Or alternatively, one or more "fixed-width" phrase brakers, with no requirement of being followed by spaces.
ru: Или, в качестве альтернативы, один или несколько ограничителей фраз "фиксированной ширины", после которых необязательно ставить пробелы.
tr: Ya da alternatif olarak, bir veya daha fazla "sabit genişlikli" ifade frenleyicisi, ardından boşluk gelme zorunluluğu olmaksızın.

source: Or alternatively, double new line.
ru: Или, как вариант, удвоить новую строку.
tr: Veya alternatif olarak, çift yeni satır.

source: Other settings
ru: Другие настройки
tr: Diğer ayarlar

source: Reconstruct sentences across multiple paragraphs: sentences can span across multiple paragraphs. This often happnes in malformed PDF documents, or in email messages written as plain text. With this combo box you can tell SentenceNav to try to identify those sentences and speak them correctly. Sometimes however, it would speak paragraphs together that are not meant to be sentences. In this case you can disable that feature.
ru: Восстановить предложения в нескольких абзацах: предложения могут занимать несколько абзацев. Это часто случается в неправильно оформленных PDF-документах или в сообщениях электронной почты, написанных в виде обычного текста. С помощью этого комбинированного списком вы можете попросить SentenceNav попытаться идентифицировать эти предложения и правильно их произнести. Иногда, однако, он будет соединять абзацы, которые не должны быть предложениями. В этом случае вы можете отключить эту функцию.
tr: Birden fazla paragrafta cümleleri yeniden yapılandırın: cümleler birden fazla paragrafa yayılabilir. Bu genellikle hatalı biçimlendirilmiş PDF belgelerinde veya düz metin olarak yazılmış e-posta mesajlarında olur. Bu açılan kutu ile SentenceNav'a bu cümleleri tanımlamaya çalışmasını ve doğru şekilde konuşmasını söyleyebilirsiniz. Ancak bazen, cümle olması gerekmeyen paragrafları birlikte söyler. Bu durumda bu özelliği devre dışı bırakabilirsiniz.

source: Disable SentenceNav in applications: You can disable SentenceNav in certain applications. For example, some applications use Alt+Down keystroke to perform other functions. This is a comma-separated blacklist of applications where sentence navigation will be disabled. If you are not sure what should be the name of your application, switch to that application, Press NVDA+Control+Z to open up NVDA console and type: "focus.appModule.appName" without quotes to obtain the name of current application.
ru: Отключить SentenceNav в приложениях: Вы можете отключить SentenceNav в определенных приложениях. Например, некоторые приложения используют сочетание клавиш Alt+Down для выполнения других функций. Это разделенный запятыми чёрный список приложений, в которых навигация по предложениям будет отключена. Если вы не уверены, каким должно быть название вашего приложения, переключитесь на это приложение, нажмите NVDA+Control+Z, чтобы открыть консоль NVDA, и введите: "focus.AppModule.AppName" без кавычек, чтобы получить название текущего приложения.
tr: Uygulamalarda Cümle Dolaşımı'nı devre dışı bırak: Belirli uygulamalarda Cümle Dolaşımı'nı devre dışı bırakabilirsiniz. Örneğin, bazı uygulamalar diğer işlevleri gerçekleştirmek için Alt+Aşağı tuşlarını kullanır. Bu, cümle gezintisinin devre dışı bırakılacağı uygulamaların virgülle ayrılmış bir kara listesidir. Uygulamanızın adının ne olması gerektiğinden emin değilseniz, o uygulamaya geçin, NVDA konsolunu açmak için NVDA+Control+Z tuşlarına basın ve şunu yazın: "focus.appModule.appName" tırnak işaretleri olmadan yazarak mevcut uygulamanın adını öğrenin.

source: Source code
ru: Исходный код
tr: Kaynak kodu

source: Source code is available at <http://github.com/mltony/nvda-sentence-nav>.
ru: Исходный код доступен по адресу <http://github.com/mltony/nvda-sentence-nav>.
tr: Kaynak kodu şu adreste mevcuttur: <http://github.com/mltony/nvda-sentence-nav>.

source: Downloads
ru: Загрузки
tr: İndirin

source: Current stable version: [SentenceNav](https://github.com/mltony/nvda-sentence-nav/releases/latest/download/SentenceNav.nvda-addon)
ru: Текущая стабильная версия: [SentenceNav](https://github.com/mltony/nvda-sentence-nav/releases/latest/download/SentenceNav.nvda-addon)
tr: Mevcut kararlı sürüm: [CümleDolaşımı](https://github.com/mltony/nvda-sentence-nav/releases/latest/download/SentenceNav.nvda-addon)

source: Last Python 2 version (compatible with NVDA 2019.2 and prior): [SentenceNav v2.5](https://github.com/mltony/nvda-sentence-nav/releases/download/v2.5/SentenceNav-2.5.nvda-addon)
ru: Последняя версия Python 2 (совместима с NVDA 2019.2 и ниже): [SentenceNav v2.5](https://github.com/mltony/nvda-sentence-nav/releases/download/v2.5/SentenceNav-2.5.nvda-addon)
tr: Son Python 2 sürümü (NVDA 2019.2 ve öncesi ile uyumlu): [CümleDolaşımı v2.5](https://github.com/mltony/nvda-sentence-nav/releases/download/v2.5/SentenceNav-2.5.nvda-addon)
