Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/speechLogger/*/speechLogger.po
Languages: fi, ru

source: Log started
fi: Lokin tallennus aloitettu
ru: Журнал начат

source: Log ended
fi: Lokin tallennus lopetettu
ru: Журнал Закончен

source: on
ru: дата

source: at
fi: klo
ru: время

source: Toggles logging of local speech
fi: Ottaa käyttöön paikallisen puheen lokin tallennuksen tai poistaa sen käytöstä
ru: Переключает ведение журнала локальной речи

source: Stopped logging local speech.
fi: Paikallisen puheen lokin tallennus lopetettu.
ru: Остановлена запись локальной речи.

source: Started logging local speech.
fi: Paikallisen puheen lokin tallennus aloitettu.
ru: Начата запись локальной речи.

source: Local speech logging has been disabled by an error or your NVDA configuration.
fi: Paikallisen puheen lokin tallennus on poistettu käytöstä virheen tai NVDA:n asetusten vuoksi.
ru: Ведение журнала локальных речевых сообщений было отключено из-за ошибки или вашей конфигурации NVDA.

source: Toggles logging of remote speech
fi: Ottaa etäpuheen lokin tallennuksen käyttöön tai poistaa sen käytöstä
ru: Переключает ведение журнала удалённой речи

source: Stopped logging remote speech.
fi: Etäpuheen lokin tallennus lopetettu.
ru: Остановлена запись удалённой речи.

source: Started logging remote speech.
fi: Etäpuheen lokin tallennus aloitettu.
ru: Начата запись удалённой речи.

source: Could not log remote speech, probably not connected.
fi: Etäpuheen lokin tallennusta ei voitu aloittaa, koska yhteyttä ei ehkä ole muodostettu.
ru: Не удалось записать удаленную речь, возможно отсутствует подключение.

source: Failed! Could not find the NVDA Remote add-on.
fi: NVDA-etäkäyttö-lisäosaa ei löydy.
ru: Неудача! Не удалось найти дополнение Remote NVDA.

source: Remote speech logging has been disabled by an error or your NVDA configuration.
fi: Etäpuheen lokin tallennus poistettu käytöstä virheen tai NVDA:n asetusten vuoksi.
ru: Ведение журнала удалённых речевых сообщений было отключено из-за ошибки или вашей конфигурации NVDA.

source: Opens the Speech Logger add-on's settings
fi: Avaa Puhelokin tallennin -lisäosan asetukset
ru: Открывает настройки дополнения регистратора речи

source: Speech Logger
fi: Puhelokin tallennin
ru: Регистратор Речи

source: Choose the log directory and filenames for the speech logs. System variables such as %temp% are permitted. You can also alter the string used to separate multiple utterances from the same speech sequence, and control how or whether timestamps are used.
fi: Valitse puhelokien hakemisto ja tiedostonimet. Järjestelmämuuttujia, kuten %temp% voidaan käyttää. Voit myös muuttaa merkkijonoa, jota käytetään erottamaan useita katkelmia samasta puhesekvenssistä sekä määrittää, käytetäänkö aikaleimoja ja mikäli käytetään, millä tavalla.
ru: Выберите каталог журналов и имена файлов для речевых журналов. Разрешены системные переменные, такие как %temp%. Вы также можете изменить строку, используемую для разделения нескольких высказываний из одной и той же речевой последовательности, и управлять использованием меток времени.

source: The Speech Logger add-on can only be configured from the Normal Configuration profile. Please close this dialog, set your config profile to normal, and try again.
fi: Puhelokin tallennin -lisäosan asetukset voidaan määrittää vain normaalit asetukset -profiilista. Sulje tämä valintaikkuna, valitse asetusprofiiliksi "(normaalit asetukset)" ja yritä uudelleen.
ru: Дополнение регистратора речи можно настроить только в профиле конфигурации по умолчанию. Закройте этот диалог, выберите профиль конфигурации по умолчанию и повторите попытку.

source: Two spaces (NVDA log style)
fi: Kaksi välilyöntiä (NVDA:n lokityyli)
ru: Два пробела (стиль журнала NVDA)

source: Newline
fi: Rivinvaihto
ru: Новая строка

source: Tab
fi: Sarkain
ru: Табулятор

source: A comma and space
fi: Pilkku ja välilyönti
ru: Запятая и пробел

source: Two underscores
fi: Kaksi alaviivaa
ru: Два символа подчёркивания

source: Custom
fi: Mukautettu
ru: Пользовательский

source: Off, no timestamps
fi: Ei käytössä (ei aikaleimoja)
ru: Отключён, без меток времени

source: When a log begins or ends
fi: Kun lokintallennus alkaa tai loppuu
ru: Когда начинается или заканчивается журнал

source: Never
fi: Ei koskaan
ru: Никогда

source: Always
fi: Aina
ru: Всегда

source: Log &Directory:
fi: Loki&hakemisto:
ru: &Каталог журнала:

source: Browse...
fi: Selaa...
ru: Обзор...

source: Select log directory
fi: Valitse lokihakemisto
ru: Выберите каталог журнала

source: Local speech log filename:
fi: Paikallisen puheen lokitiedoston nimi:
ru: Имя файла журнала локальной речи:

source: Remote speech log filename:
fi: Etäpuheen lokitiedoston nimi:
ru: Имя файла журнала удалённой речи:

source: &Separator Options
fi: E&rottimen asetukset
ru: Настройки &Разделителя

source: Utterance separator
fi: Katkelmaerotin
ru: Разделитель звуков

source: Custom utterance separator (can use escapes like \t):
fi: Mukautettu katkelmaerotin (koodeja, kuten \t voidaan käyttää):
ru: Пользовательский разделитель звуков (можно использовать экранирующие элементы типа \t):

source: &Other Options
fi: &Muut asetukset
ru: &Другие Настройки

source: Timestamp Mode
fi: Aikaleimatila
ru: Режим меток времени

source: Log speech during Say-&All (read to end)
fi: Tallenna puhelokia &jatkuvaa lukua käytettäessä
ru: Записывать речь в режиме "читать &всё" (чтения до конца)

source: Begin logging at startup
fi: Aloita lokin tallennus käynnistettäessä
ru: Начинать запись в журнал при запуске

source: Logs speech utterances to a file, after the user presses an initiating key. Can also log NVDA remote session speech from the NVDA Remote add-on, to the same or another file. Optionally includes speech from say-all.
fi: Tallentaa puhekatkelmat tiedostoon, kun käyttäjä painaa tallennuksen aloittavaa näppäinkomentoa. Voi tallentaa myös NVDA:n etäistunnon puheen NVDA-etäkäyttö-lisäosasta samaan tai eri tiedostoon. Sisältää valinnaisesti jatkuvan luvun puheen.
ru: Записывает речевые высказывания в файл после того, как пользователь нажмёт клавишу запуска. Также можно записывать речь удалённого сеанса NVDA из дополнения NVDA Remote в тот же или другой файл. Дополнительно включает запись речи в режиме "читать всё".
