Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/speechLogger/*/speechLogger.xliff
Languages: ru, tr

source: NVDA Speech Logger add-on
ru: Дополнение регистратора речи NVDA
tr: NVDA Konuşma Kaydedici eklentisi

source: Author: Luke Davis, with contributions by James Scholes
ru: Автор: Luke Davis, при участии James Scholes
tr: Yazar: Luke Davis, James Scholes'un katkılarıyla

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı sürümü indirin][1]

source: NVDA compatibility: 2019.3.1 and later
ru: Совместимость с NVDA: 2019.3.1 и выше
tr: NVDA uyumluluğu: 2019.3.1 ve sonrası

source: An [NVDA][3] add-on to log speech to a file or files.
ru: Дополнение для [NVDA][3], записывающее речь в файл или файлы журнала.
tr: Konuşmayı bir dosyaya veya dosyalara kaydetmek için bir [NVDA][3] eklentisi. Yerel makinede oluşturulan konuşmayı bir metin dosyasına kaydedebilir. Ayrıca, [NVDA Remote][5] eklentisi aracılığıyla uzaktaki bir makineden alınan konuşmayı aynı veya farklı bir dosyaya kaydedebilir.

source: It can log speech generated on the local machine into a text file.
ru: Оно может записывать речь, сгенерированную на локальном компьютере, в текстовый файл.
tr: Yerel makinede oluşturulan konuşmayı bir metin dosyasına kaydedebilir.

source: It can also log speech from a remote machine received through the [NVDA Remote][5] add-on, either to the same or a different file.
ru: Также оно может записывать речь с удалённого компьютера, полученную через дополнение [NVDA Remote][5], либо в тот же, либо в другой файл.
tr: Ayrıca, [NVDA Remote][5] eklentisi aracılığıyla alınan uzak bir makineden gelen konuşmayı aynı veya farklı bir dosyaya kaydedebilir.

source: **Note**: This feature is untested with NVDA's built in remote function, as of June, 2025.
ru: **Примечание**: Эта функция не проверена со встроенной удалённой функцией NVDA по состоянию на июнь 2025 года.
tr: **Not**: Bu özellik, 2025 yılının Haziran ayı itibarıyla NVDA'nın yerleşik uzaktan Erişim işleviyle test edilmemiştir.

source: Configuration
ru: Конфигурация
tr: Yapılandırma

source: To configure this add-on, open the NVDA menu, go to Preferences, then Settings, then Speech Logger (NVDA+N, P, S, then press S until you get there, on a default U.S. English keyboard).
ru: Чтобы настроить это дополнение, откройте меню NVDA, перейдите в "Параметры", затем "Настройки", затем "Регистратор речи" (NVDA+N, P, S, затем нажимайте S, пока не дойдете до нужной точки, на клавиатуре, используемой по умолчанию для английского языка в США).
tr: Bu eklentiyi yapılandırmak için NVDA menüsünü açın, Tercihler'e, ardından Ayarlar'a ve ardından Konuşma Kaydedici'ye gidin (NVDA+N, T, L, ardından varsayılan ABD İngilizce klavyede oraya ulaşana kadar K tuşuna basın).

source: There is also an unassigned gesture in the Input Gestures "Configuration" category, which you can assign and use to quickly open the add-on's settings directly.
ru: В категории "Конфигурация" жестов ввода также есть неназначенный жест, который вы можете назначить и использовать для быстрого непосредственного открытия настроек дополнения.
tr: Ayrıca, Girdi Hareketleri "Konfigürasyon" kategorisinde, eklentinin ayarlarını doğrudan hızlı bir şekilde açmak için atayabileceğiniz ve kullanabileceğiniz atanmamış bir hareket de vardır.

source: Note: the add-on can only be configured while in the Normal Configuration profile of NVDA.
ru: Примечание: дополнение можно настроить, только находясь в обычном профиле конфигурации NVDA.
tr: Not: eklenti yalnızca NVDA'nın Normal Konfigürasyon profilindeyken yapılandırılabilir.

source: The add-on is not profile-aware.
ru: Это дополнение не поддерживает работу с разными профилями.
tr: Eklenti profile duyarlı değildir.

source: If you can think of some use case that requires it to operate differently in different profiles, please contact the author or file an issue on the [GitHub repo][2].
ru: Если вы можете решить, как его использовать в случае, если требуется, чтобы оно работало по-разному в разных профилях, пожалуйста, свяжитесь с автором или отправьте сообщение о проблеме на [репозиторий GitHub][2].
tr: Farklı profillerde farklı şekilde çalışmasını gerektiren bir kullanım durumu düşünebiliyorsanız, lütfen yazarla iletişime geçin veya [GitHub deposu][2] üzerinden bir sorun bildirin.

source: The following settings are available:
ru: Доступны следующие настройки:
tr: Aşağıdaki ayarlar mevcuttur:

source: The log directory. You can enter or browse for your desired destination directory, which must already exist. System variables such as %temp%, %userprofile%, etc., can be used in this field.
ru: Каталог журнала. Вы можете ввести или просмотреть нужный каталог назначения, который должен уже существовать. В этом поле можно использовать системные переменные, такие как %temp%, %userprofile% и т.д.
tr: Günlük dizini. Halihazırda var olması gereken, istediğiniz hedef dizini girebilir veya bu dizine göz atabilirsiniz. Bu alanda %temp%, %userprofile% gibi sistem değişkenleri kullanılabilir.

source: Local log filename. The created file will be placed in the above directory. This will contain speech logged while the local log mode is engaged. This can be the same as the remote log file. Leave blank to disable this kind of logging completely.
ru: Имя файла локального журнала. Созданный файл будет помещен в указанный выше каталог. В нём будет содержаться речь, записываемая в режиме локального журнала. Это может быть тот же файл, что и в удаленном журнале. Оставьте поле пустым, чтобы полностью отключить этот вид ведения журнала.
tr: Yerel günlük dosya adı. Oluşturulan dosya yukarıdaki dizine yerleştirilecektir. Bu, yerel günlük modu devredeyken günlüğe kaydedilen konuşmayı içerecektir. Bu, uzak günlük dosyasıyla aynı olabilir. Bu tür günlüğü tamamen devre dışı bırakmak için boş bırakın.

source: Remote log filename. The created file will be placed in the above directory. This will contain speech logged while the remote log mode is engaged. It can be the same as the local log file. Leave blank to disable this kind of logging completely.
ru: Имя файла удалённого журнала. Созданный файл будет помещен в указанный выше каталог. В нём будет содержаться речь, записываемая в режиме удаленного журнала. Это может быть тот же файл, что и в локальном журнале. Оставьте поле пустым, чтобы полностью отключить этот вид ведения журнала.
tr: Uzak günlük dosya adı. Oluşturulan dosya yukarıdaki dizine yerleştirilecektir. Bu, uzak günlük modu devredeyken günlüğe kaydedilen konuşmayı içerecektir. Yerel günlük dosyasıyla aynı olabilir. Bu tür günlüğü tamamen devre dışı bırakmak için boş bırakın.

source: Separator. This combobox lets you choose one of the available utterance separators. See below for more information.
ru: Разделитель. В этом выпадающем списке можно выбрать один из доступных разделителей звуков. Дополнительную информацию смотрите ниже.
tr: Ayırıcı. Bu birleşik giriş kutusu, mevcut ifade ayırıcılardan birini seçmenize izin verir. Daha fazla bilgi için aşağıya bakın.

source: Custom separator. This field lets you enter a custom utterance separator (see below), which is used if "custom" is chosen in the combobox.
ru: Пользовательский разделитель. Это поле позволяет ввести пользовательский разделитель звуков (см. ниже), который используется, если в выпадающем списке выбрано "пользовательский".
tr: Özel ayırıcı. Bu alan, açılan kutuda "özel" seçilirse kullanılan özel bir deyim ayırıcı (aşağıya bakın) girmenizi sağlar.

source: Timestamp mode. This combobox allows you to choose between no timestamps, and a timestamp at the start and end of each log session.
ru: Режим меток времени. Это поле со списком позволяет вам выбирать между отсутствием временных меток и временной меткой в начале и конце каждого сеанса ведения журнала.
tr: Zaman damgası modu. Bu açılan kutu, zaman damgası olmaması ile her günlük oturumunun başında ve sonunda bir zaman damgası arasında seçim yapmanızı sağlar.

source: Log speech during say-all (read to end) mode. This add-on logs speech generated when you press NVDA+DownArrow (NVDA+a in laptop layout). If you would rather not have that kind of narrative (potentially long) reading logged, un-check this box.
ru: Журналировать речь в режиме полного воспроизведения (чтения до конца). Это дополнение записывает речь, генерируемую при нажатии клавиш NVDA+стрелка вниз (NVDA+a в раскладке ноутбука). Если вы не хотите, чтобы такого рода длинные записи о чтении записывались в журнал, снимите этот флажок.
tr: Tümünü söyle (sonuna kadar oku) modunda konuşmayı günlüğe kaydedin. Bu eklenti, NVDA+Aşağı Ok (dizüstü bilgisayar düzeninde NVDA+a) tuşlarına bastığınızda oluşturulan konuşmayı günlüğe kaydeder. Bu tür uzun anlatıların günlüğe kaydedilmesini istemiyorsanız, bu kutunun işaretini kaldırın.

source: Begin logging at startup. You can set this option to "Always", if you want speech to be logged automatically when NVDA starts. This only applies to local speech, and the default is "never".
ru: Начинать запись в журнал при запуске. Вы можете установить для этого параметра значение "Всегда", если хотите, чтобы при запуске NVDA речь автоматически записывалась в журнал. Это относится только к локальной речи, и по умолчанию установлено значение "никогда".
tr: Başlangıçta günlüğe kaydetmeye başla. NVDA başladığında konuşmanın otomatik olarak günlüğe kaydedilmesini istiyorsanız, bu seçeneği "Her Zaman" olarak ayarlayabilirsiniz. Bu yalnızca yerel konuşma için geçerlidir ve varsayılan değer "asla" dır.

source: Utterance separator
ru: Разделитель звуков
tr: İfade ayırıcı

source: When NVDA speaks something such as "`recycle bin 1 of 55`" while it's reading your desktop, this is considered two separate utterances.
ru: Когда NVDA произносит что-то вроде "`корзина 1 из 55`" во время чтения вашего рабочего стола, это считается двумя отдельными фразами.
tr: NVDA, masaüstünüzü okurken "` `geri dönüşüm kutusu 1/55 '' gibi bir şey konuştuğunda, bu iki ayrı ifade olarak kabul edilir.

source: The first one is the item name ("`Recycle bin`", in this example), and the second is the object position information ("`1 of 55`", in this example).
ru: Первая - это название элемента ("`Корзина`", в данном примере), а вторая - информация о местоположении объекта ("`1 из 55`", в данном примере).
tr: İlki öğe adıdır (bu örnekte “`Geri dönüşüm kutusu`”), ikincisi ise nesnenin konum bilgisidir (bu örnekte “`1/55`”).

source: Depending on what you are reading, and how you have NVDA configured, there can be several separate utterances that happen during a single speech sequence.
ru: В зависимости от того, что вы читаете и как у вас настроена NVDA, в течение одной речевой последовательности может быть несколько отдельных высказываний.
tr: Ne okuduğunuza ve NVDA'yı nasıl yapılandırdığınıza bağlı olarak, tek bir konuşma dizisi sırasında birden çok farklı ifade olabilir.

source: In the normal NVDA log at debug level, each individual utterance is separated with two spaces, as it is written in the example above.
ru: В обычном журнале NVDA на уровне отладки каждое отдельное высказывание разделяется двумя пробелами, как это написано в примере выше.
tr: Hata ayıklama seviyesindeki normal NVDA günlüğünde, yukarıdaki örnekte yazıldığı gibi her bir ifade iki boşlukla ayrılır.

source: Speech Logger allows you to separate utterances in the same way NVDA does (with two spaces), or by one of a few reasonable alternatives (a newline, a comma and a space, a tab, two underscores), or by a custom sequence of your own devising.
ru: Регистратор речи позволяет вам разделять высказывания так же, как это делает NVDA (двумя пробелами), или с помощью одного из нескольких разумных вариантов (новая строка, запятая и пробел, табуляция, два символа подчеркивания), или с помощью пользовательской последовательности, которую вы сами придумаете.
tr: Konuşma Kaydedici, ifadeleri NVDA'nın yaptığı gibi (iki boşlukla) veya birkaç makul alternatiften biriyle (yeni satır, virgül ve boşluk, sekme, iki alt çizgi) veya özel bir sıra ile ayırmanıza olanak tanır. kendi tasarımın.

source: If, for example, you wanted your utterance separator to be two dollar signs (`$$`), you would set the combobox to "custom", and enter "`$$`" (without the quotes), in the custom separator field.
ru: Если, например, вы хотите, чтобы разделителем ваших слов были два знака доллара (`$$`), вам следует установить в выпадающем списке значение "пользовательский" и ввести "`$$`" (без кавычек) в поле пользовательский разделитель.
tr: Örneğin, ifade ayırıcınızın iki dolar işareti (`$$`) olmasını istiyorsanız, birleşik giriş kutusunu "özel" olarak ayarlar ve özel ayırıcıya "`$$`" (tırnak işaretleri olmadan) girersiniz. alan. Yeni bir satır ve ardından bir sekme olmasını istiyorsanız, "`\\n\\t`" girebilirsiniz.

source: If you wanted it to be a newline followed by a tab, you could enter "`\n\t`".
ru: Если вы хотите, чтобы это был символ новой строки, за которым следует табуляция, вы можете ввести "`\n\t`".
tr: Yeni satır ve ardından sekme olmasını istiyorsanız, “`\n\t`” girebilirsiniz.

source: Controls:
ru: Управления:
tr: Kontroller:

source: This add-on has two keyboard shortcuts set by default, and one that is unassigned.
ru: В этом дополнении есть два сочетания клавиш, установленных по умолчанию, и одно неназначенное.
tr: Bu eklentinin varsayılan olarak ayarlanmış iki klavye kısayolu ve atanmamış bir klavye kısayolu vardır.

source: The default gestures, which you can change in the NVDA Input Gestures "`Speech Logger`" category, are:
ru: Вот жесты по умолчанию, которые вы можете изменить в категории "`Регистратор речи`" жестов ввода NVDA:
tr: NVDA Girdi Hareketleri "`Konuşma Kaydedici'' kategorisinde değiştirebileceğiniz varsayılan hareketler şunlardır:

source: NVDA+Alt+L: start/stop logging of local speech.
ru: NVDA+Alt+L: начать/остановить запись локальной речи в журнал.
tr: NVDA+Alt+L: yerel konuşma kaydını başlat/durdur.

source: NVDA+Shift+Alt+L: start/stop logging of remote speech.
ru: NVDA+Shift+Alt+L: начать/остановить запись удалённой речи в журнал.
tr: NVDA+Shift+Alt+L: uzaktan konuşma kaydını başlat/durdur.

source: These are listed as "Toggles logging of local speech" and "Toggles logging of remote speech", respectively.
ru: Они перечислены как "Переключает ведение журнала локальной речи" и "Переключает ведение журнала удалённой речи" соответственно.
tr: Bunlar sırasıyla "Yerel konuşmanın günlüğe kaydedilmesini çıp kapatır" ve "Uzaktan konuşmanın günlüğe kaydedilmesini Açıp kapatır" olarak listelenir.

source: Additionally, it has one unassigned gesture for opening its configuration panel, which you may assign from the `Speech Logger` category in NVDA's Input Gestures.
ru: Кроме того, у него есть один неназначенный жест для открытия панели настроек, который вы можете назначить из категории `Регистратор речи` в разделе жестов ввода NVDA.
tr: Ek olarak, NVDA'nın Girdi Hareketleri'ndeki 'Konuşma Kaydedici' kategorisinden atayabileceğiniz, yapılandırma panelini açmak için atanmamış bir hareket vardır.

source: A note on remote speech logging
ru: Примечание по записи удалённой речи
tr: Uzaktan konuşma kaydı hakkında bir not

source: This add-on is intended to work with the NVDA Remote add-on, for logging of remote speech.
ru: Это дополнение предназначено для работы с дополнением NVDA Remote для ведения журнала удалённой речи.
tr: Bu eklenti, uzak konuşmanın günlüğe kaydedilmesi için NVDA Uzaktan Destek eklentisiyle çalışmak üzere tasarlanmıştır.

source: It is important to know, that it is not possible to start logging for remote sessions until you actually start one.
ru: Важно знать, что невозможно начать ведение журнала для удаленных сеансов, пока вы на самом деле не запустите один из них.
tr: Gerçekten bir oturum başlatana kadar uzak oturumlar için günlüğe kaydetmeye başlamanın mümkün olmadığını bilmek önemlidir.

source: There is no way to, for example, start logging, and have it wait, on stand-by, until a remote session starts, and begin logging at that time.
ru: Например, невозможно запустить ведение журнала и перевести его в режим ожидания, пока не начнется удаленный сеанс, и начать ведение журнала в это время.
tr: Örneğin, günlüğe kaydetmeye başlamanın ve uzak oturum başlayana kadar beklemede beklemesini ve o anda günlüğe kaydetmeye başlamasını sağlamanın bir yolu yoktur.

source: However, once started, logging will continue across remote sessions.
ru: Однако после запуска ведение журнала будет продолжаться во всех удаленных сеансах.
tr: Ancak, bir kez başlatıldıktan sonra günlük kaydı uzak oturumlarda devam edecektir.

source: Feedback and feature requests
ru: Отзывы и запросы возможностей
tr: Geri bildirim ve özellik istekleri

source: If you would like to suggest a feature or report a bug, please reach out by email, or file an [issue][2].
ru: Если вы хотите предложить какую-либо возможность или сообщить об ошибке, пожалуйста, свяжитесь с нами по электронной почте или отправьте сообщение о [проблеме][2].
tr: Bir özellik önermek veya bir hata bildirmek istiyorsanız, lütfen e-posta ile iletişime geçin veya bir [sorun][2] gönderin.

source: If you find this add-on useful, it would really help if you could [leave a review][4].
ru: Если это дополнение полезно для вас, было бы очень здорово, если бы вы [оставили отзыв][4].
tr: Bu eklentiyi faydalı bulursanız, [inceleme bırakırsanız][4] gerçekten yardımcı olacaktır.

source: As always, I appreciate hearing that my add-ons are helpful, and finding out what people are using them for.
ru: Как всегда, мне приятно слышать, что мои дополнения полезны, и узнавать, для чего люди их используют.
tr: Her zaman olduğu gibi, eklentilerimin faydalı olduğunu duymaktan ve insanların bunları ne için kullandığını öğrenmekten memnuniyet duyuyorum.
