Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/inputLock/*/inputLock.xliff
Languages: tr

source: [[!meta title="Input Lock"]]
tr: [[!meta title="Girdi Kilidi"]]

source: Author: Jose Manuel Delicado
tr: Yazar: Jose Manuel Delicado

source: NVDA compatibility: 2023.3.4 and beyond
tr: NVDA uyumluluğu: 2023.3.4 ve sonrası

source: Download [stable version][1]
tr: [kararlı sürümü indir][1]

source: Introduction
tr: Giriş

source: Do you have kids or pets at home? Do you have a cat and It likes very much climbing your table and walking over your keyboard? Do you accidentally move the mouse to random parts in the screen while using your laptop? Then Input Lock is for you! You will be able to leave your computer alone and turned on without risk.
tr: Evinizde çocuklar veya evcil hayvanınız mı var? Masanıza tırmanmayı seven ve klavyenizde dolaşmayı seven bir kediniz mi var? Dizüstü bilgisayarınızı kullanırken yanlışlıkla fareyi ekranın rastgele bölümlerine mi götürüyorsunuz? O zaman Girdi kilidi tam size göre! Artık Bilgisayarınızı rahatça kendi haline bırakıp geldiğinizde en son bıraktığınız gibi bulabileceksiniz.

source: Once installed, you will be able to lock your keyboard, touch screen (if your laptop has one), touchpad, mouse and Braille display.
tr: Kurulduktan sonra klavyenizi, dokunmatik ekranınızı (dizüstü bilgisayarınızda varsa), dokunmatik yüzeyinizi, farenizi ve Braille ekranınızı kilitleyebileceksiniz.

source: Usage
tr: Kullanım

source: This addon adds three extra gestures to NVDA. By default they are unassigned, so you will have to configure them from Input gestures dialog. Read the NVDA User Guide for more information.
tr: Bu eklenti NVDA'ya üç ekstra hareket ekler. Varsayılan olarak atanmamışlardır, dolayısıyla bunları Girdi hareketleri iletişim kutusundan yapılandırmanız gerekecektir. Daha fazla bilgi için NVDA Kullanım Kılavuzunu okuyun.

source: When you press the toggle input lock gesture, NVDA will say "Input locked". Your input devices will be blocked until you press the same gesture again. In that moment, NVDA will say "Input unlocked" and everything will work as usual.
tr: Girdi kilidi aç/kapa hareketine bastığınızda, NVDA "Girdi kiliti etkin" diyecektir. Aynı harekete tekrar basana kadar girdi cihazlarınız devre dışı kalacaktır. Girdi kilitliyken aynı harekete bastığınızda NVDA "Girdi kilidi devre dışı" diyecek ve cihazlarınız çalışmaya devame decektir.

source: Locking the touchpad can prevent us from accidentally touching it, especially those who are used to using the laptop keyboard directly. When you press the toggle touchpad lock gesture, NVDA will say "Touchpad locked". Your touchpad will be blocked until you press the same gesture again. In that moment, NVDA will say "Touchpad unlocked" and everything will work as usual.
tr: Dokunmatik yüzeyi kilitlemek, özellikle dizüstü bilgisayar klavyesini doğrudan kullanmaya alışkın olanların yanlışlıkla ona dokunmasını engelleyebilir. Dokunmatik yüzey kilitleme hareketini değiştirmeye bastığınızda, NVDA "Dokunmatik yüzey kilitli" diyecektir. Siz aynı harekete tekrar basana kadar dokunmatik yüzeyiniz bloke edilecektir. O anda NVDA "Dokunmatik yüzeyin kilidi açıldı" diyecek ve her şey her zamanki gibi çalışacak.

source: If you press the toggle mouse block gesture, your mouse will be locked. Press this command again to unlock it. While mouse is locked, you can use NVDA gestures to move it, and click with left and right buttons, but You can't move the mouse itself. Mouse clicks can also be disabled from Input lock category in NVDA settings dialog (NVDA 2018.2 and later) or from add-on settings dialog for older versions, available under preferences menu. In addition, from these settings you can control wether mouse locks when NVDA is started or not.
tr: Fare aç/kapa hareketine basarsanız, fareniz kilitlenir. Kilidi açmak için bu harekete tekrar basmanız gerekir. Fare kilitliyken NVDA hareketlerini kullanarak fareyi hareket ettirebilir, sol ve sağ tuşlarla tıklatabilirsiniz ancak farenin kendisini hareket ettiremezsiniz. Fare tıklamaları, NVDA ayarları iletişim kutusundaki (NVDA 2018.2 ve üstü) Girdi kilidi kategorisinden veya daha eski sürümler için tercihler menüsünde bulunan eklenti ayarları iletişim kutusundan da devre dışı bırakabilirsiniz. Ayrıca, bu ayarlardan, NVDA başlatıldığında fare kilidinin kilitlenip kilitlenmeyeceğini kontrol edebilirsiniz.

source: Note: when mouse clicks are blocked, you can't use any NVDA gestures to work with the mouse.
tr: Not: Fare tıklamaları engellendiğinde, fareyle çalışmak için herhangi bir NVDA hareketini kullanamazsınız.

source: Limitations and known problems
tr: Sınırlamalar ve bilinen sorunlar

source: Input Lock has the following known problems:
tr: Girdi Kilidi aşağıdaki bilinen sorunlara sahiptir:

source: The shortcuts control+alt+del and windows+l can be used even when the keyboard is locked.
tr: Ctrl+alt+del ve windows+l kısayolları, klavye kilitliyken bile kullanılabilir.

source: For gestures used to lock the touchpad, please try to assign a small number of key combination gestures. It is recommended to use NVDA+letters or numbers, Ctrl+F keys etc.
tr: Dokunmatik yüzeyi kilitlemek için kullanılan hareketler için lütfen az sayıda tuş kombinasyonu hareketi atamayı deneyin. NVDA+harf veya rakam, Ctrl+F tuşları vb. kullanılması tavsiye edilir.

source: Changelog
tr: Değişiklik Listesi

source: Version 1.13
tr: Sürüm 1.13

source: Now, minimum supported version is 2023.3.4.
tr: Şimdi, desteklenen minimum sürüm 2023.3.4.

source: Updated translations. Starting from version 1.13, changelog won't be modified when a new release only includes localization updates.
tr: Çeviriler güncellendi. 1.13 sürümünden itibaren, yeni bir sürüm yalnızca yerelleştirme güncellemelerini içerdiğinde değişiklik günlüğü değiştirilmeyecektir.

source: Added a gesture (unassigned by default) to lock/unlock the touchpad.
tr: Dokunmatik yüzeyi kilitlemek/kilidini açmak için bir hareket eklendi (varsayılan olarak atanmamıştır).

source: Version 1.12
tr: Sürüm 1.12

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Version 1.11
tr: Sürüm 1.11

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Now, minimum supported version is 2022.4.
tr: Şimdi, desteklenen minimum sürüm 2022.4.

source: Version 1.10
tr: Sürüm 1.10

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Updated documentation.
tr: Yardım belgeleri güncellendi.

source: Now, minimum supported version is 2021.3.
tr: Şimdi, desteklenen minimum sürüm 2021.3.

source: The input will remain blocked after waking up from standby mode. Thanks to Javi Dominguez.
tr: Bekleme modundan uyandıktan sonra girişler engellenmeye devam edecektir. Javi Dominguez'e teşekkürler.

source: Version 1.9
tr: Sürüm 1.9

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Updated documentation.
tr: Yardım belgeleri güncellendi.

source: Version 1.8
tr: Sürüm 1.8

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Version 1.7
tr: Sürüm 1.7

source: Updated compatibility flags for recent NVDA versions.
tr: En son NVDA sürümleri için uyumluluk güncellemesi.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Version 1.6
tr: Sürüm 1.6

source: Now, settings are removed only when the add-on is uninstalled. Configuration is nolonger reset when upgrading.
tr: Artık ayarlar yalnızca eklenti kaldırıldığında kaldırılır. Güncelleme sırasında ayarlar sıfırlanmaz.

source: New and updated translations.
tr: Yeni ve güncellenmiş çeviriler.

source: Version 1.5
tr: Sürüm 1.5

source: Added compatibility with recent NVDA releases.
tr: En son NVDA sürümleri için uyumluluk eklendi.

source: New translations.
tr: Yeni çeviriler.

source: Version 1.4
tr: Sürüm 1.4

source: The addon gestures are unassigned by default.
tr: Eklenti hareketleri varsayılan olarak atanmaz.

source: Version 1.3
tr: Sürüm 1.3

source: Added a configuration panel in settings dialog. For old NVDA versions, a menu item and a dialog have been added too.
tr: Ayarlar iletişim kutusuna bir yapılandırma paneli eklendi. Eski NVDA sürümleri için bir menü öğesi ve bir iletişim kutusu da eklenmiştir.

source: Added a setting to lock the mouse when NVDA is started.
tr: NVDA başlatıldığında fareyi kilitleme ayarı eklendi.

source: Added a setting to block also mouse clicks while mouse is locked.
tr: Fare kilitliyken fare tıklamalarını da engellemek için bir ayar eklendi.

source: Small bugs fixed, some code optimizations and less duplicated strings for translators
tr: Küçük hatalar düzeltildi, bazı kod optimizasyonları ve çevirmenler için daha az tekrar eden dizeler

source: Version 1.2
tr: Sürüm 1.2

source: Now the mouse can also be locked
tr: Artık fare de kilitlenebilir

source: New command to lock and unlock only the mouse
tr: Yalnızca fareyi kilitlemek ve kilidini açmak için yeni komut

source: Version 1.1
tr: Sürüm 1.1

source: If another addon has previously added a capture function to inputManager, it is restored when the input is unlocked.
tr: Başka bir eklenti daha önce Girdi hareketlerine bir yakalama işlevi eklediyse, girdi kilidi açıldığında geri yüklenir.

source: Version 1.0
tr: Sürüm 1.0

source: Initial release
tr: İlk sürüm
