Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/inputLock/*/inputLock.po
Languages: fi, ru, tr, zh_tw

source: Toggle input lock
fi: Ota syötönlukitus käyttöön tai poista se käytöstä
ru: Переключить блокировку ввода
tr: Girdi kilidini açıp kapatır
zh_tw: 切換輸入鎖

source: Input locked
fi: Syöttö lukittu
ru: Ввод заблокирован
tr: Girdi kilidi etkin
zh_tw: 輸入已鎖定

source: Input unlocked
fi: Syötön lukitus poistettu
ru: Ввод разблокирован
tr: Girdi kilidi devre dışı
zh_tw: 輸入已解鎖

source: Toggle mouse lock
fi: Ota hiiren lukitus käyttöön tai poista se käytöstä
ru: Переключить блокировку мыши
tr: Fare kilidini açıp kapatır
zh_tw: 切換滑鼠鎖

source: Mouse locked
fi: Hiiri lukittu
ru: Мышь заблокирована
tr: Fare kilitli
zh_tw: 滑鼠已鎖定

source: Mouse unlocked
fi: Hiiren lukitus poistettu
ru: Мышь разблокирована
tr: Fare açık
zh_tw: 滑鼠已解鎖

source: Toggle touchpad lock
fi: Ota kosketuslevyn lukitus käyttöön tai poista se käytöstä
ru: Переключить блокировку сенсорной панели
tr: Dokunmatik yüzey kilidini açar/kapatır
zh_tw: 切換觸控板鎖

source: not support
fi: Ei tueta
ru: блокировка сенсорной панели не поддерживается
tr: desteklenmiyor
zh_tw: 不支援

source: Touchpad unlocked
fi: Kosketuslevyn lukitus poistettu
ru: Сенсорная панель разблокирована
tr: Dokunmatik yüzey açık
zh_tw: 觸控板已解鎖

source: Touchpad locked
fi: Kosketuslevy lukittu
ru: Сенсорная панель заблокирована
tr: Dokunmatik yüzey kilitli
zh_tw: 觸控板已鎖定

source: Input lock settings
fi: Syöttölukon asetukset
ru: Настройки блокировки ввода
tr: Girdi kilitleme ayarları
zh_tw: 輸入鎖設定

source: Block mouse when NVDA is started
fi: Estä hiiri NVDA:n käynnistyessä
ru: Блокировать мышь при запуске NVDA
tr: NVDA başladığında fareyi kilitle
zh_tw: 啟動NVDA時鎖定滑鼠

source: Block clicks when mouse is locked
fi: Estä napsautukset hiiren ollessa lukittuna
ru: Блокировать щелчки, когда мышь заблокирована
tr: Fare kilitlendiğinde tıklamaları da engelle
zh_tw: 鎖定滑鼠時阻止點擊

source: Input lock
fi: Syöttölukko
ru: Блокировка ввода
tr: Girdi kilidi
zh_tw: 輸入鎖

source: With this addon, you will be able to lock and unlock your input devices with a single gesture or key press. This gesture can be changed from Input Gestures dialog.
fi: Tämän lisäosan avulla voidaan lukita syöttölaitteet tai avata niiden lukitus yhdellä näppäinkomennolla. Tätä komentoa on mahdollista muuttaa Syöttökomennot-valintaikkunasta.
ru: С помощью этого дополнения, вы сможете блокировать любое устройство ввода, используя только один жест или комбинацию клавиш. Этот жест может быть изменён в диалоге жестов ввода.
tr: Bu eklenti ile, tek bir hareket ya da tuşa basarak giriş aygıtlarını kilitlemek ve kilidini açmak mümkün. Bu hareket girdi hareketleri iletişim kutusundan değiştirilebilir.
zh_tw: 透過此附加元件，您將能以單一手勢或按鍵來鎖定和解鎖您的輸入裝置。 此手勢可從輸入手勢對話框中變更。
