Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/reportSymbols/*/reportSymbols.xliff
Languages: tr

source: Report Symbols #
tr: Sembolleri Bildir #

source: Author: Noelia Ruiz Martínez.
tr: Yazar: Noelia Ruiz Martínez.

source: This add-on allows to listen the typed symbols (non alphanumeric or blank characters), even when the speaking of typed characters is turned off in NVDA.
tr: Bu eklenti, NVDA'da yazılan karakterlerin konuşulması kapatıldığında bile, yazılan sembollerin (alfanumerik olmayan veya boş karakterler) bildirilmesini sağlar.

source: It's based on the old ReportSymbols add-on, developed by the same author. You should uninstall it to use this version.
tr: Aynı yazar tarafından geliştirilen eski ReportSymbols eklentisine dayanmaktadır. Bu sürümü kullanmak için onu kaldırmalısınız.

source: Preferences menu ##
tr: Tercihler menüsü ##

source: Report Symbols settings: Allows to set preferences for the speaking of typed symbols.
tr: Sembolleri bildir ayarları: Yazılan sembollerin söylenmesi için tercihlerin ayarlanmasına izin verir.

source: Note: A gesture to open this dialog can be assigned from NVDA menu, Preferences submenu, Input gestures dialog, Configuration category.
tr: Not: Bu iletişim kutusunu açmak için bir hareket NVDA menüsü, Tercihler menüsü, Girdi hareketleri iletişim kutusunda, Konfigürasyon kategorisinden atanabilir.

source: Exclude symbols
tr: Sembolleri hariç tut

source: From NVDA's menu, Preferences submenu, Input gestures dialog, reportSymbols category, you can assing a gesture to exclude (or include again) symbols to be reported when typing.
tr: NVDA menüsü, Tercihler menüsü, Girdi hareketleri iletişim kutusundan, Sembolleri Bildir kategorisinden, yazarken bildirilecek sembolleri hariç tutmak (veya tekrar dahil etmek) için bir hareket ekleyebilirsiniz.

source: Changes for 29.0.0
tr: 29.0.0 için değişiklikler

source: Added ability to assing gestures to exclude or include symbols to be reported when typing.
tr: Yazarken söylenecek sembolleri hariç tutmak veya dahil etmek için hareketleri birleştirme yeteneği eklendi.

source: Changes for 8.0
tr: 8.0 için değişiklikler

source: Compatible with NVDA 2023.1.
tr: NVDA 2023.1 ile uyumlu.

source: Changes for 7.0
tr: 7.0 için değişiklikler

source: Compatible with NVDA 2022.1.
tr: NVDA 2022.1 ile uyumlu.

source: Changes for 6.0
tr: 6.0 için değişiklikler

source: Compatible with NVDA 2021.1.
tr: NVDA 2021.1 ile uyumlu.

source: Changes for 5.0 ##
tr: 5.0 için değişiklikler ##

source: Requires NVDA 2019.3 or later.
tr: NVDA 2019.3 veya sonraki sürümünü gerektirir.

source: Changes for 4.0 ##
tr: 4.0 için değişiklikler ##

source: The add-on settings are shown in the corresponding category of the NVDA Settings dialog.
tr: Eklenti ayarları, NVDA Ayarları iletişim kutusunun ilgili kategorisinde gösterilir.

source: Requires NVDA 2018.2 or later.
tr: NVDA 2018.2 veya sonraki sürümünü gerektirir.

source: Changes for 3.0 ##
tr: 3.0 için değişiklikler##

source: Added checkboxes for the speaking of spaces, carriage returns and other blank characters.
tr: Boşlukların, satır başlarının ve diğer boş karakterlerin söylenmesi için onay kutuları eklendi.

source: Changes for 2.0 ##
tr: 2.0 için değişiklikler ##

source: The visual presentation of the dialog has been enhanced, adhering to the appearance of the dialogs shown in NVDA.
tr: Diyaloğun görsel sunumu, NVDA'da gösterilen diyalogların görünümüne bağlı kalarak geliştirildi.

source: Requires NVDA 2016.4 or later.
tr: NVDA 2016.4 veya sonraki sürümünü gerektirir.

source: Changes for 1.0 ##
tr: 1.0 için değişiklikler ##

source: Initial version.
tr: İlk sürüm.
