Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/reportSymbols/*/reportSymbols.po
Languages: fi, pt_pt, ru, tr, zh_tw

source: Report &printable symbols
fi: Puhu tu&lostuvat symbolit
pt_pt: Indicar Símbolos &imprimíveis
ru: Озвучивать пе&чатаемые символы
tr: &Yazdırılabilir sembolleri bildir
zh_tw: 讀出可列印符號(&P)

source: Report &spaces
fi: Puhu v&älilyönnit
pt_pt: Indicar &espaços
ru: Озвучивать &пробелы
tr: &Boşlukları bildir
zh_tw: 讀出空格(&S)

source: &Report carriage returns
fi: Puhu r&ivinvaihdot
pt_pt: &Indicar retornos
ru: О&звучивать переходы каретки
tr: &Satır sonlarını bildir
zh_tw: 讀出行尾(&R)

source: Repor&t other blank characters
fi: Puhu &muut tyhjämerkit
pt_pt: In&dicar outros caracteres em branco
ru: Озвучива&ть другие пустые символы
tr: &Diğer boşluk karakterlerini bildir
zh_tw: 讀出其他空白字元(&T)

source: {symbol} excluded from symbols to report
fi: {symbol} poistettu puhuttavista symboleista
pt_pt: {symbol} excluído dos símbolos a comunicar
ru: {symbol} исключён из символов для сообщения
tr: {symbol} Bildirilecek sembollerden hariç tutuldu
zh_tw: {symbol} 已從要讀出的符號中排除

source: {symbol} included in symbols to report
fi: {symbol} lisätty puhuttaviin symboleihin
pt_pt: {symbol} incluído nos símbolos do relatório
ru: {symbol} включён в символы для сообщения
tr: {symbol} Bildirilecek sembollere dahil
zh_tw: {symbol} 已加入至要讀出的符號中

source: Excludes or includes the %s symbol in the set of signs to be reported when typing
fi: Jättää pois tai sisällyttää symbolin %s kirjoitettaessa puhuttaviin symboleihin
pt_pt: Exclui ou inclui o símbolo %s no conjunto de sinais a reportar ao digitar
ru: Исключает или включает символ %s в наборе знаков, которые должны быть сообщены при печати
tr: Yazarken bildirilecek işaretler kümesindeki %s sembolünü hariç tutar veya dahil eder
zh_tw: 從輸入時要讀出的符號集合中，排除或加入 %s 符號

source: Shows the %s settings.
fi: Näyttää %s -lisäosan asetukset.
pt_pt: Mostra as definições %s.
ru: Показывает параметры %s.
tr: %s ayarlarını gösterir.
zh_tw: 顯示%s設定。

source: Report Symbols
fi: Puhu symbolit
pt_pt: Indicar Símbolos
ru: Сообщать Символы
tr: Sembolleri Bildir
zh_tw: 讀出符號

source: Allows to listen the typed symbols (non alphanumeric or blank characters), even when the speaking of characters is turned off.
fi: Mahdollistaa kirjoitettujen symbolien (ei-aakkosnumeeristen ja tyhjämerkkien) kuulemisen, vaikka merkkien puhuminen on poistettu käytöstä.
pt_pt: Permite ouvir os símbolos digitados (caracteres não alfanuméricos ou espaços em branco), mesmo quando a função de falar caracteres está desactivada.
ru: Позволяет прослушивать набранные символы (не буквенно-цифровые или пустые символы), даже если произношение символов отключено.
tr: Karakterlerin konuşması kapalı olsa bile, yazılan sembollerin (alfanumerik olmayan veya boş karakterler) dinlenmesini sağlar.
zh_tw: 即使在關閉讀出輸入字元功能時，仍能聽取輸入的符號(非英數字元或空白字元)。
