Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/searchWith/*/searchWith.po
Languages: fi

source: Search With Menu
fi: Hae hakukoneella -valikko

source: Not able to get {item} url
fi: Kohteen {item} URL-osoitetta ei saatu

source: Error Message
fi: Virhe

source: No text in clipboard
fi: Ei tekstiä leikepöydällä

source: No last spoken text
fi: Ei viimeksi puhuttua tekstiä

source: Display Search with dialog to enter a search query. And if text selected, displays a virtual menu pressed once, searches Google directly pressed twice.
fi: Näyttää Hae hakukoneella -valintaikkunan, johon voidaan kirjoittaa hakukysely. Jos tekstiä on valittuna, näyttää kerran painettaessa virtuaalisen valikon tai kahdesti painettaessa hakee suoraan Googlella.

source: Search With
fi: Hae hakukoneella

source: Display Search with virtual menu for clipboard text, and pressed twice searches Google directly.
fi: Näyttää Hae hakukoneella -virtuaalivalikon leikepöydän tekstille tai hakee kahdesti painettaessa suoraan Googlella.

source: Display Search with virtual menu for last spoken text, and pressed twice searches Google directly.
fi: Näyttää Hae hakukoneella -virtuaalivalikon viimeksi puhutulle tekstille tai hakee kahdesti painettaessa suoraan Googlella.

source: Menu
fi: Valikko

source: Available items to add
fi: Lisättävät kohteet

source: Add to menu
fi: Lisää valikkoon

source: Search with menu
fi: Hae hakukoneella -valikko

source: Remove
fi: Poista

source: Move item up
fi: Siirrä ylös

source: Move item down
fi: Siirrä alas

source: Set menu to default
fi: Palauta valikon oletuskohteet

source: In Google search
fi: Google-haussa

source: Browser language and setting
fi: Selaimen kieltä

source: NVDA language
fi: NVDA:n kieltä

source: Windows language
fi: Windowsin kieltä

source: Use:
fi: Käytä:

source: In search with dialog
fi: Hae hakukoneella -valintaikkunassa

source: Leave Blank
fi: Jätä tyhjäksi

source: Use clipboard text
fi: Käytä leikepöydän tekstiä

source: Use last spoken text
fi: Käytä viimeksi puhuttua tekstiä

source: Options for default query:
fi: Oletuskyselyn vaihtoehdot:

source: Translation engines
fi: Käännöskoneet

source: Target language for google translate:
fi: Google-kääntäjän kohdekieli:

source: Target language for deepL translate:
fi: DeepL Translaten kohdekieli:

source: For advanced users
fi: Kokeneille käyttäjille

source: Preserve data folder upon installing a new version
fi: Säilytä datakansio uutta versiota asennettaessa

source: Information: Item added
fi: Kohde lisätty

source: Information: item removed
fi: Kohde poistettu

source: Information: item moved up
fi: Kohde siirretty ylös

source: Information: item moved down
fi: Kohde siirretty alas

source: Information: Menu set to default
fi: Valikon oletuskohteet palautettu

source: Search with google
fi: Hae Googlella

source: Enter a search query
fi: Kirjoita hakukysely

source: Other Engines
fi: Muut hakukoneet

source: This addon helps you to search text, via various search engines. Let no text selected, and press the gesture of the addon A dialog will be displayed, with an edit box to enter a search query To search with Google press enter, or tab to search with other engins. Or select some text and press once, a menu will be displayed with various search engines to choose from. And while text is selected, you can press the gesture twice to search with Google directly. The Default gesture for the addon is: NVDA+ Windows+ S.
fi: Tämän lisäosan avulla voit hakea tietoa eri hakukoneilla. Jos tekstiä ei ole valittuna, paina määritettyä lisäosan näppäinkomentoa. Hakukentän sisältävä valintaikkuna näytetään, johon voidaan kirjoittaa haluttu hakukysely Hae Googlella painamalla Enteriä tai Sarkainta käyttääksesi muita hakukoneita. Vaihtoehtoisesti: Valitse tekstiä ja paina näppäinkomentoa kerran, jolloin avautuu valikko, josta voit valita haluamasi hakukoneen. Kun tekstiä on valittuna, voit hakea suoraan Googlella painamalla näppäinkomentoa kahdesti. Lisäosan oletusarvoinen näppäinkomento on NVDA+Win+S.
