Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/urlShortener/*/urlShortener.xliff
Languages: pt_pt, ru, tr

source: URL Shortener #
pt_pt: Encurtador de URL
ru: Сокращение URL #
tr: URL Kısaltıcı #

source: Author: Noelia Ruiz Martínez
pt_pt: Autor: Noelia Ruiz Martínez
ru: Автор: Noelia Ruiz Martínez
tr: Yazar: Noelia Ruiz Martínez

source: This add-on is used to shorten URLs from NVDA through [is.gd][1].
pt_pt: Esse complemento é usado para encurtar URLs do NVDA por meio do [is.gd][1].
ru: Это дополнение используется для сокращения URL-адресов в NVDA с помощью [is.gd][1].
tr: Bu eklenti, NVDA [is.gd][1] ile olan URL'leri kısaltmak için kullanılır.

source: Shorten URL dialog ##
pt_pt: Activa O diálogo Encurtar URL.
ru: Диалог сокращения URL ##
tr: URL Kısaltıcı iletişim kutusu ##

source: Go to NVDA's menu, Tools submenu, and activate the Shorten URL item.
pt_pt: Acesse o menu do NVDA, o submenu Tools (Ferramentas) e ative o item Shorten URL (Encurtar URL).
ru: Перейдите в меню NVDA, подменю "Сервис", и активируйте пункт "Сократить URL".
tr: NVDA menüsü, Araçlar alt menüsüne gidin ve URL Kısaltıcı öğesini etkinleştirin.

source: Alternatively, you can assign a gesture from the Input gestures dialog of NVDA.
pt_pt: Como alternativa, você pode atribuir um gesto na caixa de diálogo Gestos de entrada do NVDA.
ru: В качестве альтернативы вы можете назначить жест в диалоге жестов ввода NVDA.
tr: Alternatif olarak, NVDA'nın Girdi hareketleri iletişim kutusundan bir hareket atayabilirsiniz.

source: The Shorten URL dialog includes the following controls:
pt_pt: A caixa de diálogo Encurtar URL inclui os seguintes controles:
ru: Диалог Сокращения URL включает в себя следующие элементы управления:
tr: URL Kısaltıcı iletişim kutusu aşağıdaki kontrolleri içerir:

source: A list to select one of the saved URLs. From this list, Press shift+tab to search, and tab to press one of the following buttons.
pt_pt: Uma lista para selecionar um dos URLs salvos. Nessa lista, pressione shift+tab para pesquisar e tab para pressionar um dos seguintes botões.
ru: Список для выбора одного из сохраненных URL-адресов. В этом списке нажмите shift+tab для поиска и tab для нажатия одной из следующих кнопок.
tr: Kayıtlı URL'lerden birini seçmek için bir liste. Bu listeden, arama yapmak için shift+tab tuşlarına ve aşağıdaki düğmelerden birine basmak için tab tuşuna basın.

source: Copy shortened URL. This can also be activated by pressing Enter from the URLs list.
pt_pt: Copiar URL encurtado. Isso também pode ser ativado pressionando Enter na lista de URLs.
ru: Скопировать сокращённый URL. Это также можно активировать, нажав Enter в списке URL-адресов.
tr: Kısaltılmış URL'yi kopyala. Bu, URL listesinden Enter tuşuna basılarak da etkinleştirilebilir.

source: A readonly box showing details about the selected URL.
pt_pt: Uma caixa somente de leitura que mostra detalhes sobre o URL selecionado.
ru: Поле только для чтения, с подробной информацией о выбранном URL.
tr: Seçilen URL ile ilgili ayrıntıları gösteren salt okunur bir kutu.

source: Set of controls to shorten a new URL: Provide the new URL; optionally, you can set a display name and a custom subfix for the shortened URL. Finally, press the Shorten URL button.
pt_pt: Conjunto de controles para encurtar um novo URL: Forneça o novo URL; opcionalmente, você pode definir um nome de exibição e um subfixo personalizado para o URL encurtado. Por fim, pressione o botão Encurtar URL.
ru: Набор элементов управления для сокращения нового URL-адреса: Укажите новый URL; при желании вы можете задать отображаемое имя и пользовательский субфикс для сокращённого URL. Наконец, нажмите кнопку Сократить URL.
tr: Yeni bir URL'yi kısaltmaya yönelik kontroller kümesi: Yeni URL'yi sağlayın; isteğe bağlı olarak kısaltılmış URL için bir görünen ad ve özel bir alt ek belirleyebilirsiniz. Son olarak URL'yi Kısalt düğmesine basın.

source: Rename: opens a dialog to provide a new name to display the selected URL on the list.
pt_pt: Renomear: abre uma caixa de diálogo para fornecer um novo nome para exibir o URL selecionado na lista.
ru: Переименовать: открывает диалог для ввода нового названия, отображаемого выбранного URL-адреса в списке.
tr: Yeniden adlandır: listede seçilen URL'yi görüntülemek için yeni bir ad sağlamak üzere bir iletişim kutusu açar.

source: Delete: opens a dialog to delete the selected URL.
pt_pt: Excluir: abre uma caixa de diálogo para excluir o URL selecionado.
ru: Удалить: открывает диалог для удаления выбранного URL.
tr: Sil: seçili URL'yi silmek için bir iletişim kutusu açar.

source: Remove saved URLs: opens a dialog to remove the saved URLs from the configuration folder.
pt_pt: Remove saved URLs (Remover URLs salvos): abre uma caixa de diálogo para remover os URLs salvos da pasta de configuração.
ru: Удалить сохранённые URL: открывает диалог для удаления сохраненных URL-адресов из папки конфигурации.
tr: Kaydedilen URL'leri kaldır: kaydedilen URL'leri yapılandırma klasöründen kaldırmak için bir iletişim kutusu açar.

source: Close.
pt_pt: Fechar.
ru: Закрыть.
tr: Kapat.

source: Changes for 8.0.0 ##
pt_pt: Alterações para a versão 8.0.0 ##
ru: Изменения для 8.0.0 ##
tr: 8.0.0 için değişiklikler ##

source: Added a readonly box with details about the selected URL.
pt_pt: Adição de uma caixa somente leitura com detalhes sobre o URL selecionado.
ru: Добавлено поле только для чтения с подробной информацией о выбранном URL.
tr: Seçilen URL ile ilgili ayrıntıları içeren salt okunur bir kutu eklendi.

source: Changes for 5.0.0 ##
pt_pt: Alterações para a versão 5.0.0 ##
ru: Изменения для 5.0.0 ##
tr: 5.0.0 için değişiklikler ##

source: The new URL dialog has been replaced with a set of controls in the main dialog, so that the focus can be placed in the relevant field to fix possible errors.
pt_pt: A nova caixa de diálogo de URL foi substituída por um conjunto de controles na caixa de diálogo principal, de modo que o foco possa ser colocado no campo relevante para corrigir possíveis erros.
ru: Диалог "Новый URL" был заменён набором элементов управления в главном диалоге, чтобы можно было сосредоточить внимание на соответствующем поле для исправления возможных ошибок.
tr: Yeni URL iletişim kutusu, ana iletişim kutusundaki bir dizi kontrolle değiştirildi; böylece olası hataları düzeltmek için odak ilgili alana yerleştirilebiliyor.

source: Changes for 2.0.0 ##
pt_pt: Alterações para a versão 2.0.0 ##
ru: Изменения для 2.0.0 ##
tr: 2.0.0 için değişiklikler ##

source: The Shorten URL option won't appear multiple times in Tools submenu when reloading plugins.
pt_pt: A opção Encurtar URL não aparecerá várias vezes no submenu Ferramentas ao recarregar os plug-ins.
ru: Опция сокращения URL не будет появляться несколько раз в подменю "Сервис" при перезагрузке плагинов.
tr: URL Kısaltıcı seçeneği, eklentileri yeniden yüklerken Araçlar alt menüsünde birden çok kez görünmez.

source: The New URL dialog includes an edit box to provide a custom subfix for the shortened URL.
pt_pt: A caixa de diálogo Novo URL inclui uma caixa de edição para fornecer um subfixo personalizado para o URL encurtado.
ru: Диалог "Создать URL-адрес" включает в себя поле редактирования для предоставления пользовательского вложенного исправления для сокращённого URL.
tr: Yeni URL iletişim kutusu, kısaltılmış URL için özel bir alt ek sağlamak üzere bir düzenleme kutusu içerir.

source: Changes for 1.0.0 ##
pt_pt: Alterações para 1.0.0 ##
ru: Изменения для 1.0.0 ##
tr: 1.0.0 için değişiklikler ##

source: Initial version.
pt_pt: Versão inicial.
ru: Первоначальная версия.
tr: İlk sürüm.
