Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/urlShortener/*/urlShortener.po
Languages: bs, fi, ka, pt_pt, ru, tr

source: &Shorten URL...
bs: Skraćivanje URL-a
fi: &Lyhennä URL...
ka: &ბმულის შემოკლება...
pt_pt: &Curtar URL...
ru: &Сократить URL...
tr: &URL'yi kısalt...

source: Activates the Shorten URL dialog.
bs: Otvara dijalog za skraćivanje URL-a
fi: Avaa Lyhennä URL -valintaikkunan.
ka: ააქტიურებს ბმულის შემოკლების დიალოგურ ფანჯარას.
pt_pt: Activa O diálogo Encurtar URL.
ru: Активирует диалог Сокращения URL.
tr: URL Kısaltıcı iletişim kutusunu etkinleştirir.

source: urls
bs: URL-ovi
fi: URLit
ka: ბმულები
ru: адреса URL
tr: url'ler

source: &Filter by:
bs: &Filtriraj po:
fi: &Suodata:
ka: &გაფილტრვა:
pt_pt: &Filtrar por:
ru: &Фильтровать по:
tr: &Filtreleme ölçütü:

source: C&opy shortened URL
bs: &Kopiraj skraćeni URL
fi: K&opioi lyhennetty URL
ka: შემოკლებული ბმულის &დაკოპირება
pt_pt: URL encurtado C&opy
ru: С&копировать сокращенный URL
tr: Kısaltılmış URL'yi &kopyala

source: Deta&ils:
bs: &Detalji
fi: T&ietoja:
ka: დ&ეტალები:
pt_pt: &Pormenores:
ru: &Подробности:
tr: &Detaylar:

source: New &URL
bs: &Novi URL
fi: Uusi &URL
ka: &ახალი ბმული
pt_pt: Novo &URL
ru: Новый &URL
tr: Yeni &URL

source: &Name for new URL
bs: Naziv novog URL-a
fi: Uuden URLin &nimi
ka: ახალი ბმულის &სახელი
pt_pt: &Nome para o novo URL
ru: &Название для нового URL
tr: Ye&ni URL için bir ad girin

source: Cus&tom URL
bs: Prilagođeni URL
fi: Mu&kautettu URL
ka: &მორგებული ბმული
pt_pt: &Personalizar URL
ru: &Пользовательский URL
tr: &Özel URL

source: Short&en New URL
bs: Skrati novi URL
fi: Ly&hennä uusi URL
ka: ახალი ბმულის შემო&კლება
pt_pt: Encurtar&enviar novo URL
ru: Сократить &новый URL
tr: Y&eni URL'yi Kısalt

source: &Rename...
bs: Preimenuj
fi: &Nimeä uudelleen...
ka: სახელის გადარ&ქმევა...
ru: &Переименовать...
tr: Yeniden Adlandı&r...

source: &Delete...
bs: Izbriši
fi: &Poista...
ka: &წაშლა...
pt_pt: &apagar...
ru: &Удалить...
tr: &Sil...

source: Remove &saved URLs...
bs: Ukloni spremljene URL-ove...
fi: Poista t&allennetut URLit...
ka: შენახული ბმულების წაშ&ლა...
pt_pt: Remover URLs &guardados...
ru: Удалить &сохраненные URL...
tr: Kayıtlı URL'leri kaldı&r...

source: This URL was already saved.
bs: Ovaj URL je već spremljen.
fi: Tämä URL on jo tallennettu.
ka: ეს ბმული უკვე შენახულია.
pt_pt: Este URL já foi guardado.
ru: Этот URL уже сохранён.
tr: Bu URL zaten kayıtlı.

source: This custom URL was already used. Try a different one.
bs: Ovaj prilagođeni URL se već koristi. Odaberite neki drugi.
fi: Tämä mukautettu URL on jo käytössä. Kokeile jotain toista.
ka: ეს მორგებული ბმული უკვე გამოყენებულია. სცადეთ სხვა.
pt_pt: Este URL personalizado já foi utilizado. Tente um diferente.
ru: Этот пользовательский URL уже использовался. Попробуйте другой.
tr: Bu özel URL zaten kullanılıyor. Farklı bir tane deneyin.

source: This custom URL has %d characters. Length must be between 5 and 30.
bs: Ovaj prilagođeni URL ima %d znakova. Dužina mora biti između 5 i 30 znakova.
fi: Tässä mukautetussa URLissa on %d merkkiä. Pituuden on oltava väliltä 5 ja 30.
ka: ეს მორგებული ბმული შეიცავს %d სიმბოლოს. სიმბოლოების რაოდენობა უნდა იყოს 5-დან 30-მდე.
pt_pt: Este URL personalizado tem %d caracteres. O comprimento deve ser entre 5 e 30.
ru: Этот пользовательский URL состоит из %d символов. Длина URL должна быть от 5 до 30 символов.
tr: Bu özel URL'de %d karakter var. Uzunluk 5 ile 30 arasında olmalıdır.

source: This custom URL is not available. Try a different one.
bs: Ovaj prilagođeni URL nije dostupan. Odaberite neki drugi.
fi: Tämä mukautettu URL ei ole käytettävissä. Kokeile jotain toista.
ka: ეს მორგებული ბმული არ არის ხელმისაწვდომი. სცადეთ სხვა.
pt_pt: Este URL personalizado não está disponível. Tente um diferente.
ru: Этот пользовательский URL-адрес недоступен. Попробуйте другой.
tr: Bu özel URL mevcut değil. Farklı bir tane deneyin.

source: Cannot shorten URL. Check Internet connectivity.
bs: Nije moguće skratiti URL. Provjerite internetsku vezu.
fi: URLia ei voi lyhentää. Tarkista Internet-yhteys.
ka: ბმულის შემოკლება შეუძლებელია. შეამოწმეთ ინტერნეტთან კავშირი.
pt_pt: Não é possível encurtar o URL. Verificar a conetividade com a Internet.
ru: Не удаётся сократить URL. Проверьте подключение к Интернету.
tr: URL kısaltılamıyor. İnternet bağlantısını kontrol edin.

source: Cannot add URL: %s
bs: Nije moguće dodati URL: %s
fi: URLia ei voi lisätä: %s
ka: ბმულის დამატება შეუძლებელია: %s
pt_pt: Não é possível adicionar URL: %s
ru: Невозможно добавить URL: %s
tr: URL eklenemiyor: %s

source: Error
bs: Greška
fi: Virhe
ka: შეცდომა
pt_pt: Erro
ru: Ошибка
tr: Hata

source: Original URL: {} Name: {} Shortened URL: {}
bs: Izvorni URL: {} Naziv: {} Skraćeni URL: {}
fi: Alkuperäinen URL: {} Nimi: {} Lyhennetty URL: {}
ka: საწყისი ბმული: {} სახელი: {} შემოკლებული ბმული: {}
pt_pt: URL original: {} Nome: {} URL abreviado: {}
ru: Исходный URL: {} Название: {} Сокращённый URL: {}
tr: Orijinal URL: {} Ad: {} Kısaltılmış URL: {}

source: Copied
bs: Kopirano
fi: Kopioitu
ka: დაკოპირებულია
pt_pt: Copiado
ru: URL скопирован в буфер обмена
tr: Kopyalandı

source: Are you sure you want to delete this URL: %s?
bs: Jeste li sigurni da želite izbrisati ovaj URL: %s?
fi: Haluatko varmasti poistaa tämän URLin: %s?
ka: დარწმუნებული ხართ, რომ გსურთ ამ ბმულის წაშლა: %s?
pt_pt: Tem a certeza de que pretende apagar este URL: %s?
ru: Вы действительно хотите удалить этот URL: %s?
tr: Bu URL'yi silmek istediğinizden emin misiniz: %s?

source: New name:
bs: Novi naziv
fi: Uusi nimi:
ka: ახალი სახელი:
pt_pt: Novo nome:
ru: Новое название:
tr: Yeni Ad:

source: Rename URL
bs: Preimenovanje URL-a
fi: Uudelleennimeä URL
ka: ბმულის სახელის გადარქმევა
pt_pt: Mudar o nome do URL
ru: Переименовать URL
tr: URL'yi yeniden adlandır

source: Are you sure you want to delete your saved URLs?
bs: Jeste li sigurni da žečlite izbrisati vaše spremljene URL-ove?
fi: Haluatko varmasti poistaa tallennetut URLit?
ka: დარწმუნებული ხართ, რომ გსურთ თქვენი შენახული ბმულების წაშლა?
pt_pt: Tem a certeza de que pretende eliminar os URLs guardados?
ru: Вы действительно хотите удалить сохраненные URL?
tr: Kayıtlı URL'lerinizi silmek istediğinizden emin misiniz?

source: URL Shortener
bs: Skraćivanje URL-a
fi: URLin lyhentäjä
ka: ბმულის შემოკლება
pt_pt: Encurtador de URL
ru: Сокращение URL
tr: URL Kısaltıcı

source: Shorten URLs through NVDA.
bs: Skraćujte URL-ove kroz NVDA dijalog.
fi: Lyhennä URLeja NVDA:n avulla.
ka: შეამოკლეთ ბმულები NVDA-ს საშუალებით.
pt_pt: Encurtar URLs através do NVDA.
ru: Сократить URL через NVDA.
tr: URL'leri NVDA aracılığıyla kısaltın.
