Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/debugHelper/*/debugHelper.xliff
Languages: ru, tr

source: Debug Helper
ru: Помощник по Отладке
tr: Hata Ayıklama Yardımcısı

source: Author: Luke Davis
ru: Автор: Luke Davis
tr: Yazar: Luke Davis

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı sürümü indir][1]

source: The purpose of this add-on is to make debugging things in NVDA easier.
ru: Цель этого дополнения - упростить отладку в NVDA.
tr: Bu eklentinin amacı, NVDA'da hata ayıklamayı kolaylaştırmaktır.

source: New features will be added based on user suggestions. All emails or [GitHub issues](https://github.com/XLTechie/debugHelper) with feedback or feature ideas are most welcome.
ru: Новые функции будут добавлены на основе предложений пользователей. Приветствуются все электронные письма или [проблемы с GitHub](https://github.com/XLTechie/debugHelper) с отзывами или идеями по функционалу.
tr: Kullanıcı önerilerine göre yeni özellikler eklenecektir. Geri bildirim veya özellik fikirleri içeren tüm e -postalar veya [GitHub sorunları](https://github.com/xltechie/debughelper) en hoş karşılanır.

source: Key Command
ru: Комбинация Клавиш
tr: Kısayol

source: NVDA+Shift+F1: inserts a mark line in the NVDA log.
ru: NVDA+Shift+F1: Вставляет строку с пометкой в журнал NVDA.
tr: NVDA+Shift+F1: NVDA günlüğüne bir işaret satırı ekler.

source: Explanation and Usage
ru: Объяснение и использование
tr: Açıklama ve Kullanım

source: When you press the command key, the add-on inserts a line like the following in the NVDA log (at the Info level):
ru: Когда вы нажмёте командную клавишу , дополнение вставит в журнал NVDA (на уровне информации) строку, подобную приведённой ниже:
tr: Komut tuşuna bastığınızda, eklenti NVDA günlüğüne (bilgi düzeyinde) aşağıdakiler gibi bir satır ekler:

source: -- mark 1 --
ru: -- метка 1 --
tr: -- İşaret 1 --

source: It will also announce: "Logged mark 1!"
ru: Оно также объявит: "Метка 1 записана в журнал!"
tr: Ayrıca şunu da duyuracak: "Günlüğe Kaydedilen İşaret 1!"

source: If you press the key again, you will get:
ru: Если вы нажмёте клавишу ещё раз, то получите:
tr: Tuşa tekrar basarsanız, şunları elde edersiniz:

source: -- Mark 2 --
ru: -- Метка 2 --
tr: -- İşaret 2 --

source: and "Logged mark 2!" will be spoken.
ru: и "Метка 2 записана в журнал!" будет произнесено.
tr: ve "Kayıtlı İşaret 2!" konuşulacak.

source: Let us say for example that you were about to perform a series of tasks, that you know generate lengthy error content in the NVDA log. You are going to post the relevant portions of your log to a mailing list or the [NVDA GitHub issue tracker](https://github.com/nvaccess/nvda/issues). However you don't want to hunt through your entire log to find the relevant content. So you use this add-on to insert mark 1, right before you do the thing that causes the first error. If you know something else will generate further errors, or a different kind, you insert another mark to separate that error from the previous one, or so you can say "this is what I was doing at mark 3, where some errors occurred."
ru: Предположим, например, что вы собирались выполнить ряд задач, которые, как вы знаете, привели к появлению большого количества ошибок в журнале NVDA. Вы собираетесь опубликовать соответствующие части своего журнала в списке рассылки или на [Отслеживание проблем NVDA на GitHub](https://github.com/nvaccess/nvda/issues). Однако вы не хотите просматривать весь свой журнал в поисках соответствующего содержимого. Поэтому вы используете это дополнение, чтобы вставить отметку 1 непосредственно перед выполнением действия, которое вызывает первую ошибку. Если вы знаете, что что-то еще поможет, генерируя новые ошибки или ошибки другого рода, вы вставляете другую метку, чтобы отделить эту ошибку от предыдущей, или чтобы вы могли сказать: "это то, что я делал на отметке 3, где произошли некоторые ошибки".
tr: Örneğin, NVDA günlüğünde uzun hata içeriği oluşturduğunu bildiğiniz bir dizi görevi gerçekleştirmek üzere olduğunuzu varsayalım. Günlüğünüzün ilgili bölümlerini bir posta listesine veya [VDA GitHub sorun izleyicisine](https://github.com/nvaccess/nvda/issues) gndereceksiniz. Ancak, ilgili içeriği bulmak için günlüğünüzün tamamında arama yapmak istemezsiniz. Yani bu eklentiyi, ilk hataya neden olan şeyi yapmadan hemen önce işaret 1'i eklemek için kullanırsınız. Başka bir şeyin daha fazla hata veya farklı türde bir hata oluşturacağını biliyorsanız, bu hatayı öncekinden ayırmak için başka bir işaret eklersiniz veya "bazı hataların meydana geldiği 3. işarette yaptığım şey buydu" diyebilirsiniz.

source: Another example: while using some application, something happens that causes an error (maybe you hear the Windows error sound). You want to go back and find that error later, but you don't want to stop working and save the log right now. So you use this add-on again, to insert a mark in your log. This time the mark will appear after the errors in your log, instead of before. But either way, the marks will help you narrow down the important sections of your log.
ru: Другой пример: при использовании какого-либо приложения происходит что-то, что вызывает ошибку (возможно, вы слышите звуковой сигнал ошибки Windows). Вы хотите вернуться и найти эту ошибку позже, но не хотите прекращать работу и сохранять журнал прямо сейчас. Итак, вы снова используете это дополнение, чтобы вставить отметку в свой журнал. На этот раз отметка появится после ошибок в вашем журнале, а не до них. Но, в любом случае, отметки помогут вам сузить поиск важных разделов журнала.
tr: Başka bir örnek: Bazı uygulamaları kullanırken hataya neden olan bir şey olur (belki Windows hata sesini duyarsınız). Daha sonra geri dönüp bu hatayı bulmak istiyorsunuz, ancak çalışmayı durdurmak ve günlüğü hemen kaydetmek istemiyorsunuz. Bu nedenle, günlüğünüze bir işaret eklemek için bu eklentiyi tekrar kullanırsınız. Bu sefer işaret, günlüğünüzdeki hatalardan önce değil, sonra görünecektir. Ancak her iki durumda da işaretler, günlüğünüzün önemli bölümlerini daraltmanıza yardımcı olacaktır.

source: The mark lines shown above can be easily searched for with the find command in a text editor such as Notepad or Notepad++.
ru: Отмеченные строки, показанные выше, можно легко найти с помощью команды поиска в текстовом редакторе, таком как блокнот или Notepad++.
tr: Yukarıda gösterilen işaret satırları, not defteri veya notepad ++ gibi bir metin düzenleyicisindeki Find komutuyla kolayca aranabilir.

source: Additionally, by default, there is a blank line inserted above each mark. Blank lines are also possible after the mark. Blank lines can be helpful if you are using NVDA's log viewer, or another text editor, and want to use the arrow keys to quickly read up/down through the log, to find a particular mark. It is easy to pick the word "blank" out of a bunch of text being spoken as you quickly move through the log. If you arrow really fast, you might need more than one blank line, which you can adjust in settings.
ru: Кроме того, по умолчанию над каждой отметкой вставляется пустая строка. После отметки также возможны пустые строки. Пустые строки могут быть полезны, если вы используете программу просмотра журнала NVDA или другой текстовый редактор и хотите использовать клавиши стрелок для быстрого просмотра журнала вверх / вниз, чтобы найти определённую отметку. Легко выделить слово "пусто" из множества произносимых текстов при быстром просмотре журнала. Если вы используете стрелку очень быстро, вам может потребоваться несколько пустых строк, которые вы можете указать в настройках.
tr: Ayrıca, varsayılan olarak her işaretin üzerine boş bir satır eklenir. İşaretten sonra boş satırlar da mümkündür. NVDA'nın günlük görüntüleyicisini veya başka bir metin düzenleyicisini kullanıyorsanız ve belirli bir işareti bulmak için günlüğü hızlı bir şekilde yukarı/aşağı okumak için ok tuşlarını kullanmak istiyorsanız boş satırlar yardımcı olabilir. Günlükte hızla ilerlerken, konuşulan bir grup metinden "boş" kelimesini seçmek kolaydır. Gerçekten hızlı ok atarsanız, ayarlardan ayarlayabileceğiniz birden fazla boş satıra ihtiyacınız olabilir.

source: Note: the mark count will survive the reloading of plugins (NVDA+Control+F3), but will start back at one if you restart NVDA.
ru: Примечание: Количество отметок не изменится после перезагрузки плагинов (NVDA+Control+F3), но вернется к единице, если вы перезапустите NVDA.
tr: Not: İşaret sayısı, eklentilerin (NVDA+Kontrol+F3) yeniden yüklenmesinden sonra da geçerli olacaktır, ancak NVDA'yı yeniden başlattığınızda yeniden birden başlayacaktır.

source: Configuration:
ru: Конфигурация:
tr: Yapılandırma:

source: In the Settings section of NVDA Preferences, you will find a "Debug Helper" category. In the settings dialog you can change the number of blank lines inserted before and after each mark line. The default is one line before, and zero after, although you can use zero through 10 lines for either.
ru: В разделе настроек NVDA, вы найдете категорию "Помощник по отладке". В диалоге настроек вы можете изменить количество пустых строк, вставляемых до и после каждой строки разметки. Значение по умолчанию - одна строка до и ноль после, хотя вы можете использовать от 0 до 10 строк в любом случае.
tr: NVDA Tercihlerinin Ayarlar bölümünde bir "Hata Ayıklama Yardımcısı" kategorisi bulacaksınız. Ayarlar iletişim kutusunda, her işaret satırından önce ve sonra eklenen boş satırların sayısını değiştirebilirsiniz. Varsayılan, önce bir satır ve sonra sıfırdır, ancak her ikisi için de 0 ila 10 satır kullanabilirsiniz. NVDA'nın Girdi Hareketleri panelinin Araçlar kategorisi altında, NVDA+Shift+F1'i istediğiniz bir tuş dizisine değiştirebilirsiniz.

source: Under the Tools category of NVDA's Input Gestures panel, you can change NVDA+Shift+F1 to a key sequence of your choice.
ru: В категории "Инструменты" панели жестов ввода NVDA вы можете изменить комбинацию клавиш NVDA+Shift+F1 на любую по вашему выбору.
tr: NVDA'nın Girdi Hareketleri panelinin Araçlar kategorisi altında, NVDA+Shift+F1 tuş kombinasyonunu istediğiniz bir tuş dizisiyle değiştirebilirsiniz.

source: Compatibility:
ru: Совместимость:
tr: Uyumluluk:

source: This add-on is compatible with NVDA versions 2017.3 (used with Windows XP), and all newer versions. Last tested with 2019.3.
ru: Это дополнение совместимо с версиями NVDA 2017.3 (используется с Windows XP) и всеми новыми версиями. Последняя протестированная - 2019.3.
tr: Bu eklenti NVDA sürümleri 2017.3 (Windows XP ile kullanılır) ve tüm yeni sürümlerle uyumludur. Son olarak 2019.3 ile test edildi.

source: Changelog
ru: Журнал изменений
tr: Değişiklik günlüğü

source: Version 1.0.2 (2019-08-28)
ru: Версия 1.0.2 (2019-08-28)
tr: Sürüm 1.0.2 (28-08-2019)

source: - Translation and code cleanup.
ru: - Перевод и очистка кода.
tr: - Çeviri ve Kod Temizleme.

source: Version 1.0.1 (2019-08-26)
ru: Версия 1.0.1 (2019-08-26)
tr: Sürüm 1.0.1 (26-08-2019)

source: - Minor bug-fix version to probably fix an install problem on certain versions of Windows.
ru: - Версия с незначительным исправлением ошибок для устранения проблемы с установкой в определенных версиях Windows.
tr: - Windows'un belirli sürümlerindeki bir yükleme sorununu muhtemelen düzeltmek için küçük hata düzeltme sürümü.

source: Version 1.0 (2019-08-22)
ru: Версия 1.0 (2019-08-22)
tr: Sürüm 1.0 (22-08-2019)

source: - Initial release. Including following features:
ru: - Первоначальный выпуск. Включены следующие функции:
tr: - İlk sürüm. Aşağıdaki özellikler dahil:

source: + Ability to generate numbered mark lines in the log (at info level).
ru: + Возможность генерировать пронумерованные строки для отметок в журнале (на информационном уровне).
tr: + Günlükte (bilgi düzeyinde) numaralı işaret satırları oluşturma yeteneği.

source: + Ability to add 0-10 blank lines before and after each mark line.
ru: + Возможность добавлять 0-10 пустых строк до и после каждой отмеченной строки.
tr: + Her işaretleme satırından önce ve sonra 0-10 boş satır ekleyebilme.

source: + Configuration via NVDA settings dialog system.
ru: + Настройка осуществляется с помощью диалоговой системы настроек NVDA.
tr: + NVDA Ayarları iletişim sistemi üzerinden yapılandırma.
