Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/debugHelper/*/debugHelper.po
Languages: fi, ru, tr

source: -- MARK {0} --
fi: -- MERKKI {0} --
ru: -- ОТМЕТКА {0} --
tr: -- {0} İŞARETLE --

source: &Debug Helper...
fi: &Virheenkorjausapuri...
ru: &Помощник по отладке...
tr: &Hata Ayıklama Yardımcısı...

source: Debug Helper add-on settings
fi: Virheenkorjausapurin asetukset
ru: Настройки дополнения помощника по отладке
tr: Hata Ayıklama Yardımcısı eklenti ayarları

source: Logging mark {0}!
fi: Lokiin tallennettu merkki {0}!
ru: Отметка {0} записана в журнал!
tr: Günlüğe kaydedilen işaret {0}!

source: Inserts a mark line in the log to aid in debugging
fi: Lisää lokiin merkki-alkuisen rivin,josta on apua virheenkorjauksessa
ru: Вставляет строку с отметкой в журнал для облегчения отладки
tr: Hata ayıklamaya yardımcı olmak için günlüğe bir işaret satırı ekler

source: Debug Helper
fi: Virheenkorjausapuri
ru: Помощник по отладке
tr: Hata Ayıklama Yardımcısı

source: Number of blank lines before each mark (can make marks easier to find with fast arrowing)
fi: Tyhjien rivien määrä ennen merkkiä (voi helpottaa merkkien löytämistä nopeasti nuolinäppäimillä liikuttaessa)
ru: Количество пустых строк перед каждой отметкой (может упростить поиск отметок с помощью быстрой прокрутки клавишами-стрелками)
tr: Her işaretten önceki boş satır sayısı (hızlı okla işaretlerin bulunmasını kolaylaştırabilir)

source: Number of blank lines after each mark
fi: Tyhjien rivien määrä merkin jälkeen
ru: Количество пустых строк после каждой отметки
tr: Her işaretten sonraki boş satır sayısı

source: Debug Helper Settings
fi: Virheenkorjausapurin asetukset
ru: Настройки помощника по отладке
tr: Hata Ayıklama Yardımcısı Ayarları

source: Makes debugging tasks easier for developers and others trying to solve problems. Inserts sequentially numbered mark lines in the log when you press NVDA+shift+F1, to make it easy to search for things, by "tagging" them. Contact me if you find it useful, and especially with feature ideas.
fi: Helpottaa virheenkorjausta kehittäjillä ja muilla, jotka yrittävät ratkaista ongelmia. Lisää lokiin järjestyksessä numeroituja merkki-alkuisia rivejä painettaessa NVDA+Vaihto+F1, mikä helpottaa asioiden löytämistä "merkitsemällä" ne. Ota yhteyttä tekijään, mikäli tästä lisäosasta on sinulle hyötyä, ja etenkin, jos sinulla on ominaisuusehdotuksia.
ru: Упрощает задачи отладки для разработчиков и других лиц, пытающихся решить проблемы. При нажатии клавиш NVDA+shift+F1 в журнал добавляются последовательно пронумерованные строки с отметками, чтобы упростить поиск объектов, "отмечая" их. Свяжитесь со мной, если вы сочтёте это полезным, особенно если у вас есть идеи для новых функций.
tr: Geliştiriciler ve sorunları çözmeye çalışan diğerleri için hata ayıklama görevlerini kolaylaştırır. Nesneleri "etiketleyerek" aramayı kolaylaştırmak için NVDA+shift+F1 tuşlarına bastığınızda günlüğe sıralı olarak numaralandırılmış işaret satırları ekler. Yararlı bulursanız ve özellikle yenilik fikirleriyle bana ulaşın.
