Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/nvdaDevTestToolbox/*/nvdaDevTestToolbox.po
Languages: ru, tr

source: Save As
ru: Сохранить как
tr: Farklı kaydet

source: Browse...
ru: Обзор...
tr: Gözat...

source: NVDA log file (*.{ext})
ru: Файл журнала NVDA (*.{ext})
tr: NVDA günlük dosyası (*.{ext})

source: Select a file
ru: Выберите файл
tr: Bir dosya seçin

source: Select a directory
ru: Выберите каталог
tr: Bir konum seçin

source: Specify some options and restart
ru: Укажите некоторые параметры и перезапустите
tr: Bazı seçenekleri belirtin ve yeniden başlatın

source: The file where log messages should be written to
ru: Файл, в который следует записывать сообщения журнала
tr: Günlük mesajlarının yazılması gereken dosya

source: The lowest level of message logged
ru: Самый низкий уровень зарегистрированных сообщений
tr: Günlüğe kaydedilen en düşük ileti düzeyi

source: The path where all settings for NVDA are stored
ru: Путь, по которому хранятся все настройки для NVDA
tr: NVDA için tüm ayarların saklandığı konum

source: Override the configured NVDA language
ru: Переопределить настроенный язык NVDA
tr: Yapılandırılan NVDA dilini geçersiz kıl

source: No sounds, no interface, no start message, etc.
ru: Ни звуков, ни интерфейса, ни исходного сообщения и т. д.
tr: Ses yok, arayüz yok, başlangıç ​​mesajı yok, vs.

source: Secure mode
ru: Безопасный режим
tr: Güvenli mod

source: Add-ons will have no effect
ru: Дополнения не окажут никакого влияния
tr: Eklentilerin hiçbir etkisi olmayacak

source: Don't change the global system screen reader flag
ru: Не изменять флаг читателя экрана глобальной системы
tr: Global sistem ekran okuyucu bayrağını değiştirmeyin

source: Restarts NVDA with specific options.
ru: Перезапускает NVDA с определёнными параметрами.
tr: Belirli seçeneklerle NVDA'yı yeniden başlatır.

source: Scripts without description (modify at your own risk!)
ru: Скрипты без описания (меняйте на свой страх и риск!)
tr: Açıklama içermeyen komut dosyaları (kendi sorumluluğunuzda değişiklik yapın!)

source: Toggles the extended script description mode.
ru: Переключает режим расширенного описания скриптов.
tr: Genişletilmiş komut dosyası açıklama modunu değiştirir.

source: Extended script description mode enabled
ru: Режим расширенного описания скриптов включён
tr: Genişletilmiş komut dosyası açıklama modu etkinleştirildi

source: Extended script description mode disabled
ru: Режим расширенного описания скриптов выключен
tr: Genişletilmiş komut dosyası açıklama modu devre dışı bırakıldı

source: NVDA will open the code of the script of the next gesture instead of executing the corresponding command.
ru: NVDA откроет код скрипта для следующего жеста вместо выполнения соответствующей команды.
tr: NVDA, ilgili komutu çalıştırmak yerine bir sonraki hareketin komut dosyasının kodunu açacaktır.

source: Execute a gesture to open the code of the corresponding script.
ru: Выполните жест, чтобы открыть код соответствующего сценария.
tr: İlgili komut dosyasının kodunu açmak için bir hareket uygulayın.

source: Script not found for {gestureName}
ru: Для {gestureName} скрипт не найден
tr: {gestureName} için komut dosyası bulunamadı

source: Performs a reverse UI translation of the last speech, using NVDA translation catalogs.
ru: Выполняет обратный перевод последней речи пользовательского интерфейса, используя каталоги перевода NVDA.
tr: NVDA çeviri kataloglarını kullanarak son konuşmanın ters kullanıcı arayüzü çevirisini gerçekleştirir.

source: Message not found in NVDA's translation catalog
ru: Сообщение не найдено в каталоге переводов NVDA
tr: NVDA'nın çeviri kataloğunda mesaj bulunamadı

source: Performs a reverse UI translation of the last speech, using NVDA and add-ons translation catalogs.
ru: Выполняет обратный перевод последней речи пользовательского интерфейса, используя каталоги перевода NVDA и дополнений.
tr: NVDA ve eklenti çeviri kataloglarını kullanarak son konuşmanın ters kullanıcı arayüzü çevirisini gerçekleştirir.

source: Message not found in NVDA's and addons translation catalogs
ru: Сообщение не найдено в каталогах переводов NVDA и дополнений
tr: NVDA'nın ve eklentilerin çeviri kataloglarında mesaj bulunamadı

source: Reverse translation not available.
ru: Обратный перевод недоступен.
tr: Ters çeviri mevcut değil.

source: Retrieving translated strings of NVDA not supported for this version of NVDA.
ru: Получение переведённых строк NVDA не поддерживается для этой версии.
tr: NVDA'nın çevrilmiş dizelerinin alınması, NVDA'nın bu sürümünde desteklenmemektedir.

source: Reverse translation not available: NVDA is not translated.
ru: Обратный перевод недоступен: NVDA не переведена.
tr: Ters çeviri mevcut değil: NVDA çevrilmemiş.

source: No last spoken text
ru: Нет последнего произнесённого текста
tr: Son konuşulan metin yok

source: Off
ru: Выключено
tr: Kapalı

source: On
ru: Включено
tr: Aktif

source: {name} add-on can only be configured from the Normal Configuration profile. Please close this dialog, set your config profile to default and try again.
ru: Дополнение {name} можно настроить только из профиля нормальной конфигурации. Пожалуйста, закройте этот диалог, установите начальный профиль конфигурации и повторите попытку.
tr: {name} eklentisi yalnızca Normal Yapılandırma profilinden yapılandırılabilir. Lütfen bu iletişim kutusunu kapatın, yapılandırma profilinizi varsayılana ayarlayın ve tekrar deneyin.

source: Command to open a file in your favorite editor (use "{path}" and "{line}" placeholders in this command)
ru: Команда для открытия файла в вашем любимом редакторе (используйте заполнители "{path}" и "{line}" в этой команде)
tr: Bir dosyayı favori düzenleyicinizde açma komutu (bu komutta "{path}" ve "{line}" yer tutucularını kullanın)

source: NVDA source code path
ru: Путь исходного кода NVDA
tr: NVDA kaynak kodu konumu

source: Backup of old logs:
ru: Резервное копирование старых журналов:
tr: Eski günlükleri yedekleme:

source: Limit the number of backups to:
ru: Ограничить количество резервных копий до:
tr: Yedekleme sayısını aşağıdakilerle sınırlandırın:

source: Copy reverse &translation to clipboard
ru: Копировать обратный &перевод в буфер обмена
tr: &Ters çeviriyi panoya kopyala

source: Preserve console input history after restart
ru: Сохранять историю ввода в консоль после перезапуска
tr: Yeniden başlatmanın ardından konsol giriş geçmişini koru

source: Number of inputs preserved in Python console history
ru: Число вводов, сохранённых в истории консоли Python
tr: Python konsolu geçmişinde korunan giriş sayısı

source: No path configured for NVDA sources; please see documentation to configure it.
ru: Для источников NVDA путь не настроен; пожалуйста, обратитесь к документации, чтобы настроить его.
tr: NVDA kaynakları için yapılandırılmış konum yok; yapılandırmak için lütfen belgelere bakın.

source: No open file command configured; please see documentation to configure it.
ru: Не настроена команда открытия файла; пожалуйста, обратитесь к документации, чтобы настроить её.
tr: Açık dosya komutu yapılandırılmadı; yapılandırmak için lütfen belgelere bakın.

source: Wrong format for the open file command in the configuration; please see documentation to configure it.
ru: Неправильный формат команды открытия файла в конфигурации; обратитесь к документации, чтобы настроить его.
tr: Yapılandırmada dosya aç komutu için yanlış biçim; yapılandırmak için lütfen belgelere bakın.

source: Editor not found at {}; please check your configuration.
ru: Редактор по адресу {} не найден, пожалуйста, проверьте вашу конфигурацию.
tr: Düzenleyici {} konumunda bulunamadı; lütfen yapılandırmanızı kontrol edin.

source: Object not found: {}
ru: Объект не найден: {}
tr: Nesne bulunamadı: {}

source: File not found: {}
ru: Файл не найден: {}
tr: Dosya bulunamadı: {}

source: No more item
ru: Больше нет элементов
tr: Başka öğe yok

source: No more block
ru: Больше нет блока
tr: Artık blok yok

source: No block here
ru: Здесь нет блока
tr: Burada blok yok

source: No error indicator for this frame
ru: Для этого кадра нет индикатора ошибки
tr: Bu çerçeve için hata göstergesi yok

source: No traceback here
ru: Здесь нет обратной трассировки
tr: Burada geri iz yok

source: Moves to the next logged message of type {st}.
ru: Переходит к следующему зарегистрированному сообщению типа {st}.
tr: {st} türünde günlüğe kaydedilen sonraki mesaja gider.

source: Moves to the previous logged message of type {st}.
ru: Переходит к предыдущему зарегистрированному сообщению типа {st}.
tr: {st} türünde günlüğe kaydedilen önceki mesaja gider.

source: Log Reader commands enabled.
ru: Команды чтения журнала включены.
tr: Günlük Okuyucu komutları etkinleştirildi.

source: Log Reader commands disabled.
ru: Команды чтения журнала выключены.
tr: Günlük Okuyucu komutları devre dışı bırakıldı.

source: Toggles speech translation in the log
ru: Переключает перевод речи в журнале
tr: Günlükteki konuşma çevirisini değiştirir

source: Log translation disabled
ru: Перевод журнала выключен
tr: Günlük çevirisi devre dışı bırakıldı

source: Log translation enabled
ru: Перевод журнала включён
tr: Günlük çevirisi etkinleştirildi

source: Cannot enable log translation. Please install or enable Instant Translate add-on.
ru: Не удалось включить перевод журнала. Установите или включите дополнение Instant Translate.
tr: Günlük çevirisi etkinleştirilemiyor. Lütfen Anında Çeviri eklentisini yükleyin veya etkinleştirin.

source: Opens the source code file whose path is located at the caret's position.
ru: Открывает файл исходного кода, путь к которому находится в позиции каретки.
tr: Yolu imlecin konumunda bulunan kaynak kod dosyasını açar.

source: No file path or object found on this line.
ru: В этой строке не найден путь к файлу или объекту.
tr: Bu satırda dosya konumu veya nesne bulunamadı.

source: Move the caret at the error's position in a traceback frame. A second press selects the erroneous code. A third press selects the error with its context.
ru: Перемещает каретку в позицию ошибки в кадре трассировки. Второе нажатие выбирает ошибочный код. Третье нажатие выбирает ошибку с её контекстом.
tr: Geri izleme çerçevesinde düzeltme imlecini hatanın bulunduğu konuma taşıyın. İkinci basış hatalı kodu seçer. Üçüncü basışta hata bağlamıyla birlikte seçilir.

source: Not in a log message
ru: В не сообщении журнала
tr: Günlük mesajında ​​değil

source: No block in this message
ru: В этом сообщении нет блока
tr: Bu mesajda blog yok

source: Displays help for the Log reader commands
ru: Отображает справку по командам чтения журнала
tr: Günlük okuyucu komutlarına ilişkin yardımı görüntüler

source: Log Reader commands ({name})
ru: Команды чтения журнала ({name})
tr: Günlük Okuyucu komutları ({name})

source: Adds a marker in the log.
ru: Добавляет маркер в журнале.
tr: Günlüğe bir işaretleyici ekler.

source: Marker {} added in the log
ru: Маркер {} добавлен в журнал
tr: {} işaretçisi günlüğe eklendi

source: Activates or deactivates the log Reader commands.
ru: Включает или выключает команды чтения журнала.
tr: Günlük Okuyucu komutlarını etkinleştirir veya devre dışı bırakır.

source: Not in a text area.
ru: Не в текстовой области.
tr: Metin alanında değil.

source: Unknown
ru: Неизвестно
tr: Bilinmiyor

source: Logs Manager
ru: Диспетчер журналов
tr: Günlük Yöneticisi

source: Logs in {folder}
ru: Журналы в {folder}
tr: {folder} içindeki günlükler

source: Date
ru: Дата
tr: Tarih

source: Type
ru: Тип
tr: Tür

source: File name
ru: Имя файла
tr: Dosya adı

source: &Open
ru: &Открыть
tr: &Aç

source: &Copy files
ru: &Копировать файлы
tr: &Dosyaları Kopyala

source: &Delete
ru: &Удалить
tr: &Sil

source: Settings...
ru: Настройки...
tr: Ayarlar...

source: &Close
ru: &Закрыть
tr: &Kapat

source: The selected log(s) is (are) not available anymore
ru: Выбранные журналы больше недоступны
tr: Seçilen günlükler artık mevcut değil

source: The following files will be removed: {logsList} Would you like to continue?
ru: Следующие файлы будут удалены: {logsList} Хотите продолжить?
tr: Aşağıdaki dosyalar kaldırılacak: {logsList} Devam etmek istiyor musunuz?

source: Confirm deletion
ru: Подтвердите удаление
tr: Silmeyi onayla

source: {nLogs} log files could not be deleted. See NVDA's log for details.
ru: Файлы журналов {nLogs} не удалось удалить. Подробные сведения приведены в журнале NVDA.
tr: {nLogs} günlük dosyaları silinemedi. Ayrıntılar için NVDA günlüğüne bakın.

source: The following logs files could not be deleted. {files}
ru: Следующие файлы журналов не могут быть удалены. {files}
tr: Aşağıdaki günlük dosyaları silinemedi. {files}

source: Error
ru: Ошибка
tr: Hata

source: Log files copied
ru: Файлы журнала скопированы
tr: Günlük dosyaları kopyalandı

source: Unable to copy the selected logs; the clipboard is not available.
ru: Не удалось скопировать выбранные журналы; Буфер обмена недоступен.
tr: Seçilen günlükler kopyalanamıyor; pano kullanılamıyor.

source: File copied
ru: Файл скопирован
tr: Dosya kopyalandı

source: &Logs manager...
ru: &Диспетчер журналов...
tr: Gün&lük yöneticisi...

source: Copy the selection and anonymize it.
ru: Копирует и анонимизирует выделение.
tr: Seçimi kopyalayın ve anonimleştirin.

source: No selection
ru: Нет выделения
tr: Seçim yok

source: Could not anonymize and copy selection. {}
ru: Не удалось анонимизировать и скопировать выделенное. {}
tr: Seçim anonimleştirilip kopyalanamadı. {}

source: Selected text anonymized and copied in the clipboard.
ru: Выделенный текст анонимизирован и скопирован в буфер обмена.
tr: Seçilen metin anonimleştirilir ve panoya kopyalanır.

source: Invalid regular expression in anonymization rules file. File: {} Line: {} Pattern: {} Error: {}
ru: Недопустимое регулярное выражение в файле правил анонимизации. Файл: {} Строка: {} Шаблон: {} Ошибка: {}
tr: Anonimleştirme kuralları dosyasında geçersiz normal ifade. Dosya: {} Satır: {} Model: {} Hata: {}

source: Toggles the stack trace log when the speech function is called.
ru: Переключает журнал отслеживания стека при вызове языковой функции.
tr: Konuşma işlevi çağrıldığında yığın izleme günlüğünü değiştirir.

source: Stacktrace log enabled
ru: Журнал отслеживания стека включён
tr: Yığın izleme günlüğü etkin

source: Stacktrace log disabled
ru: Журнал отслеживания стека выключен
tr: Yığın izleme günlüğü devre dışı

source: Toggles play a sound for logged error.
ru: Переключает воспроизведение звука для зарегистрированной ошибки.
tr: Günlüğe kaydedilen hata için ses çalma özelliğini değiştirir.

source: Yes
ru: Да
tr: Evet

source: Only in NVDA test versions
ru: Только в тестовых версиях NVDA
tr: Yalnızca NVDA test sürümlerinde

source: Report the last error logged. A second press clears the memorized last error.
ru: Сообщает о последней зарегистрированной ошибке. Повторное нажатие удаляет последнюю запомненную ошибку.
tr: Günlüğe kaydedilen son hatayı duyurur. İkidefa basma, hafızaya alınan son hatayı siler.

source: No error
ru: Ошибки не обнаружены
tr: Hata yok

source: Last error cleared
ru: Последняя ошибка удалена
tr: Son hata temizlendi

source: Entry point for {name} layered commands
ru: Точка входа для многослойных команд для {name}
tr: {name} katmanlı komutlar için giriş noktası

source: Displays help on {name} layered commands
ru: Отображает справку для многослойных команд {name}
tr: {name} katmanlı komutlarla ilgili yardım görüntüler

source: {name} layered commands
ru: многослойные команды {name}
tr: {name} katman komutları

source: Reports the currently selected property of the object property explorer for the navigator object.
ru: Объявляет текущее выбранное свойство из проводника свойств объекта для объекта навигатора.
tr: Gezgin nesnesindeki nesne özellik gezgininin o anda seçili olan özelliğini raporlar.

source: Displays the currently selected property of the object property explorer for the navigator object in a browseable message.
ru: Отображает текущее выбранное свойство из проводника свойств объекта для объекта навигатора.
tr: Gezgin nesnesindeki nesne özellik gezgininin o anda seçili olan özelliğini, göz atılabilir bir mesaj içinde görüntüler.

source: Selects the next property of the object property explorer and reports it for the navigator object.
ru: Выбирает следующее свойство проводника свойств объекта и сообщает его объекту навигатора.
tr: Nesne özellik gezgininin sonraki özelliğini seçer ve gezgin nesnesi için raporlar.

source: Selects the previous property of the object property explorer and reports it for the navigator object.
ru: Выбирает предыдущее свойство проводника свойств объекта и сообщает его объекту навигатора.
tr: Nesne özellik gezgininin önceki özelliğini seçer ve gezgin nesnesi için raporlar.

source: Toggles custom reporting of objects using the Object explorer's selected property when you use object navigation commands.
ru: Включает сообщения о пользовательских объектах с использованием выбранного свойства исследователя объектов при использовании команд объектной навигации.
tr: Nesne gezinti komutları kullanıldığında, Nesne gezgini'nin seçili özelliğini kullanarak nesnelerin özel Bildirimini açar veya kapatır.

source: Custom object reporting enabled
ru: Проговаривание собственных объектов включено
tr: Özel nesne bildirimi etkin

source: Custom object reporting disabled
ru: Проговаривание собственных объектов выключено
tr: Özel nesne bildirimi devre dışı

source: Opens {name} settings
ru: Открывает настройки {name}
tr: {name} ayarlarını açar

source: NVDA Dev & Test Toolbox
tr: NVDA Geliştirici ve Test Araç Kutusu

source: A set of tools for NVDA developers and testers.
ru: Набор инструментов для разработчиков и тестировщиков NVDA.
tr: NVDA geliştiricileri ve testçileri için bir dizi araç.

source: * Python console history can now be preserved accross restarts. * Reverse translation: Added a second command to reverse translate a string using both NVDA and its add-ons translations. * New log reader commans to jump to previous or next braille output message * New log reader commans to jump to previous or next block in a message, e.g. previous or next thread stack in a watchdog freeze report, previous or next block of properties in the developer info for navigator object, etc. * New log reader commands to jump to the first or last interesting line of a block, e.g. first or last frame of a traceback * A new log reader "Go to error" command to jump to the error in a traceback frame. * A new log reader command to display an help message listing all the available commands while reading a log. * The log reading mode is now enabled by default in the Python console output pane. * A new command to anonymize a log * The console startup script now supports unicode strings (for Python 3 only); full unicode file may not be supported though. * The Python console startup script will now only be executed once and only once when the console opens. A bug where this script could be executed many times when reloading the add-ons has been fixed. * Improved error handling in the console startup script. * Bugfix: An empty log files created when log is disabled do not fail anymore to be saved as old log. * Speech on demand is now supported in layered commands * Improved error handling of the script opener command (in case of wrong or missing configuration, or when a braille display is in use).
ru: * История консоли Python теперь может сохраняться при перезапуске. * Обратный перевод: добавлена ​​вторая команда для обратного перевода строки с использованием перевода NVDA и её дополнений. * Новые команды чтения журнала для перехода к предыдущему или следующему сообщению брайлевского вывода * Новые команды чтения журнала для перехода к предыдущему или следующему блоку сообщения, например. предыдущий или следующий стек потоков в отчете о заморозке сторожевого таймера, предыдущий или следующий блок свойств в информации о разработчике для объекта навигатора и т. д. * Новые команды чтения журнала для перехода к первой или последней интересующей строке блока, например. первый или последний кадр обратной трассировки * Новая команда чтения журнала "Перейти к ошибке" для перехода к ошибке в кадре трассировки. * Новая команда чтения журнала для отображения справочного сообщения со списком всех доступных команд во время чтения журнала. * Режим чтения журнала теперь включен по умолчанию на панели вывода консоли Python. * Новая команда для анонимизации журнала * Скрипт запуска консоли теперь поддерживает строки Юникода (только для Python 3); Однако полный файл Unicode может не поддерживаться. * Скрипт запуска консоли Python теперь будет выполняться только один раз и только при первом открытии консоли. Исправлена ошибка, из-за которой этот скрипт мог выполняться много раз при перезагрузке дополнений. * Улучшена обработка ошибок в скрипте запуска консоли. * Исправлена ошибка: пустые файлы журналов, созданные при отключении журнала, больше не будут сохраняться как старый журнал. * Речь по требованию теперь поддерживается в многоуровневых командах * Улучшена обработка ошибок команды открытия скрипта (в случае неправильной или отсутствующей конфигурации или при использовании брайлевского дисплея).
tr: * Python konsolu geçmişi artık yeniden başlatmalarda korunabiliyor. * Ters çeviri: Hem NVDA'yı hem de eklenti çevirilerini kullanarak bir dizeyi ters çevirmek için ikinci bir komut eklendi. * Önceki veya sonraki braille çıkış mesajına atlamak için yeni günlük okuyucu komutları * Yeni günlük okuyucu, bir mesajda önceki veya sonraki bloğa atlamak için komut verir, ör. bir gözlemci dondurma raporundaki önceki veya sonraki iş parçacığı yığını, gezgin nesnesi için geliştirici bilgisindeki önceki veya sonraki özellik bloğu vb. * Yeni günlük okuyucu komutları bir bloğun ilk veya son ilginç satırına atlamak için kullanılır; geri izlemenin ilk veya son karesi * Geri izleme çerçevesindeki hataya atlamak için yeni bir günlük okuyucu "Hataya git" komutu. * Bir günlüğü okurken mevcut tüm komutları listeleyen bir yardım mesajı görüntüleyen yeni bir günlük okuyucu komutu. * Günlük okuma modu artık Python konsolu çıktı bölmesinde varsayılan olarak etkindir. * Günlüğü anonimleştirmek için yeni bir komut * Konsol başlangıç ​​Komutu artık unicode dizeleri destekliyor (yalnızca Python 3 için); tam unicode dosyası desteklenmeyebilir. * Python konsolu başlangıç ​​komut dosyası artık konsol açıldığında yalnızca bir kez ve yalnızca bir kez yürütülecek. Eklentileri yeniden yüklerken bu komut dosyasının birçok kez çalıştırılabilmesine neden olan bir hata düzeltildi. * Konsol başlangıç ​​komut dosyasındaki hata işleme iyileştirildi. * Hata düzeltme: Günlük devre dışı bırakıldığında oluşturulan boş günlük dosyaları artık eski günlük olarak kaydedilemiyor. * İsteğe bağlı konuşma artık katmanlı komutlarda destekleniyor * Komut dosyası açıcı komutunun hata işlemesi iyileştirildi (yanlış veya eksik yapılandırma durumunda veya bir braille ekranı kullanıldığında).
