Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/nvdaDevTestToolbox/*/nvdaDevTestToolbox.xliff
Languages: ru

source: Author: Cyrille Bougot
ru: Автор: Cyrille Bougot

source: NVDA compatibility: 2019.2 and beyond
ru: Совместимость с NVDA: 2019.2 и выше

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]

source: This add-on gathers various features for NVDA debugging and testing.
ru: Это дополнение объединяет различные функции для отладки и тестирования NVDA.

source: Features
ru: Возможности

source: An enhanced restart dialog to specify some extra options when restarting NVDA.
ru: Расширенный диалог перезапуска для указания некоторых дополнительных параметров при перезапуске NVDA.

source: Various features related to logged errors.
ru: Различные функции, связанные с зарегистрированными ошибками.

source: An object property explorer.
ru: Обозреватель свойств объекта.

source: Script tools: an extended script description mode and a script opener.
ru: Инструменты скрипта: расширенный режим описания скрипта и открытие скриптов.

source: Commands to help log reading and analyzing.
ru: Команды, помогающие считывать и анализировать журнал.

source: Backups of old logs
ru: Резервные копии старых журналов

source: A command to anonymize a log
ru: Команда анонимизации журнала

source: Python console enhancements such as a custom startup script and the possibility to preserve input history in memory after NVDA restarts.
ru: Улучшения консоли Python, такие как собственный скрипт запуска и возможность сохранять историю ввода в памяти после перезапуска NVDA.

source: In the Python console workspace, a function to open the source code of an object.
ru: В рабочей области консоли Python есть функция для открытия исходного кода объекта.

source: A command to log the stack trace of the speech.speak function.
ru: Команда для регистрации трассировки стека функции speech.speak.

source: A command to reverse translate the items of the interface.
ru: Команда обратного перевода элементов интерфейса.

source: Commands
ru: Команды

source: This add-on uses layered commands for all of the new commands it adds.
ru: Это дополнение использует многослойные команды для всех новых команд, которые оно добавляет.

source: The entry point for these commands is `NVDA+X`; thus all the commands should be executed by `NVDA+X` followed by another single letter or gesture.
ru: Точка входа для этих команд - `nvda+x`; Таким образом, все команды должны выполняться с помощью `nvda+x`, за которой следует одна буква или жест.

source: You can list all the available layered commands pressing `NVDA+X, H`.
ru: Вы можете узнать все доступные многослойные команды, нажимая `nvda+x, h`.

source: For the commands that you use more frequently, you can also define a direct gesture in the input gesture dialog.
ru: Для часто использующихся команд, вы также можете определить прямой жест в диалоге жестов ввода.

source: Enhanced restart dialog
ru: Расширенный диалог перезапуска

source: The `NVDA+X, Q` command opens a dialog to specify some extra options before restarting NVDA.
ru: Команда `NVDA+X, Q` открывает диалог, чтобы указать некоторые дополнительные параметры перед перезапуском NVDA.

source: The options that can be specified correspond to the [command line options][2] that can be used with `nvda.exe`, e.g. `-c` for config path, `--disable-addons` to disable add-ons, etc.
ru: Параметры, которые можно указать, соответствуют параметрам [командной строки][2], которые можно использовать с `nvda.exe`, например, `-c` для пути конфигурации, `--disable-addons`, чтобы отключить дополнения и т. Д.

source: Features related to logged errors
ru: Функции, связанные с зарегистрированными ошибками

source: Report last logged error
ru: Сообщить о последней зарегистрированной ошибке

source: Pressing `NVDA+X, E` allows to report the last error logged without needing to open the log. A second press clears the memorized last error.
ru: Нажатие `NVDA+X, E` позволяет сообщать о последней ошибке, зарегистрированной без необходимости открывать журнал. Второе нажатие очищает последнюю запомненную ошибку.

source: Play a sound for logged errors
ru: Воспроизведение звука при обнаружении зарегистрированных ошибок

source: The ["Play a sound for logged errors" setting][4] has been introduced in NVDA 2021.3 and allows to specify if NVDA will play an error sound in case an error is logged.
ru: Параметр ["Воспроизводить звук при зарегистрированных ошибках"][4] был введен в NVDA 2021.3 и позволяет указать, будет ли NVDA воспроизводить звук ошибки в случае регистрации ошибки.

source: This add-on provides an additional command (`NVDA+X, shift+E`) to toggle this setting.
ru: Это дополнение предоставляет дополнительную команду (`NVDA+X, shift+E`) для переключения этой настройки.

source: You can choose:
ru: Вы можете выбрать:

source: "Only in test versions" (default) to make NVDA play error sounds only if the current NVDA version is a test version (alpha, beta or run from source).
ru: "Только в тестовых версиях" (по умолчанию), чтобы ошибка воспроизведения NVDA воспроизводилась только в том случае, если текущая версия NVDA является тестовой (альфа, бета-версия или запущена из исходного кода).

source: "Yes" to enable error sounds no matter your current NVDA version.
ru: "Да" для включения звуков ошибок независимо от вашей текущей версии NVDA.

source: For NVDA prior to 2021.3, this add-on provides the backport of this feature and the possibility to control it with the keyboard command.
ru: Для NVDA до 2021.3 это дополнение обеспечивает перенос этой функции и возможность управлять ею с помощью команд с клавиатуры.

source: The checkbox in the Advanced settings panel is not backported however.
ru: Однако флажок в панель дополнительных настроек не перенесён.

source: Object property explorer
ru: Обозреватель свойств объекта

source: This feature allows to report some properties of the current navigator object without opening the log viewer.
ru: Эта функция позволяет сообщать о некоторых свойствах текущего объекта навигатора, не открывая просмотрщик журнала.

source: To list the properties of an object, move the navigator object to it and use the following commands:
ru: Чтобы просмотреть свойства объекта, переместите к нему объект навигатора и используйте следующие команды:

source: `NVDA+X, upArrow`: Selects the previous property and reports it for the navigator object.
ru: `NVDA+X, стрелка вверх`: Выбирает предыдущее свойство и сообщает его в объекте навигатора.

source: `NVDA+X, downArrow`: Selects the next property and reports it for the navigator object.
ru: `NVDA+X, стрелка вниз`: Выбирает следующее свойство и сообщает его в объекте навигатора.

source: `NVDA+X, N`: Reports the currently selected property for the navigator object
ru: `NVDA+X, N`: Сообщает выбранное в настоящее время свойство в объекте навигатора

source: `NVDA+X, shift+N`: Displays the currently selected property for the navigator object in a browseable message
ru: `NVDA+X, shift+N`: Отображает выбранное в настоящее время свойство объекта навигатора в просмотровом сообщении

source: The list of the supported properties is the following:
ru: Список поддерживаемых свойств следующий:

source: When using object navigation commands, you can also choose to have the currently selected property reported instead of NVDA usual object reporting.
ru: При использовании команд навигации объекта вы также можете выбирать в настоящее время выбранное свойство вместо обычной отчётности по объектам NVDA.

source: A toggle command, `NVDA+X, control+N`, allows to switch between this custom reporting of objects and NVDA usual reporting.
ru: Команда переключения, `NVDA+X, control+N`, позволяет переключаться между этой пользовательской отчётностью об объектах и обычной отчётностью NVDA.

source: For exemple, you may select "windowClassName" property and enable custom object reporting.
ru: Например, вы можете выбрать свойство "windowClassName" и включить создание объявлений по настраиваемым объектам.

source: Then when moving the navigator object to next or previous object, you will hear the object's windowClassName instead of usual reporting.
ru: Тогда при перемещении объекта навигатора к следующему или предыдущему объекту вместо обычного сообщения вы услышите имя класса окна объекта.

source: Script tools
ru: Инструменты скрипта

source: The script opener
ru: Открытие скриптов

source: The script opener command allows to open the code of a script knowing its gesture.
ru: Команда открытия скриптов позволяет открывать код сценария, зная его жест.

source: To use it press `NVDA+x, C` and then the gesture of the script which you want to see the code of.
ru: Для её использования нажмите `NVDA+x, C` и затем жест скрипта, который вы хотите увидеть.

source: For example to see the code of the script that reports the title of the foreground window, press `NVDA+X, C` and then `NVDA+T`.
ru: Например, чтобы увидеть код скрипта, который сообщает заголовок окна переднего плана, нажмите `NVDA+X, C` и затем `NVDA+T`.

source: For this feature to work, you need to have configured your [favorite editor's command](#settingsOpenCommand) in the add-on's settings.
ru: Чтобы эта функция работала, вам нужно настроить [команду любимого редактора](#settingsOpenCommand) в настройках дополнения.

source: If you are not running NVDA from source, the [location of NVDA source code](#settingsNvdaSourcePath) should also have been configured.
ru: Если вы не запускаете NVDA из исходного кода и хотите открывать код NVDA, также нужно настроить [местоположение исходного кода NVDA](#settingsNvdaSourcePath).

source: Extended script description mode
ru: Расширенный режим описания скрипта

source: The extended script description mode allows to have reported information on scripts without description in input help mode.
ru: Режим расширенного описания скрипта позволяет сообщать информацию о скриптах без описания в режиме справки по вводу.

source: When the Extended script description mode is active, the input help mode (NVDA+1) is modified as follows.
ru: Когда активен режим расширенного описания скрипта, режим справки по вводу (NVDA+1) изменяется следующим образом.

source: If a script has no description, the script's name and class are reported.
ru: Если скрипт не содержит описания, сообщаются имя и класс скрипта.

source: If a script has a description, its description is reported as usual.
ru: Если скрипт содержит описание, его описание сообщается как обычно.

source: The gesture to activate or deactivate this feature is `NVDA+X, D`.
ru: Жест для активации или деактивации этой функции - `NVDA+X, D`.

source: Executing a gesture bound to a script without description in input help mode also create an entry for this script in the gesture management dialog.
ru: Выполнение жеста, привязанного к сценарию без описания в режиме справки по вводу, также создаёт запись для этого скрипта в диалоге управления жестами.

source: This entry is located in a dedicated category called "Scripts without description (modify at your own risk!)".
ru: Эта запись находится в специальной категории "Скрипты без описания (изменяйте на свой страх и риск!)".

source: This allow to easily add, delete or change the native NVDA gestures for these script.
ru: Это позволяет легко добавлять, удалять или изменять собственные жесты NVDA для этих скриптов.

source: Be aware however that it is often intended that such script do not have any description to prevent the user to modify the associated gesture.
ru: Однако имейте в виду, что часто предполагается, что такой скрипт не содержит никакого описания, чтобы пользователь не мог изменить связанный жест.

source: Indeed, the gesture may be defined to match an application shortcut key.
ru: Действительно, жест может быть определён в соответствии с клавишей быстрого доступа приложения.

source: For example the script script_toggleItalic on NVDAObjects.window.winword.WordDocument is bound to control+I and this should not be modified since the gesture is passed to the application to actually execute the shortcut key.
ru: Например, скрипт script_toggleItalic в NVDAObjects.window.winword.WordDocument привязан к control+I, и его не следует изменять, поскольку жест передаётся приложению для фактического выполнения сочетания клавиш.

source: Usage example
ru: Пример использования

source: Control+shift+I also toggle italic in Word, even if it is not natively reported by NVDA.
ru: Control+shift+I также переключает курсив в Word, даже если NVDA не сообщает об этом изначально.

source: To have the control+shift+I result reported by NVDA as control+I, you should perform the following steps:
ru: Чтобы NVDA сообщала о результате control+shift+I как control+I, вам необходимо выполнить следующие шаги:

source: Open a Word document.
ru: Откройте документ Word.

source: Enable the extended script description mode with `NVDA+X, D`.
ru: Включите режим расширенного описания скрипта с помощью `NVDA+X, D`.

source: Enter input help mode with NVDA+1.
ru: Войдите в режим справки по вводу с помощью NVDA+1.

source: Press control+I to report the italic script and have it added in the gesture dialog.
ru: Нажмите Control+I, чтобы сообщить о курсиве и добавить его в диалог жестов ввода.

source: Exit input help mode with NVDA+1.
ru: Выйдите из режима справки по вводу с помощью NVDA+1.

source: Open the input gestures dialog.
ru: Откройте диалог жестов ввода.

source: In the category "Scripts without description (modify at your own risk!)", select the command "toggleItalic on NVDAObjects.window.winword.WordDocument".
ru: В категории "Скрипты без описания (изменяйте на свой страх и риск!)" выберите команду "toggleItalic в NVDAObjects.window.winword.WordDocument".

source: Add the control+shift+I shortcut and validate.
ru: Добавьте сочетание клавиш control+shift+I и подтвердите.

source: If you want, exit the extended script description mode with `NVDA+X, D`.
ru: Если хотите, выйдите из режима расширенного описания скрипта с помощью `NVDA+X, D`.

source: Known bug: A script added for a specific class is visible even if gesture manager is opened in another context.
ru: Известная ошибка: скрипт, добавленный для определённого класса, виден, даже если диалог жестов ввода открыт в другом контексте.

source: Log reading and analyzing features
ru: Функции чтения и анализа журналов

source: Place markers in the log
ru: Размещайте маркеры в журнале

source: While testing or working, you may want to mark a specific moment in the log, so that you can turn to it easily later when reading the log.
ru: Во время тестирования или работы вы можете отметить определенный момент в журнале, чтобы вы могли легко обратиться к нему позже при чтении журнала.

source: To add a marker message in the log, press `NVDA+X, K`.
ru: Чтобы добавить маркерное сообщение в журнал, нажмите `NVDA+X, K`.

source: A message as follows will be logged at INFO level:
ru: На уровне INFO будет записано в журнал следующее сообщение:

source: You can add as many markers as you want in the log.
ru: Вы можете добавить в журнал столько маркеров, сколько захотите.

source: The marker's number will be incremented each time you place a marker in the log; it will only be reset when NVDA is restarted.
ru: Номер маркера будет увеличиваться каждый раз, когда вы помещаете его в журнал; он будет сброшен только при перезапуске NVDA.

source: Log reader mode
ru: Режим чтения журналов

source: A log reader mode provides commands to ease log reading and analyzing.
ru: Режим чтения журнала предоставляет команды для облегчения чтения журнала и анализа.

source: In the log viewer window and in the Pyton console output area, the log reader is enabled by default, thus log reading commands are available immediately.
ru: В окне просмотра журнала и в области вывода консоли Python средство чтения журнала включено по умолчанию, поэтому команды чтения журнала доступны сразу.

source: In another text reading area such as an editor (e.g. Notepad++) or a webpage (e.g. GitHub issue), you need to press `NVDA+X, L` to enable log reader mode and use its commands.
ru: В другой области считывания текста, такой как редактор (например, Notepad ++) или веб -страница (например, проблема Github), вам необходимо нажать `NVDA+X, L`, чтобы включить режим чтения журнала и использовать его команды.

source: When you are done with log reading and analyzing tasks, you can disable again `NVDA+X, L` to disable the log reader mode.
ru: Когда вы закончите с чтением журнала и анализом задач, вы можете снова нажать `NVDA+X, L`, чтобы отключить режим чтения журнала.

source: The commands available in log reader mode are described hereafter.
ru: Команды, доступные в режиме чтения журнала, описаны ниже.

source: In this mode, you can also press `control+H` to display all the commands available.
ru: В этом режиме вы также можете нажать `control+H` для отображения всех доступных команд.

source: Quick navigation commands
ru: Команды быстрой навигации

source: Single letter command similar to browse mode quick navigation keys allow to move to various type of log messages:
ru: Однобуквенная команда, аналогичная клавишам быстрой навигации в режиме обзора, позволяет переходить к различным типам сообщений журнала:

source: m: any message
ru: m: любое сообщение

source: e: error messages (`ERROR` and `CRITICAL`)
ru: e: сообщения об ошибках (`ERROR` и `CRITICAL`)

source: w: warning messages (`WARNING`)
ru: w: предупреждающие сообщения (`WARNING`)

source: f: info messages (`INFO`)
ru: f: информационные сообщения (`INFO`)

source: k: markers previously [placed in the log](#logPlaceMarkers)
ru: k: маркеры, ранее [помещенные в журнал](#logPlaceMarkers)

source: g: debug warning messages (`DEBUGWARNING`)
ru: g: предупреждающие сообщения об отладке (`DEBUGWARNING`)

source: i: input/output messages (`IO`)
ru: i: сообщения ввода/вывода (`IO`)

source: n: input messages
ru: n: сообщения ввода

source: s: speech messages
ru: s: речевые сообщения

source: b: braille messages
ru: b: брайлевские сообщения

source: d: debug messages (`DEBUG`)
ru: d: сообщения отладки (`DEBUG`)

source: Pressing the single letter moves to the next occurrence of this message. Combining the letter with the shift key moves to the previous occurrence of this message.
ru: Нажатие одной буквы приводит к переходу к следующему появлению этого сообщения. Сочетание буквы с клавишей shift приводит к переходу к предыдущему появлению этого сообщения.

source: In addition, inside certain types of messages, you can jump block by block pressing `O` or `shift+O`.
ru: Кроме того, внутри определённых типов сообщений вы можете переходить блок за блоком, нажимая `O` или `shift+O`.

source: The following message types and associated blocks are supported:
ru: Поддерживаются следующие типы сообщений и связанные блоки:

source: In messages containing tracebacks, e.g. error messages, block navigation allows you to jump between tracebacks
ru: В сообщениях, содержащих обратные трассировки, например. сообщения об ошибках, навигация по блокам позволяет переключаться между обратными трассировками

source: This is specifically useful when more than one traceback is present, e.g. when an error is raised in the "except" part of a try/except clause.
ru: Это особенно полезно, когда присутствует более одной обратной трассировки, например. когда возникает ошибка в части "except" предложения try/Exception.

source: In the message listing the stacks for Python threads logged when a freeze occurs, block navigation allows you to jump between thread stacks.
ru: В сообщении со списком стеков потоков Python, регистрируемых при зависании, навигация по блокам позволяет переключаться между стеками потоков.

source: In the message providing developer info for the navigator object logged when you press `NVDA+F1`, block navigation allows you to jump between groups of properties.
ru: В сообщении, предоставляющем информацию о разработчике объекта навигатора, регистрируемом при нажатии `NVDA+F1`, навигация по блокам позволяет вам переключаться между группами свойств.

source: There are four groups of properties: general properties, appModule properties, window properties and interface-specific (IAccessible, UIA) properties.
ru: Существует четыре группы свойств: общие свойства, свойства appModule, свойства окна и свойства, специфичные для интерфейса (IAccessible, UIA).

source: At last, inside a block, you may want to jump quickly to first or last line of interest of the block.
ru: Наконец, внутри блока вы можете быстро перейти к первой или последней интересующей строке блока.

source: Use `shift+L` to jump to the first line of interest of the current block's content, e.g. the first frame of a traceback.
ru: Используйте `shift+L`, чтобы перейти к первой интересующей строке содержимого текущего блока, например, первый кадр обратной трассировки.

source: And `L` to jump to the last line of interest of the block's content, e.g. last frame of a thread stack or error below a traceback.
ru: И `L`, чтобы перейти к последней интересующей строке содержимого блока, например, последний кадр стека потоков или ошибка ниже трассировки.

source: Translation of speech message
ru: Перевод речевого сообщения

source: Sometimes, you may have to look at a log taken on a system in a foreignh language that you do not understand. E.g. the log was taken on a Chinese system / NVDA, whereas you only understand French.
ru: Иногда вам может потребоваться просмотреть журнал, созданный в системе на иностранном языке, который вы не понимаете. Например, журнал был создан в китайской системе / NVDA, в то время как вы понимаете только французский.

source: If you have [Instant Translate][3] add-on installed, you may use it in conjonction with [quick log navigation commands](#logReaderQuickNavigationCommands) to have speech messages translated.
ru: Если у вас установлено дополнение [Instant Translate][3], вы можете использовать его в сочетании с [командами быстрой навигации по журналу](#logReaderQuickNavigationCommands) для перевода речевых сообщений.

source: First configure Instant Translate's languages. The source language should be the language of the system where the log has been taken (e.g. Chinese). The target language should be your language (e.g. French).
ru: Сначала настройте языки Instant Translate. Исходным языком должен быть язык системы, в которой был создан журнал (например, китайский). Целевым языком должен быть ваш язык (например, французский).

source: Open the log
ru: Откройте журнал

source: Press `control+T` to enable automatic speech translation in the log
ru: Нажмите `control+T`, чтобы включить автоматический перевод речи в журнале

source: Use Quick navigation commands in the log, e.g. S, I, etc. Whenever a speech message is encountered, it will be spoken in your language (French in our previous example)
ru: Используйте команды быстрой навигации в журнале, например, S, I и т.д. При появлении речевого сообщения оно будет передано на вашем языке (в нашем предыдущем примере - на французском)

source: If you want to disable speech translation, press `control+T` again.
ru: Если вы хотите отключить перевод речи, снова нажмите `control+T`.

source: Open the file of the source code in your editor
ru: Открыть файл с исходным кодом в вашем редакторе

source: In the log some line may refer to the source code:
ru: В журнале какая-то строка может ссылаться на исходный код:

source: A line belonging to a traceback contains the path and the line in a file, e.g.:
ru: Строка, принадлежащая трассировке, содержит путь и строку в файле, например:

source: The header line of a logged message contains the function which has logged this message, e.g.:
ru: Строка заголовка зажурналированного сообщения содержит функцию, которая зажурналировала это сообщение, например:
