Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/nvdaDevTestToolbox/*/nvdaDevTestToolbox.xliff
Languages: ru

source: The content of a message logged in input help mode (logged at info level):
ru: Содержимое сообщения, записанного в журнал в режиме справки по вводу (записанного на информационном уровне):

source: You may want to open the file containing this code to understand the context of the traceback or the logged message.
ru: Возможно, вы захотите открыть файл, содержащий этот код, чтобы понять контекст обратной трассировки или зарегистрированного сообщения.

source: Just press C to open this file.
ru: Просто нажмите C, чтобы открыть этот файл.

source: For this feature to work, you need to have configured your [favorite editor's command](#settingsOpenCommand) in the add-on's settings.
ru: Чтобы эта функция работала, вам нужно настроить [команду любимого редактора](#settingsOpenCommand) в настройках дополнения.

source: If you are not running NVDA from source, the [location of NVDA source code](#settingsNvdaSourcePath) should also have been configured.
ru: Если вы не запускаете NVDA из исходного кода и хотите открывать код NVDA, также нужно настроить [местоположение исходного кода NVDA](#settingsNvdaSourcePath).

source: Analysing a traceback
ru: Анализ обратной трассировки

source: Sometimes you may have error tracebacks in the log, as in the following example:
ru: Иногда в журнале могут присутствовать обратные трассировки ошибок, как в следующем примере:

source: For frames where the source code is available, you may have noticed markers with `^` (caret) and `~` (tilde) characters.
ru: Для кадров, где доступен исходный код, вы могли заметить маркеры с символами `^` (крышка) и `~` (тильда).

source: That's the way Python visually indicates the error's location as well as its context in a traceback frame.
ru: Именно так Python визуально указывает местоположение ошибки, а также её контекст в кадре трассировки.

source: Pressing `control+E` moves the cursor at the beginning of the error in the source code line, i.e. the text marked by `^` (caret) character.
ru: Нажатие `control+E` перемещает курсор в начало ошибки в строке исходного кода, то есть в текст, отмеченный символом `^` (крышка).

source: A double press, select this text.
ru: Двойное нажатие выделит этот текст.

source: A triple press selects the error with its context, i.e. the text of the source code line marked by `^` (caret) and `~` (tilde) characters.
ru: Тройное нажатие выделяет ошибку вместе с её контекстом, то есть текстом строки исходного кода, отмеченной символами `^` (крышка) и `~` (тильда).

source: Please note that for logs taken with an NVDA version before 2024.1, thus with Python 3.7 or older, Python only indicates the error with one `^` (caret) character.
ru: Обратите внимание, что для журналов, записанных с помощью версии NVDA до 2024.1, то есть с Python 3.7 или старше, Python указывает на ошибку только одним символом `^` (крышка).

source: Thus the double or triple press action of this command becomes rather useless.
ru: Таким образом, двойное или тройное нажатие этой команды становится практически бесполезным.

source: Getting a summary of the available commands
ru: Получение сводки доступных команд

source: To display a list of all the available commands in log reading mode, press `NVDA+X, H`.
ru: Чтобы отобразить список всех доступных команд в режиме чтения журнала, нажмите `NVDA+X, H`.

source: Anonymize a log
ru: Анонимизировать журнал

source: When reporting issues, you may have to provide a log.
ru: При сообщении о проблемах вам может потребоваться предоставить журнал.

source: However, logs may contain sensitive information (user names, e-mails, etc.).
ru: Однако журналы могут содержать конфиденциальную информацию (имена пользователей, адреса электронной почты и т. д.).

source: This add-on provides a command to anonymize a log's content.
ru: Это дополнение предоставляет команду для анонимизации содержимого журнала.

source: Select a part of the log or its whole content and press `NVDA+X, A`.
ru: Выделите часть журнала или всё его содержимое и нажмите `NVDA+X, A`.

source: The anonymized log content will be put in the clipboard.
ru: Анонимизированное содержимое журнала будет помещено в буфер обмена.

source: You can paste it on the current selection to replace it or anywhere else you wish.
ru: Вы можете вставить его в текущее выделение, чтобы заменить его, или в любое другое место по вашему желанию.

source: For this feature to work, you need to customize the anonymization rules used by this command.
ru: Чтобы эта функция работала, вам необходимо настроить правила анонимизации, используемые этой командой.

source: The file to configure these rules is located at: `pathToNVDAConfig\ndtt\anonymizationRules.dic` (e.g. `C:\Users\myUserName\AppData\Roaming\nvda\ndtt\consoleStartup.py`).
ru: Файл для настройки этих правил находится по адресу: `pathToNVDAConfig\ndtt\anonymizationRules.dic` (например, `C:\Users\myUserName\AppData\Roaming\nvda\ndtt\consoleStartup.py`).

source: You will find all the instructions to write this file in its header.
ru: Все инструкции по написанию этого файла вы найдете в его шапке.

source: In case you have corrupted your anonymization rules file or if you have deleted the header's instructions, just delete or rename this file and a new version of this file will be generated at next startup.
ru: Если вы повредили файл правил анонимизации или удалили инструкции в заголовке, просто удалите или переименуйте этот файл, и новая версия этого файла будет создана при следующем запуске.

source: Backup of old logs
ru: Резервное копирование старых журналов

source: NVDA already provides a backup of the log of the previous session of NVDA; the file is called `nvda-old.log`.
ru: NVDA уже предоставляет резервную копию журнала предыдущей сессии NVDA; файл называется `nvda-old.log`.

source: Sometimes however you may want to access older logs, e.g. because you have had to restart NVDA again before looking at `nvda-old.log`.
ru: Однако иногда вам может потребоваться получить доступ к более старым журналам, например, из-за того, что вам пришлось снова перезапустить NVDA, прежде чем просматривать "nvda-old.log`.

source: This add-on allows you to configure if you want to backup old logs and how many of them; this is done in the [add-on's settings](#settingsLogsBackup).
ru: Это дополнение позволяет вам настроить, хотите ли вы создавать резервные копии старых журналов и сколько их; это делается в [настройках дополнения](#settingsLogsBackup).

source: A log manager dialog allows to view the backed up logs.
ru: Диалог диспетчера журнала позволяет просматривать резервные журналы.

source: It can be opened going to NVDA menu -> Tools -> Logs manager
ru: Его можно открыть, переходя в меню NVDA -> Сервис -> Диспетчер журналов

source: In this dialog, you can see the list of all the backup logs and perform various actions on the selected log:
ru: В этом диалоге вы можете увидеть список всех резервных копий журналов и выполнить различные действия в выбранном журнале:

source: open it (press `Enter`)
ru: для его открытия (нажмите `Enter`)

source: delete it (press `Delete`)
ru: для его удаления (нажмите `Delete`)

source: copy the log file (press `control+C`)
ru: копировать файл журнала (нажмите `control+C`)

source: You can also select multiple logs to perform an actions on all of them.
ru: Вы также можете выбрать несколько журналов для выполнения действий с ними.

source: To be able to open a log, you should first have configured the [Command to open a file in your favorite editor](#settingsOpenCommand).
ru: Чтобы иметь возможность открыть журнал, вы должны сначала настроить [команду для открытия файла в вашем любимом редакторе](#settingsOpenCommand).

source: Python console extension
ru: Расширение консоли Python

source: `openCodeFile` function
ru: функция `openCodeFile`

source: In the console, you can call the following function to view the source code that defines the variable `myVar`:
ru: В консоли вы можете вызвать следующую функцию, чтобы просмотреть исходный код, определяющий переменную `myVar`:

source: For this feature to work, you need to have configured your [favorite editor's command](#settingsOpenCommand) in the add-on's settings.
ru: Чтобы эта функция работала, вам нужно настроить [команду любимого редактора](#settingsOpenCommand) в настройках дополнения.

source: If you are not running NVDA from source, the [location of NVDA source code](#settingsNvdaSourcePath) should also have been configured.
ru: Если вы не запускаете NVDA из исходного кода и хотите открывать код NVDA, также нужно настроить [местоположение исходного кода NVDA](#settingsNvdaSourcePath).

source: The `openCodeFile` functions can be called on objects defined in NVDA's code or on objects defined by add-ons.
ru: Функции `openCodeFile` могут быть вызваны для объектов, определённых в коде NVDA, или для объектов, определённых дополнениями.

source: It cannot be called on objects whose source code is not available such as python builtins.
ru: Они не могут быть вызваны для объектов, исходный код которых недоступен, таких как встроенные модули python.

source: If you have not yet imported the object in the console, you can also pass its name as parameter to the `openCodeFile` function.
ru: Если вы ещё не импортировали объект в консоль, вы также можете передать его имя в качестве параметра функции `openCodeFile`.

source: Below are examples of call in NVDA's code:
ru: Ниже приведены примеры вызовов в коде NVDA:

source: View the definition of the function `speech.speech.speak`:
ru: Просмотреть определение функции `speech.speech.speak`:

source: or with the name passed as parameter:
ru: или с именем, переданным в качестве параметра:

source: View the definition of the class `TextInfo`:
ru: Просмотреть определение класса `TextInfo`:

source: View the definition of the method `copyToClipboard` of the class `TextInfo`:
ru: Просмотреть определение метода `copyToClipboard` класса `TextInfo`:

source: View the definition of the class of the focused object:
ru: Просмотреть определение класса объекта в фокусе:

source: Open the file `api.py` defining the module `api`:
ru: Открыть файл `api.py`, определяющий модуль `api`:

source: Python console startup script
ru: Скрипт при запуске консоли Python

source: You can define a custom script which will be executed in the Python console's namespace when it is first opened.
ru: Вы можете определить собственный скрипт, который будет выполняться в пространстве имён консоли Python при её первом открытии.

source: For example, the script allows you to execute new imports and define aliases that you will be able to use directly in the console, as shown below:
ru: Например, скрипт позволяет вам выполнять новый импорт и определять псевдонимы, которые вы сможете использовать непосредственно в консоли, как показано ниже:

source: The Python console script should be placed in the following location: `pathToNVDAConfig\ndtt\consoleStartup.py`
ru: Консольный скрипт Python следует разместить в следующем месте: `pathToNVDAConfig\ndtt\consoleStartup.py`

source: For example: `C:\Users\myUserName\AppData\Roaming\nvda\ndtt\consoleStartup.py`
ru: Например: `C:\Users\myUserName\AppData\Roaming\nvda\ndtt\consoleStartup.py`

source: Note: In Python 2, i.e. with NVDA 2019.2.1 or earlier, only pure ASCII scripts are supported; any other encoding such as Unicode is not supported.
ru: Примечание. В Python 2, т. е. с NVDA 2019.2.1 или более ранней версии, поддерживаются только чистые сценарии ASCII; любая другая кодировка, например Unicode, не поддерживается.

source: Preserving Python console input history
ru: Сохранение истории ввода в консоль Python

source: In Python console history, you can use up and down arrows to review and modify previous inputs.
ru: В истории консоли Python вы можете использовать стрелки вверх и вниз для просмотра и изменения предыдущих данных ввода.

source: Though, the list of previous inputs is cleared when exiting NVDA.
ru: Однако список предыдущих вводов очищается при выходе из NVDA.

source: This add-on provide [an option](#settingsPreserveHistory), enabled by default, allowing to preserve Python console input history even when NVDA is restarted.
ru: Это дополнение предоставляет [опцию](#settingsPreserveHistory), включена по умолчанию, что позволяет сохранять историю ввода в консоли Python даже при перезапуске NVDA.

source: Log the stack trace of the speech function
ru: Журналировать трассировку стека речевой функции

source: Sometimes, you may want to see which part of the code is responsible for speaking something.
ru: Иногда вы можете посмотреть, какая часть кода отвечает за то, что говорить.

source: For this, you can enable the stack trace logging of the speech function pressing `NVDA+X, S`.
ru: Для этого вы можете включить регистрацию трассировки стека речевой функции, нажимая `NVDA+X, S`.

source: Each time NVDA speaks, a corresponding stack trace will be logged in the log.
ru: Каждый раз, когда говорит NVDA, соответствующая трассировка стека будет регистрироваться в журнале.

source: Note: You may modify the script's file directly to patch another function.
ru: Примечание: Вы можете изменить файл скрипта напрямую, чтобы исправить другую функцию.

source: See all instructions in the file for details on usage.
ru: Подробную информацию об использовании смотрите во всех инструкциях файла.

source: Reverse translation command
ru: Команда обратного перевода

source: Many testers use NVDA in another language than English.
ru: Многие тестеры используют NVDA на другом языке, а не на английском.

source: But when reporting test results on GitHub, the description of the modified options or the messages reported by NVDA should be written in English.
ru: Но при объявлениях результатов теста на GitHub описание изменённых параметров или сообщений, представленных NVDA, должны быть написаны на английском.

source: It's quite frustrating and time consuming to have to restart NVDA in English to check the exact wording of the options or messages.
ru: Перезапускать NVDA на английском языке, чтобы проверить точную формулировку опций или сообщений, довольно неприятно и отнимает много времени.

source: To avoid this, the add-on provides two reverse translation commands allowing to reverse translate NVDA's interface such as messages, control labels in the GUI, etc.
ru: Чтобы избежать этого, дополнение предоставляет две команды обратного перевода, позволяющие выполнить обратный перевод интерфейса NVDA, такого как сообщения, метки управления в графическом интерфейсе и т. д.

source: `NVDA+X, R` uses NVDA's gettext translation to try to reverse translate the last speech.
ru: `NVDA+X, R` использует перевод gettext NVDA, чтобы попытаться выполнить обратный перевод последней речи.

source: `NVDA+shift+X, R` uses gettext translations from NVDA and its add-ons to try to reverse translate the last speech.
ru: `NVDA+shift+X, R` использует переводы gettext из NVDA и её дополнений, чтобы попытаться выполнить обратный перевод последней речи.

source: More specifically, the first string of the last speech sequence is reverse translated.
ru: Более конкретно, первая строка последней речевой последовательности переводится.

source: For example, in French NVDA, if I arrow down to the Tools menu named "Outils", NVDA will say "Outils sous-Menu o" which stands for "Tools subMenu o".
ru: Например, во французской NVDA, если я стрелкой вниз перейду к меню сервиса под названием "Outils", NVDA скажет "Outils sous-Menu o", что означает "Tools subMenu o".

source: If I press the reverse translation command just after that, NVDA will reverse translate "Outils" to "Tools".
ru: Если я сразу после этого нажму команду обратного перевода, NVDA будет отменять перевод "Outils" в "Tools".

source: Looking at the log afterwards, we can find the following lines:
ru: Глядя на журнал после этого, мы можем найти следующие строки:

source: This confirms that "Outils was the first string in the speech sequence.
ru: Это подтверждает, что "Outils" была первой строкой в ​​последовательности речи.

source: In case the reverse translation leads to two or more possible results, a context menu is opened listing all the possibilities.
ru: В случае, если обратный перевод приводит к двум или более возможным результатам, открывается контекстное меню с перечислением всех возможностей.

source: The result of the reverse translation is also copied to the clipboard if the corresponding [option](#settingsCopyReverseTranslation) is enabled, which is the default value.
ru: Результат обратного перевода также копируется в буфер обмена, если включена соответствующая [опция](#settingsCopyReverseTranslation), что является значением по умолчанию.

source: Reverse translation of NVDA strings is only available for NVDA version 2022.1 or above.
ru: Обратный перевод строк NVDA доступен только для NVDA версии 2022.1 или выше.

source: For earlier versions of NVDA, only the add-ons strings are available for reverse translation.
ru: В более ранних версиях NVDA для обратного перевода доступны только строки дополнений.

source: Besides, in NVDA version 2019.2.1 or earlier, in case no reverse translation is found, a second attempt is made in the first part of the string.
ru: Кроме того, в NVDA версии 2019.2.1 и более ранних, если обратный перевод не найден, вторая попытка осуществляется в первой части строки.

source: Indeed, in these NVDA version, the speech sequence looks like this:
ru: Действительно, в этих версиях NVDA речевая последовательность выглядит так:

source: We can see that an object label may be concatenated with role, state, shortcut, etc.
ru: Мы видим, что метка объекта может быть объединена с ролью, состоянием, ярлыком и т. д.

source: So if the reverse translation gives no result with the whole string, a second attempt is made on the part of the string before the double space (" ").
ru: Таким образом, если обратный перевод не дает результата для всей строки, делается вторая попытка для части строки перед двойным пробелом (" ").

source: Though, this is not bullet-proof since we cannot exclude that a string actually natively contains a double space.
ru: Однако это не является абсолютным доказательством, поскольку мы не можем исключить, что строка изначально содержит двойной пробел.

source: Settings
ru: Настройки

source: Some features of the add-on may require a specific configuration.
ru: Некоторые функции дополнения могут потребовать определённой настройки.

source: A settings panel allows to enable them or to control how they work.
ru: Панель настроек позволяет включать их или контролировать их работу.

source: To view and modify these settings, go to NVDA menu -> Preferences and select the category NVDA Dev & Test Toolbox.
ru: Чтобы просмотреть и изменить эти настройки, перейдите в меню NVDA -> Настройки и выберите категорию NVDA Dev & Test Toolbox.

source: This settings dialog can also be accessed directly from the Logs Manager dialog.
ru: Доступ к этому диалогу настроек также можно получить непосредственно из диалога диспетчера журналов.

source: These settings are global and can only be configured when the default profile is active.
ru: Эти параметры являются глобальными и могут быть настроены только в том случае, если активен профиль по умолчанию.

source: Command to open a file in your favorite editor
ru: Команда для открытия файла в вашем любимом редакторе

source: Some features allow to see content in your favorite editor.
ru: Некоторые функции позволяют просматривать содержимое в вашем любимом редакторе.

source: This includes the commands to view the source file [from a log](#logReaderOpenSourceFile), [from an object in the console](#pythonConsoleOpenCodeFile) or [from a typed gesture](#scriptOpener), as well as the [log manager](#oldLogsBackup)'s Open button.
ru: Сюда входят команды для просмотра исходного файла [из журнала](#logReaderOpenSourceFile), [из объекта в консоли](#pythonConsoleOpenCodeFile) или [для введённого жеста](#scriptOpener), а также кнопка открытия [менеджера журналов](#oldLogsBackup).

source: To use them, you first need to configure the command that will be called to open the file in your favorite editor.
ru: Чтобы их использовать, сначала необходимо настроить команду, которая будет вызываться для открытия файла в вашем любимом редакторе.

source: The command should be of the form:
ru: Команда должна иметь вид:

source: You should of course modify this line according to the real name and location of your editor and the syntax used by it to open files.
ru: Разумеется, вам следует изменить эту строку в соответствии с настоящим именем и местоположением вашего редактора, а также синтаксисом, используемым им для открытия файлов.

source: `{path}` will be replaced by the full path of the file to open and `{line}` by the line number where you want the cursor to be set.
ru: `{path}` будет заменён полным путём к файлу, который нужно открыть и `{line}` номером строки, на которую вы хотите установить курсор.

source: For Notepad++ for example the command to type in the console would be:
ru: Например, для Notepad++ команда для ввода в консоли будет такой:

source: NVDA source code path
ru: Путь к исходному коду NVDA

source: When using a command to view the source file [from a log](#logReaderOpenSourceFile), [from an object in the console](#pythonConsoleOpenCodeFile) or [from a typed gesture](#scriptOpener), the file may belong to NVDA itself.
ru: При использовании команды для [просмотра исходного файла из журнала](#logReaderOpenSourceFile), [из объекта в консоли](#pythonConsoleOpenCodeFile) или [для введённого жеста](#scriptOpener)файл может принадлежать самой NVDA.

source: If you are not running NVDA from source, your NVDA only contains compiled files.
ru: Если вы не используете NVDA из исходного кода, ваша NVDA содержит только скомпилированные файлы.

source: Thus you may specify here an alternate location where the corresponding source file will be found, e.g. the place where you have cloned NVDA source files, so that a source file can be opened anyway.
ru: Таким образом, вы можете указать здесь альтернативное местоположение, где будет найден соответствующий исходный файл, например, место, где вы клонировали исходные файлы NVDA, чтобы исходный файл всё равно можно было открыть.

source: The path should be such as:
ru: Путь должен быть таким:

source: Of course, replace the path of NVDA source with the correct one.
ru: Конечно, замените путь к исходному коду NVDA на правильный.

source: Be sure however that the version of your source file (e.g. GIT commit) is the same as the one of the running instance of NVDA.
ru: Однако убедитесь, что версия вашего исходного файла (например, коммита GIT) совпадает с версией работающего экземпляра NVDA.

source: Backup of old logs
ru: Резервное копирование старых журналов

source: The combobox Backup of old logs allows to enable or disable the [feature](#oldLogsBackup).
ru: Комбинированный список резервного копирования старых журналов позволяет включить или отключить [функцию](#oldLogsBackup).

source: If it is enabled, you can also specify below in "Limit the number of backups" the maximum number of backups you want to keep.
ru: Если эта функция включена, вы также можете указать ниже в разделе ограничения количество резервных копий максимальное количество резервных копий, которые вы хотите сохранить.

source: These settings only take effect at next NVDA startup when the backup takes place.
ru: Эти настройки вступят в силу только при следующем запуске NVDA, когда будет выполнено резервное копирование.

source: Copy reverse translation to clipboard
ru: Копировать обратный перевод в буфер обмена
