Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/nvdaDevTestToolbox/*/nvdaDevTestToolbox.xliff
Languages: ru

source: This option allows to choose if the [reverse translation command](#reverseTranslationCommand) also copies its result to the clipboard.
ru: Эта опция позволяет выбирать, будет ли [команда обратного перевода](#reverseTranslationCommand) копировать свой результат в буфер обмена.

source: Preserve console input history after restart
ru: Сохранять историю ввода в консоль после перезапуска

source: If this checkbox is checked, Python console input history will be preserved when NVDA is restarted.
ru: Если этот флажок отмечен, история ввода в консоль Python будет сохранена при перезапуске NVDA.

source: If it is checked, you can also specify below the maximum number of inputs that will be saved.
ru: Если этот флажок установлен, вы также можете указать ниже максимальное количество введённых данных, которые будут сохранены.

source: If it is unchecked, NVDA will behave as usual, i.e. the console history will be empty after restart.
ru: Если флажок снят, NVDA будет вести себя как обычно, т.е. история консоли после перезапуска будет пустой.

source: Change log
ru: Журнал изменений

source: Version 8.0
ru: Версия 8.0

source: Python console history can now be preserved accross restarts.
ru: История консоли Python теперь может сохраняться при перезапуске.

source: Reverse translation: Added a second command to reverse translate a string using both NVDA and its add-ons translations.
ru: Обратный перевод: добавлена ​​вторая команда для обратного перевода строки с использованием перевода NVDA и её дополнений.

source: New log reader commans to jump to previous or next braille output message
ru: Новые команды чтения журнала для перехода к предыдущему или следующему сообщению брайлевского вывода

source: New log reader commans to jump to previous or next block in a message, e.g. previous or next thread stack in a watchdog freeze report, previous or next block of properties in the developer info for navigator object, etc.
ru: Новые команды чтения журнала для перехода к предыдущему или следующему блоку сообщения, например. предыдущий или следующий стек потоков в отчете о заморозке сторожевого таймера, предыдущий или следующий блок свойств в информации о разработчике для объекта навигатора и т. д.

source: New log reader commands to jump to the first or last interesting line of a block, e.g. first or last frame of a traceback
ru: Новые команды чтения журнала для перехода к первой или последней интересующей строке блока, например. первый или последний кадр обратной трассировки

source: A new log reader "Go to error" command to jump to the error in a traceback frame.
ru: Новая команда чтения журнала "Перейти к ошибке" для перехода к ошибке в кадре трассировки.

source: A new log reader command to display an help message listing all the available commands while reading a log.
ru: Новая команда чтения журнала для отображения справочного сообщения со списком всех доступных команд во время чтения журнала.

source: The log reading mode is now enabled by default in the Python console output pane.
ru: Режим чтения журнала теперь включен по умолчанию на панели вывода консоли Python.

source: A new command to anonymize a log
ru: Новая команда для анонимизации журнала

source: The console startup script now supports unicode strings (for Python 3 only); full unicode file may not be supported though.
ru: Скрипт запуска консоли теперь поддерживает строки Юникода (только для Python 3); Однако полный файл Unicode может не поддерживаться.

source: The Python console startup script will now only be executed once and only once when the console opens.
ru: Скрипт запуска консоли Python теперь будет выполняться только один раз и только при первом открытии консоли.

source: A bug where this script could be executed many times when reloading the add-ons has been fixed.
ru: Исправлена ошибка, из-за которой этот скрипт мог выполняться много раз при перезагрузке дополнений.

source: Improved error handling in the console startup script.
ru: Улучшена обработка ошибок в скрипте запуска консоли.

source: Bugfix: An empty log files created when log is disabled do not fail anymore to be saved as old log.
ru: Исправлена ошибка: пустые файлы журналов, созданные при отключении журнала, больше не будут сохраняться как старый журнал.

source: Speech on demand is now supported in layered commands
ru: Речь по требованию теперь поддерживается в многоуровневых командах

source: Improved error handling of the script opener command (in case of wrong or missing configuration, or when a braille display is in use).
ru: Улучшена обработка ошибок команды открытия скрипта (в случае неправильной или отсутствующей конфигурации или при использовании брайлевского дисплея).

source: Version 7.3
ru: Версия 7.3

source: Bugfix: The command to activate layered commands of the add-on can now be assigned another gesture.
ru: Исправлена ошибка: Команде активации многоуровневых команд дополнения теперь можно назначить другой жест.

source: Version 7.1
ru: Версия 7.1

source: Compatibility with NVDA 2025.1.
ru: Совместимость с NVDA 2025.1.

source: Version 7.0
ru: Версия 7.0

source: Layered commands have been introduced; the entry point is `NVDA+X`.
ru: Были введены многоуровневые команды; точка входа - `NVDA+X`.

source: The existing commands have been modified accordingly.
ru: Существующие команды были соответствующим образом изменены.

source: A new command (`NVDA+X, R`) to reverse translate the last spoken message.
ru: Новая команда (`NVDA+X, R`) обратного перевода последнего произнесённого сообщения.

source: A new command (`NVDA+X, C`) to open the source code of the script associated to the next pressed gesture.
ru: Новая команда (`NVDA+X, C`) для открытия исходного скрипта, связанного со следующим нажатым жестом.

source: Added speech on demand support.
ru: Добавлена поддержка речи по требованию.

source: The log manager now allows more actions, either with the dedicated buttons in the dialogs or using keyboard shortcuts in the list: `enter` to open the log, `control+C` to copy the log file and `delete` to delete a log file.
ru: Диспетчер журналов теперь содержит больше действий, либо выбором кнопок в диалогах, либо с использованием сочетания клавиш в списке: `enter` для открытия журнала, `control+C` для копирования файла журнала и `delete` для удаления файла журнала.

source: The sorting order in the log manager has been reversed (most recent log on top).
ru: Порядок сортировки в диспетчере журнала был изменён (самый последний журнал вверху).

source: Fixed an issue when trying to open a Python module with openCodeFile function.
ru: Исправлена ​​проблема при попытке открыть модуль Python с функцией openCodeFile.

source: Version 6.3
ru: Версия 6.3

source: Compatibility with NVDA 2024.1.
ru: Совместимость с NVDA 2024.1.

source: Version 6.2
ru: Версия 6.2

source: Restores console opening for NVDA < 2021.1.
ru: Восстанавливает открытие консоли для NVDA < 2021.1.

source: Addresses potential security issues related to [GHSA-xg6w-23rw-39r8][5] when using the add-on with older versions of NVDA. However, it is recommended to use NVDA 2023.3.3 or higher.
ru: Устраняет потенциальные проблемы безопасности, связанные с [GHSA-xg6w-23rw-39r8][5] при использовании дополнения со старыми версиями NVDA. Однако рекомендуется использовать NVDA 2023.3.3 или выше.

source: Version 6.1
ru: Версия 6.1

source: Opening the source file of an object located in the submodule of a package is now working.
ru: Открытие исходного файла объекта, расположенного в подмодуле пакета, теперь работает.

source: Bugfix: The enhanced exit dialog can now be reopened and used as expected after having been closed. (contribution from Łukasz Golonka)
ru: Исправлена ошибка: расширенный диалог выхода теперь можно снова открыть и использовать как положено после его закрытия. (автор Łukasz Golonka)

source: Version 6.0
ru: Версия 6.0

source: While using object navigation commands, a specific object property can be reported instead of NVDA usual object reporting.
ru: При использовании команд навигации по объектам можно сообщать о конкретном свойстве объекта вместо обычных отчетов об объектах NVDA.

source: In log reading mode, the "C" key to open a code file from the log now also works on an input help message.
ru: В режиме чтения журнала нажатие клавиши "C" для открытия файла кода из журнала теперь также работает с справочным сообщением ввода.

source: Bugfix: The add-on can now start successfully when the number of logs to save is set to its maximum value.
ru: Исправлена ошибка: теперь дополнение может успешно запускаться, если количество сохраняемых журналов установлено на максимальное значение.

source: Bugfix: Python console startup script's output does not prevent anymore to jump to the first result in the console when using result navigation commands.
ru: Исправлена ошибка: вывод скрипта запуска консоли Python больше не мешает переходить к первому результату в консоли при использовании команд навигации по результатам.

source: Note: From now on, localization updates will not appear anymore in the change log.
ru: Примечание: Отныне обновления локализации больше не будут отображаться в журнале изменений.

source: Version 5.0
ru: Версия 5.0

source: If Instant Translate add-on is installed, it is now possible to have speech messages translated on the fly when using log reading commands.
ru: Если установлено дополнение Instant Translate, теперь можно переводить речевые сообщения "на лету" при использовании команд чтения журнала.

source: While in log reading mode, pressing E or shift+E now jumps to CRITICAL erorr messages as well as normal ERROR messages.
ru: В режиме чтения журнала нажатие E или shift+E теперь приводит к появлению критических сообщений об ошибках, а также обычных сообщений об ошибках.

source: New log quick navigation commands have been added to jump to input and to speech messages.
ru: Добавлены новые команды быстрой навигации по журналу для перехода к вводимым данным и речевым сообщениям.

source: A new command allow to place a marker in the log; and specific quick navigation commands in log reading mode allow to jump to them.
ru: Новая команда позволяет ставить метки в журнал; а специальные команды быстрой навигации в режиме чтения журнала позволяют переходить к ним.

source: Credit: the initial idea for this feature comes from Debug Helper add-on by Luke Davis.
ru: Благодарность: Первоначальная идея этой функции взята из дополнения Debug Helper, созданного Luke Davis.

source: Bubfix: The memorization of the last error do not fail anymore in some cases.
ru: Исправлена ошибка: Запоминание последней ошибки в некоторых случаях больше не терпит неудачу.

source: Bugfix: The add-on can initialize again with NVDA 2019.2.1.
ru: Исправлена ошибка: Дополнение может снова инициализироваться с NVDA 2019.2.1.

source: Bugfix: Log saving feature will not fail anymore with non-ASCII logs.
ru: Исправлена ошибка: Функция сохранения журнала больше не потерпит неудачу с журналами не-ASCII.

source: Version 4.2
ru: Версия 4.2

source: Fixed an error with NVDA version below 2021.3.
ru: Исправлена ошибка с версией NVDA ниже 2021.3.

source: Fixed the stack trace log formatting.
ru: Исправлено форматирование журнала трассировки стека.

source: First localizations.
ru: Первые локализации.

source: Version 4.1
ru: Версия 4.1

source: Fixed a bug occurring in some situations while logging an error.
ru: Исправлена ошибка, возникавшая в некоторых ситуациях при регистрации ошибки.

source: The add-on's settings can now be modified only when the default profile is active to avoid config issues.
ru: Настройки дополнения теперь можно изменять только при активном профиле по умолчанию, чтобы избежать проблем с настройкой.

source: Version 4.0
ru: Версия 4.0

source: Possibility to back up old logs and introduction of a logs manager.
ru: Возможность создания резервных копий старых журналов и внедрение менеджера журналов.

source: Added a script to report the last logged error.
ru: Добавлен скрипт для сообщения о последней зарегистрированной ошибке.

source: Fixed a bug preventing last log message to be read in older NVDA versions.
ru: Исправлена ошибка, из-за которой в старых версиях NVDA не считывалось последнее сообщение журнала.

source: Version 3.2
ru: Версия 3.2

source: Compatibility with NVDA 2023.1.
ru: Совместимость с NVDA 2023.1.

source: Version 3.1
ru: Версия 3.1

source: Fixed an error occurring when requesting unavailable information on an object.
ru: Исправлена ошибка, возникавшая при запросе недоступной информации об объекте.

source: Version 3.0
ru: Версия 3.0

source: In a log, you can now press C on a message's header line to open the function/module which has emitted it.
ru: В журнале теперь вы можете нажать C в строке заголовка сообщения, чтобы открыть функцию/ модуль, который его отправил.

source: In the console, `openCodeFile` function can now receive as parameter the object or a string containing its name.
ru: В консоли функция `openCodeFile` теперь может принимать в качестве параметра объект или строку, содержащую его имя.

source: New feature: NVDA console startup file: If it exists, the file YourNVDAConfigFolder\ndtt\consoleStartup.py will be executed when NVDA console is first opened or when add-ons are reloaded.
ru: Новая функция: файл запуска консоли NVDA: если он существует, то файл YourNVDAConfigFolder\\ndtt\consoleStartup.py будет запущен при первом открытии консоли NVDA или при перезагрузке дополнений.

source: Various minor fixes for `openCodeFile` Python console's function and the command to open the source file corresponding to a line in the log.
ru: Различные мелкие исправления для работы консоли Python `openCodeFile` и команды для открытия исходного файла, соответствующего строке в журнале.

source: Fixed an issue when trying to report roles/states for object explorer in older version of NVDA.
ru: Исправлена ошибка при попытке создания отчета о ролях/состояниях для обозревателя объектов в более старой версии NVDA.

source: The add-on does not cause a problem anymore with the tree interceptor when using UIA in Edge.
ru: Дополнение больше не вызывает проблем с перехватчиком дерева при использовании UIA в Edge.

source: Version 2.1
ru: Версия 2.1

source: Various bugfixes and code refactoring/cleaning to address all use cases: all supported versions, installed vs. run from source, etc. (contribution from Łukasz Golonka)
ru: Различные исправления ошибок и рефакторинг / очистка кода для решения всех вариантов использования: все поддерживаемые версии, установленные по сравнению с предыдущими. запуск из исходного кода и т.д. (вклад Łukasz Golonka)

source: Rewriting of the compa module (contribution from Łukasz Golonka)
ru: Переписан модуль compa (автор Łukasz Golonka)

source: The restart dialog can now be opened only once.
ru: Диалог перезапуска теперь можно открыть только один раз.

source: The object explorer shortcuts are now unassigned by default and need to be mapped by the user.
ru: Горячие клавиши обозревателя объектов теперь по умолчанию не назначены и должны быть сопоставлены пользователем.

source: With the object explorer, a double-press to call the script to report the current object's property now displays the reported information in a browseable message.
ru: С помощью обозревателя объектов двойное нажатие для вызова сценария, сообщающего о свойстве текущего объекта, теперь отображает полученную информацию в виде сообщения, доступного для просмотра.

source: Version 2.0
ru: Версия 2.0

source: New feature: Enhanced restart dialog to specify some extra options when restarting NVDA.
ru: Новая функция: Расширенный диалог перезапуска для указания некоторых дополнительных параметров при перезапуске NVDA.

source: New feature: extended description mode.
ru: Новая функция: расширенный режим описания.

source: Play error sound feature harmonized between pre and post 2021.3 versions of NVDA.
ru: Функция воспроизведения звука при ошибке была согласована в версиях NVDA до и после 2021.3.

source: New feature: Log reader commands are now available in the log viewer and also optionally in edit fields or webpages.
ru: Новая функция: Команды чтения журналов теперь доступны в программе просмотра журналов, а также, при необходимости, в полях редактирования или на веб-страницах.

source: New feature: In the Python console, an `openCodeFile` function is available to view the source code of an object.
ru: Новая функция: В консоли Python доступна функция "openCodeFile" для просмотра исходного кода объекта.

source: Some features are now disabled in secure mode for security reasons.
ru: Некоторые функции теперь отключены в защищённом режиме по соображениям безопасности.

source: The add-on's compatibility range has been extended (from 2019.2 to 2021.1).
ru: Диапазон совместимости дополнения был расширен (с 2019.2 по 2021.1).

source: Releases are now performed with GitHub action instead of appVeyor.
ru: Выпуски теперь выполняются с помощью GitHub action, а не AppVeyor.

source: Version 1.0
ru: Версия 1.0

source: Initial release.
ru: Первоначальный выпуск.
