Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/goldenCursor/*/goldenCursor.xliff
Languages: ru, tr

source: golden cursor#
ru: золотой курсор#
tr: altın İmleç #

source: Author: salah atair, Joseph Lee
ru: Автор: salah atair, Joseph Lee
tr: Yazarlar: salah atair, Joseph Lee

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı Sürümü İndirin][1]

source: NVDA compatibility: 2022.4 and beyond
ru: Совместимость с NVDA: 2022.4 и выше
tr: NVDA uyumluluğu: 2022.4 ve sonrası

source: This add-on allows you to move the mouse using a keyboard and save mouse positions for applications.
ru: Это дополнение позволит перемещать мышь с помощью клавиатуры и сохранять позиции мыши для приложений.
tr: Bu eklenti, klavyeyi kullanarak fareyi hareket ettirmenize ve uygulamalar için fare konumlarını kaydetmenizi sağlar.

source: Key commands
ru: Комбинации клавиш
tr: Kısayol Tuşları

source: Control+NVDA+L: view saved mouse positions for an application, if any. You can also assign gestures to these positions from this dialog. When pressing the assigned gesture, a left click will be performed in the saved position.
ru: Control+NVDA+L: просмотреть сохранённые положения мыши для приложения, если таковые имеются. Вы также можете назначить жесты для этих положений в этом диалоге. При нажатии на назначенный жест сохранённого положения будет выполнен щелчок левой кнопки мыши.
tr: Kontrol+NVDA+L: Varsa, bir uygulama için kaydedilmiş fare konumlarını görüntüler. Bu iletişim kutusundan bu konumlara hareketler de atayabilirsiniz. Atanan harekete basıldığında, kaydedilen konumda bir sol tıklama gerçekleştirilecektir.

source: Shift+NVDA+l: save a tag or a label for the current mouse position in the currently focused application.
ru: Shift+NVDA+l: сохранить тег или метку для текущего положения мыши в текущем приложении в фокусе.
tr: Shift+NVDA+l: o anda odaklanılan uygulamada geçerli fare konumu için bir etiket veya etiket kayded.

source: Windows+NVDA+C: change mouse movement unit.
ru: Windows+NVDA+C: изменить единицу перемещения мыши.
tr: Windows+NVDA+C: fare hareket birimini değiştir.

source: Windows+NVDA+R: toggle mouse restriction.
ru: Windows+NVDA+R: переключить ограничение мыши.
tr: Windows+NVDA+R: fare kısıtlamasını aç/kapat.

source: Windows+NVDA+S: toggle reporting of mouse position in pixels.
ru: Windows+NVDA+S: включить или выключить объявления позиций мыши в пикселях.
tr: Windows+NVDA+S: fare konumunun piksel cinsinden raporlanmasını aç/kapat.

source: Windows+NVDA+J: move mouse to a specific x and y position.
ru: Windows+NVDA+J: переместить мышь в определённое положение по осям x и y.
tr: Windows+NVDA+J: fareyi belirli bir x ve y konumuna götür.

source: Windows+NVDA+P: report mouse position.
ru: Windows+NVDA+P: сообщить положение мыши.
tr: Windows+NVDA+P: fare konumunu bildir.

source: Windows+NVDA+M: sswitch mouse arrows on or off.
ru: Windows+NVDA+M: Включить или выключить стрелки мыши.
tr: Windows+NVDA+M: fare oklarını açar veya kapatır.

source: Windows+NVDA+arrow keys (or just arrow keys if mouse arrows is on): move mouse.
ru: Windows+NVDA+стрелки (или просто клавиши стрелок, если включены стрелки мыши): перемещение мыши.
tr: Windows+NVDA+ok tuşları (veya fare okları açıksa sadece ok tuşları): fareyi hareket ettirir.

source: Note: these gestures can be reassigned via NVDA's Input Gestures dialog under Golden Cursor category.
ru: Примечание: эти жесты могут быть переназначены в диалоге жестов ввода в категории "Золотой Курсор".
tr: Not, bu hareketler NVDA Girdi Hareketleri iletişim kutusunda bulunan Altın İmleç kategorisinden yeniden atanabilir.

source: Notes
ru: Примечания
tr: Notlar

source: When sharing positions (tags), each party should use same display resolution.
ru: При предоставлении позиционирования (тэгов), каждая сторона должна использовать одинаковое Разрешение дисплея.
tr: Konumları (etiketleri) paylaşırken, her bir taraf aynı ekran çözünürlüğünü kullanmalıdır.

source: For maximum compatibility, you should maximize windows by pressing Windows+Up arrow.
ru: Для максимальной совместимости, вы должны развернуть окна, нажав клавиши Windows+стрелка вверх.
tr: Maksimum uyumluluk için Windows yukarı ok tuşuna basarak pencereleri büyütmelisiniz.

source: When sharing positions, existing position labels should be renamed.
ru: При совместном позиционировании, существующие метки позиций должны быть переименованы.
tr: Konumları paylaşırken, mevcut konum etiketleri yeniden adlandırılmalıdır.

source: Version 1.x and 2.x mouse position formats are incompatible.
ru: Форматы положения мыши версий 1.x и 2.x несовместимы.
tr: Sürüm 1.x ve 2.x fare konumu biçimleri uyumsuzdur.

source: To perform functions that require use of arrow keys, turn off mouse arrows first.
ru: Для выполнения функций, требующих использования клавиш стрелок, сначала отключите стрелки мыши.
tr: Ok tuşlarının kullanılmasının gerektiği işlemlerde önce fare oklarını kapatmanız gerekir.

source: When deleting saved positions, if there are no saved positions left, positions for the application will be cleared.
ru: При удалении сохранённых положений, если сохраненных положений не осталось, положения для приложения будут удалены.
tr: Kaydedilen pozisyonlar silinirken, kayıtlı pozisyon kalmamışsa, uygulama için pozisyonlar silinecektir.

source: Version 6.2
ru: Версия 6.2
tr: Sürüm6.2

source: Requires NVDA 2022.4 or later.
ru: Требуется NVDA 2022.4 и выше.
tr: NVDA 2022.4 ve sonraki bir sürümü gerektirir.

source: Compatible with NVDA 2023.1.
ru: Совместимо с NVDA 2023.1.
tr: NVDA 2023.1 ile uyumludur.

source: Version 6.1
ru: Версия 6.1
tr: Sürüm6.1

source: Requires NVDA 2021.3 or later.
ru: Требуется NVDA 2021.3 и выше.
tr: NVDA 2021.3 ve sonraki bir sürümü gerektirir.

source: Now, you can assign shortcuts for saved positions from the positions list. When pressing a shortcut, a left click will be performed for the position.
ru: Теперь вы можете назначить горячие клавиши для сохраненных положений из списка. При нажатии на горячую клавишу для положения будет выполнен щелчок левой кнопкой мыши.
tr: Artık pozisyonlar listesinden kayıtlı pozisyonlar için kısayollar atayabilirsiniz. Bir kısayola basıldığında, konum için sol tıklama gerçekleştirilecektir.

source: Version 5.0
ru: Версия 5.0
tr: Sürüm 5.0

source: Modernized add-on source code to make it compatible with NVDA 2021.1.
ru: Обновлен исходный код дополнения, чтобы сделать его совместимым с NVDA 2021.1.
tr: NVDA 2021.1 ile uyumlu hale getirmek için eklenti kaynak kodu modernize edildi.

source: Resolved many coding style issues and potential bugs with Flake8.
ru: Устранены многие проблемы со стилем кодирования и потенциальные ошибки с помощью Flake8.
tr: Flake8 ile birçok kodlama stili sorunu ve olası hatalar çözüldü.

source: Version 4.0
ru: Версия 4.0
tr: Sürüm 4.0

source: Requires NVDA 2019.3 or later.
ru: Требуется NVDA 2019.3 и выше.
tr: NVDA 2019.3 ve sonraki bir sürümü gerektirir.

source: Golden Cursor settings dialog has been replaced by Golden Cursor settings panel.
ru: Диалог настроек Golden Cursor был заменён панелью настроек Golden Cursor.
tr: Altın İmleç ayarları iletişim kutusu, Altın İmleç ayarları paneli ile değiştirildi.

source: Version 3.3
ru: Версия 3.3
tr: Sürüm 3.3

source: Internal changes to support future NVDA releases.
ru: Внутренние изменения для поддержки будущих выпусков NVDA.
tr: Gelecekteki NVDA sürümlerini desteklemek için dahili değişiklikler.

source: Version 3.2
ru: Версия 3.2
tr: Sürüm 3.2

source: Add-on is compatible with NVDA 2018.3 (wxPython 4).
ru: Дополнение совместимо с NVDA 2018.3 (wxPython 4).
tr: Eklenti, NVDA 2018.3 (wxPython 4) ile uyumludur.

source: Version 3.0
ru: Версия 3.0
tr: Sürüm 3.0

source: If using NVDA 2018.2, add-on settings will be found in new multi-category settings screen under "Golden Cursor" category.
ru: При использовании NVDA 2018.2 настройки дополнения будут доступны на новом экране настроек для нескольких категорий в категории "Golden Cursor".
tr: NVDA 2018.2 kullanılıyorsa, "Altın İmleç" kategorisi altındaki yeni çoklu kategori ayarları ekranında eklenti ayarları bulunacaktır.

source: Version 2.1
ru: Версия 2.1
tr: Sürüm 2.1

source: Fixed unicode decode error when trying to delete tag name.
ru: Исправлена ошибка декодирования в юникоде при попытке удалить название тега.
tr: Etiket adını silmeye çalışırken sabit unicode kod çözme hatası düzeltildi.

source: Prevent Multiple Instances When Opening various add-on Dialogs.
ru: Предотвращено Многократное Использование При Открытии различных Диалогов дополнений.
tr: Eklentiyle ilgili birden fazla iletişim kutusu açılabilme sorunu düzeltildi.

source: Improved appearance of mouse positions list and jump to position dialogs.
ru: Улучшен внешний вид списка положений мыши и диалогов перехода к положениям.
tr: Fare konumları listesi ve konum atlama iletişim kutularıyla ilgili iyileştirmeler.

source: Version 2.0
ru: Версия 2.0
tr: Sürüm 2.0

source: Requires NVDA 2017.3 and later.
ru: Требуется NVDA 2017.3 и выше.
tr: NVDA 2017.3 ve sonraki bir sürümü gerektirir.

source: Position file format is incompatible with 1.x versions. If 1.x position format is found, old positions will be migrated to the new format during installation.
ru: Формат файла положения несовместим с версиями 1.x. Если найден формат положения 1.x, старые положения будут перенесены в новый формат во время установки.
tr: Konum dosyası formatı 1.x sürümleriyle uyumlu değil. 1.x pozisyon formatı bulunursa, kurulum sırasında eski pozisyonlar yeni formata taşınacaktır.

source: Added a new Golden Cursor settings dialog in NVDA's Preferences menu to configure mouse movement unit and announcement of mouse positions as mouse moves.
ru: Добавлен новый диалог настроек Golden Cursor в меню настроек NVDA для настройки единицы перемещения мыши и объявления положения мыши при её перемещении.
tr: Fare hareket birimini yapılandırmak ve fare hareket ettikçe fare konumlarının duyurusunu yapmak için NVDA Tercihler menüsüne yeni bir Altın İmleç ayarları iletişim kutusu eklendi.

source: Various messages from this add-on has changed.
ru: Изменились различные сообщения дополнения.
tr: Bu eklentiden gelen çeşitli mesajlar değişti.

source: When toggling various settings, toggle tone will no longer be heard.
ru: При переключении различных настроек звуковой сигнал переключения больше не будет слышен.
tr: Çeşitli ayarlar arasında geçiş yapılırken geçiş tonu artık duyulmayacaktır.

source: You can now enter mouse arrows mode where you can move the mouse by pressing just arrow keys.
ru: Теперь вы можете перейти в режим стрелок мыши, в котором вы можете перемещать мышь, нажимая только клавиши стрелок.
tr: Artık sadece ok tuşlarına basarak fareyi hareket ettirebileceğiniz fare okları moduna girebilirsiniz.

source: Changes to positions list dialog, including new name (now called Mouse Positions) and layout, displaying mouse coordinates for a label, and showing the name of the active app as part of the title.
ru: Изменения в диалоге списка положений, включая новое название (теперь оно называется положениями мыши) и макет, отображение координат мыши для надписи и отображение названия активного приложения в качестве части заголовка.
tr: Yeni ad (artık Fare Konumları olarak adlandırılır) ve düzen, bir etiket için fare koordinatlarını görüntüleme ve etkin uygulamanın adını başlığın bir parçası olarak gösterme dahil olmak üzere konum listesi iletişim kutusundaki değişiklikler.

source: From Mouse Positions dialog, pressing Enter on a saved label will move the mouse to the saved location.
ru: В диалоге "Положение мыши" нажатие клавиши Enter на сохраненной метке приведет к перемещению мыши в сохраненное местоположение.
tr: Fare Konumları iletişim kutusundan, kaydedilmiş bir etiket üzerinde Enter'a basmak, fareyi kaydedilen konuma hareket ettirecektir.

source: When renaming a mouse position, an error dialog will be shown if a label with the same name as the new name exists.
ru: При переименовании положения мыши будет показан диалог с сообщением об ошибке, если существует метка с тем же именем, что и новое имя.
tr: Bir fare konumunu yeniden adlandırırken, yeni adla aynı ada sahip bir etiket varsa bir hata iletişim kutusu gösterilecektir.

source: When deleting or clearing mouse positions, you must now answer Yes before positions are deleted and/or cleared.
ru: При удалении или очистке положений мыши теперь вы должны ответить "Да", прежде чем положения будут удалены и/или очищены.
tr: Fare konumlarını silerken veya temizlerken, konumlar silinmeden ve/veya temizlenmeden önce şimdi Evet yanıtını vermelisiniz.

source: Changes to mouse jump feature, including a new name (now called New mouse position) and ability to enter X and Y coordinates separately or by using up or down arrow keys.
ru: Изменения в функции прыжка мыши, включая новое название (теперь оно называется "Новое положение мыши") и возможность вводить координаты X и Y отдельно или с помощью клавиш стрелок вверх или вниз.
tr: Yeni bir ad (artık Yeni fare konumu olarak adlandırılıyor) ve X ve Y koordinatlarını ayrı ayrı veya yukarı veya aşağı ok tuşlarını kullanarak girme yeteneği dahil olmak üzere fare atlama özelliğinde yapılan değişiklikler.

source: The dialog shown when saving the current mouse position now shows coordinates for current mouse location.
ru: В диалоге, отображаемом при сохранении текущего положения мыши, теперь отображаются координаты её текущего положения.
tr: Geçerli fare konumu kaydedilirken gösterilen iletişim kutusu artık geçerli fare konumu için koordinatları gösteriyor.

source: When saving positions, resolved an issue where NvDA may play error tones if the positions folder does not exist.
ru: При сохранении позиций устранена проблема, из-за которой NVDA может воспроизводить звуковые сигналы ошибки, если папка позиций не существует.
tr: Konumları kaydederken, konumlar klasörü yoksa NVDA'nın hata sesi çalması sorunu çözüldü.

source: Version 1.4
ru: Версия 1.4
tr: Sürüm 1.4

source: Removed win32api dependency to make it compatible with past and future versions of NVDA.
ru: Удалена зависимость от win32api, чтобы сделать его совместимым с предыдущими и будущими версиями NVDA.
tr: Eklentiyi NVDA'nın geçmiş ve gelecekteki sürümleriyle uyumlu hale getirmek için win32api bağımlılığı kaldırıldı.

source: Version 1.0
ru: Версия 1.0
tr: Sürüm 1.0

source: Initial release.
ru: Первоначальный выпуск.
tr: İlk sürüm.
