Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/goldenCursor/*/goldenCursor.po
Languages: tr

source: left click
tr: sol tık

source: Mouse positions for %s
tr: %s için konum listesi

source: New mouse position
tr: Yeni fare konumu

source: &Saved mouse positions
tr: &Kayıtlı fare konumları

source: &Jump
tr: &Atla

source: &Rename
tr: &Yenidan adlandır

source: &add shortcut
tr: &kısayol ekle

source: &Delete
tr: Si&l

source: C&lear positions
tr: Konum&ları sil

source: &Close
tr: &Kapat

source: Name
tr: Ad

source: Position X
tr: X konumu

source: Position Y
tr: Y konumu

source: shortCut
tr: kısayol

source: &X position
tr: &X konumu

source: &Y position
tr: &Y konumu

source: New name
tr: Yeni ad

source: Rename
tr: Yeniden adlandır

source: Another mouse position has the same name as the entered name. Please choose a different name.
tr: Başka bir fare konumu aynı adı taşıyor. Lütfen başka bir ad girin.

source: Error
tr: Hata

source: Enter input gesture:
tr: Girdi hareketini girin:

source: This shortCut is not valid, choose another one please
tr: Bu kısayol geçerli değil, lütfen başka bir tane seçin

source: Information
tr: Bilgi

source: Shortcut added successfully
tr: Kısayol başarıyla eklendi

source: Are you sure you want to delete the position named {name}? This cannot be undone.
tr: {name} adlı konumu silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Delete position
tr: Konumu sil

source: Are you sure you want to clear mouse positions for the current application ({appName})? This cannot be undone.
tr: Mevcut uygulama ({appName}) için kaydedilmiş fare konumlarını silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

source: Clear mouse positions
tr: Fare konumlarını sil

source: All mouse positions for the application {appName} have been deleted.
tr: {appName} uygulaması için oluşturulmuş tüm fare konumları silindi.

source: Mouse positions cleared
tr: Fare konumları silindi

source: Golden Cursor
tr: Altın İmleç

source: Opens a dialog listing mouse positions for the current application
tr: Mevcut uygulama için daha önce oluşturulmuş fare konum listesini açar

source: No mouse positions for %s.
tr: %s için konum kaydı bulunamadı.

source: Opens a dialog to label the current mouse position and saves it
tr: Mevcut fare konumunun etiketlenip kaydedilmesi için bir iletişim kutusu açar

source: Enter the name for the current mouse position (x: {positionX}, Y: {positionY}
tr: Geçerli fare konumu için bir ad girin: (x: {positionX}, Y: {positionY})

source: Save mouse position
tr: Fare konumunu kaydet

source: Position saved in %s.
tr: Konum %s içine kaydedildi.

source: Changes mouse movement unit
tr: Fare hareket birimini değiştirir

source: toggles reporting of mouse coordinates in pixels when mouse moves
tr: fare hareket ettiğinde, yeni konumun piksel cinsinden bildirimini açıp kapatır

source: Report new mouse coordinates on
tr: Yeni fare konumu bildirimi açık

source: Report new mouse coordinates off
tr: Yeni fare konumu bildirimi kapalı

source: Reports current X and Y mouse position
tr: Mevcut fare konumunu X ve Y olarak söyler

source: Toggles mouse arrows to move the mouse with the arrow keys
tr: Farenin yön tuşlarıyla hareket ettirilmesiyle ilgili ayarı açıp kapatır

source: Mouse arrows on
tr: Açık, Yön tuşları fare hareketi için kullanılacak

source: Mouse arrows off
tr: Kapalı, yön tuşları fare hareketi için kullanılmayacak

source: Moves the Mouse pointer to the right
tr: Fare imlecini sağa taşır

source: Moves the Mouse pointer to the left
tr: Fare imlecini sola taşır

source: Moves the Mouse pointer down
tr: Fare imlecini aşağı taşır

source: Moves the Mouse pointer up
tr: Fare imlecini yukarı taşır

source: Opens a dialog to enter the X and Y coordinates for the mouse to move to
tr: Fare imlecinin atlaması için X ve Y koordinatının girileceği iletişim kutusunu açar

source: Toggles mouse movement restriction between current application and unrestricted
tr: Fare hareketinin mevcut uygulama ekranıyla sınırlanıp sınırlanmayacağıyla ilgili ayarı değiştirir

source: Mouse movement restricted to current application
tr: Kısıtlı, Fare mevcut uygulama içinde hareket eder

source: Mouse movement unrestricted
tr: Kısıtlanmamış

source: &Announce new mouse coordinates when mouse moves
tr: F&are hareket ederken yeni koordinatı bildir

source: Mouse movement &unit (in pixels)
tr: Fare hareket &birimi (piksel cinsinden)

source: Allows you to control the mouse movement with the keyboard. for further details please visit the addon guide help.
tr: Fare hareketlerinin klavyeyle kontrolünü sağlar. daha fazla bilgi için lütfen Eklenti yardımına bakın.
