Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/objPad/*/objPad.xliff
Languages: tr

source: ObjPad
tr: Nesne Dolaşımı

source: Author: Christopher Duffley <nvda@chrisduffley.com>, originally by Joseph Lee, Cleverson Uliana and others
tr: Yazar: Christopher Duffley <nvda@chrisduffley.com>, aslen Joseph Lee, Cleverson Uliana ve diğerleri tarafından yazılmıştır

source: NVDA compatibility: 2022.4 and later
tr: NVDA uyumluluğu: 2022.4 ve sonrası

source: This add-on provides quick commands to manage objects on screen, including navigation and other possibilities.
tr: Bu eklenti, gezinme ve diğer olasılıklar da dahil olmak üzere ekrandaki nesneleri yönetmek için hızlı komutlar sağlar.

source: Commands
tr: Komutlar

source: Control+NVDA+TAB: Steps through arrow key modes (see below for details).
tr: Kontrol+NVDA+TAB: Ok tuşu modlarında adım adım ilerler (ayrıntılar için aşağıya bakın).

source: Arrow key modes
tr: Ok tuş modları

source: The add-on provides four ways to use arrow keys:
tr: Eklenti, ok tuşlarını kullanmak için dört yol sağlar:

source: Classic (or normal mode): use arrow keys to move cursor.
tr: Klasik (veya normal mod): imleci hareket ettirmek için ok tuşlarını kullanın.

source: Object nav: use arrow keys to move to next/previous/parent/first child objects.
tr: Nesne Dolaşımı: sonraki/önceki/üst/ilk alt nesneye gitmek için ok tuşlarını kullanın.

source: Web: use arrow keys to cycle through elements and move between them.
tr: Web: öğeler arasında gezinmek için ok tuşlarını kullanın.

source: Scan mode: use arrow keys to move through objects on screen regardless of hierarchy.
tr: Tarama modu: sıralamadan bağımsız olarak ekrandaki nesneler arasında hareket etmek için ok tuşlarını kullanın.

source: The following commands are available with arrow keys set to object nav:
tr: Aşağıdaki komutlar, Nesne sunucusu modunda ok tuşlarıyla kullanılabilir:

source: Right arrow: next object.
tr: Sağ ok: sonraki nesne.

source: Left arrow: previous object.
tr: Sol ok: önceki nesne.

source: Up arrow: parent object.
tr: Yukarı ok: ana nesne.

source: Down arrow: first child object.
tr: Aşağı ok: ilk alt nesne.

source: SPACE or ENTER: activate.
tr: Aralık veya ENTER: etkinleştir.

source: With web mode active (elements are normal or moving by object, link, form field, heading, frame, table, list, landmark):
tr: Web modu etkinken (öğeler normaldir veya nesne, bağlantı, form alanı, başlık, çerçeve, tablo, liste, yer işaretine göre hareket eder):

source: Right arrow: next element.
tr: Sağ ok: sonraki öğe.

source: Left arrow: previous element.
tr: Sol ok: önceki öğe.

source: Up arrow: previous element type.
tr: Yukarı ok: önceki öğe türü.

source: Down arrow: next element type.
tr: Aşağı ok: sonraki öğe türü.

source: SPACE or ENTER: activate.
tr: Aralık veya ENTER: etkinleştir.

source: With scan mode active:
tr: Tarama modu etkinken:

source: Down arrow: next object or the next line.
tr: Aşağı ok: sonraki nesne veya sonraki satır.

source: Up arrow: previous object or previous line.
tr: Yukarı ok: önceki nesne veya önceki satır.

source: Right arrow: review next character.
tr: Sağ ok: sonraki karakteri gözden geçirin.

source: Left arrow: previous character.
tr: Sol ok: önceki karakter.

source: Control+right arrow: next word.
tr: Kontrol+sağ ok: sonraki kelime.

source: Control+left arrow: previous word.
tr: Kontrol+sol ok: önceki kelime.

source: SPACE or ENTER: activate.
tr: Aralık veya ENTER: etkinleştir.

source: Version 25.06
tr: Sürüm 25.06

source: Compatible with NVDA 2025.1
tr: NVDA 2025.1 ile uyumluluk

source: The link to download the add-on is no longer present to encourage usage of the Add-On Store.
tr: Eklenti Mağazası'nın kullanımını teşvik etmek için eklentiyi indirme bağlantısı artık mevcut değil.

source: Version 24.04
tr: Sürüm 24.04

source: Compatibility with NVDA 2024.1.
tr: NVDA 2024.1 ile uyumluluk.

source: Version 23.05
tr: Sürüm 23.05

source: To reflect the maintainer change, the manifest has been updated to indicate as such.
tr: Sürdürücü değişikliğini yansıtmak için, bildirim bu şekilde belirtilecek şekilde güncelleştirilmiştir.

source: Version 23.02
tr: Sürüm 23.02

source: NVDA 2022.4 or later is required.
tr: NVDA 2022.4 veya sonraki bir sürümü gerektirir.

source: Windows 10 21H2 (November 2021 Update/build 19044) or later is required.
tr: Windows 10 21H2 (Kasım 2021 Güncellemesi/derlemesi 19044) veya üstü gereklidir.

source: Version 23.01
tr: Sürüm 23.01

source: NVDA 2022.3 or later is required.
tr: NVDA 2022.3 veya sonraki bir sürümü gerektirir.

source: Windows 10 or later is required as Windows 7, 8, and 8.1 are no longer supported by Microsoft as of January 2023.
tr: Ocak 2023 itibariyle Windows 7, 8 ve 8.1 artık Microsoft tarafından desteklenmediğinden Windows 10 veya sonraki sürümleri gereklidir.

source: Version 22.06
tr: Sürüm 22.06

source: Requires NVDA 2021.3 or later.
tr: NVDA 2021.3 veya sonraki bir sürümü gerektirir.

source: Version 21.04
tr: Sürüm 21.04

source: Requires NVDA 2020.1 or later.
tr: NVDA 2020.1 veya sonraki bir sürümü gerektirir.

source: Version 20.01
tr: Sürüm 20.01

source: Requires NVDA 2019.3 or later.
tr: NVDA 2019.3 veya sonraki bir sürümü gerektirir.

source: Version 18.12
tr: Sürüm 18.12

source: Internal changes to support future NVDA releases.
tr: Gelecekteki NVDA sürümlerini desteklemek için dahili değişiklikler.

source: Version 18.09
tr: Sürüm 18.09

source: Added localizations.
tr: Yerelleştirmeler eklendi.

source: Enter key (regular and Numpad) can be used to activate objects.
tr: Nesneleri etkinleştirmek için enter tuşu (normal ve Numpad) kullanılabilir.

source: Version 18.03
tr: Sürüm 18.03

source: Better compatibility with NVDA 2018.1.
tr: NVDA 2018.1 ile daha iyi uyumluluk.

source: Version 16.12
tr: Sürüm 16.12

source: Added web mode.
tr: Web modu eklendi.

source: Version 16.10
tr: Sürüm 16.10

source: Initial stable version.
tr: İlk kararlı sürüm.
