Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/robEnhancements/*/robEnhancements.po
Languages: fi, ru, tr

source: Your Outlook version {Versionsnumber} is not supported.
fi: Outlookin versiota {Versionsnumber} ei tueta.
ru: Ваша версия Outlook {Versionsnumber} не поддерживается.
tr: Outlook {Versionsnumber} sürümü desteklenmiyor.

source: ROB enhancements
fi: ROB:n laajennukset
tr: ROB geliştirmeleri

source: This folder is empty.
fi: Tämä kansio on tyhjä.
ru: Эта папка пуста.
tr: Bu klasör boş.

source: Jumps to the next Outlook folder with unread mails below the inbox.
fi: Siirtää Outlookissa seuraavaan Saapuneet-kansion alapuolella olevaan, lukemattomia viestejä sisältävään kansioon.
ru: Переходит к следующей папке Outlook с непрочитанными письмами в папке со входящими.
tr: Gelen kutusunun altında okunmamış postaların bulunduğu bir sonraki Outlook klasörüne atlar.

source: {count} mails in the folder {folder}
fi: {count} viestiä kansiossa {folder}
ru: {count} писем в папке {folder}
tr: {folder} klasöründeki {count} posta

source: No unread mails found
fi: Lukemattomia viestejä ei löydy
ru: Непрочитанных писем не найдено
tr: Okunmamış e-posta bulunamadı

source: Outlook object not available - please contact the addon developer
fi: Outlook-objekti ei käytettävissä. Ota yhteyttä lisäosan kehittäjään.
ru: Объект Outlook недоступен - пожалуйста, свяжитесь с разработчиком дополнения
tr: Outlook nesnesi kullanılamıyor - lütfen eklenti geliştiricisiyle iletişime geçin

source: Show document URL, press twice copies to clipboard.
fi: Näyttää dokumentin URLin. Kahdesti painettaessa se kopioidaan leikepöydälle.
ru: Показывает URL документа, двойное нажатие копирует в буфер обмена.
tr: Belge URL'sini gösterir, iki kez basıldığında panoya kopyalanır.

source: copied to clipboard {URL}.
fi: Kopioitu leikepöydälle {URL}.
ru: {URL} скопирован в буфер обмена.
tr: {URL} panoya kopyalandı.

source: Document URL not found.
fi: Dokumentin URLia ei löydy.
ru: URL-адрес документа не найден.
tr: Belge URL'si bulunamadı.

source: No browser window found.
fi: Selainikkunaa ei löydy.
ru: Окно браузера не найдено.
tr: Tarayıcı penceresi bulunamadı.

source: support for various apps and some new functions.
fi: Tuki useille sovelluksille sekä muutamille uusille toiminnoille.
ru: поддержка различных приложений и некоторые новые функции.
tr: çeşitli uygulamalar ve bazı yeni işlevler için destek.
