Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/proxy/*/proxy.xliff
Languages: ru, tr

source: Proxy support for NVDA
ru: Поддержка прокси для NVDA
tr: NVDA için Proxy Desteği

source: Author: José Manuel Delicado
ru: Автор: Jose Manuel Delicado
tr: Yazar: José Manuel Delicado

source: NVDA compatibility: 2023.3.4 and beyond
ru: Совместимость с NVDA: 2023.3.4 и выше
tr: NVDA uyumluluğu: 2023.3.4 ve sonrası

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [kararlı sürümü indir][1]

source: This add-on allows the NVDA screen reader to connect to the Internet through one or more proxy servers. To make it possible, it applies various patches to the standard Python library or modifies certain environment variables, depending on the chosen configuration. You will be able to update NVDA and their add-ons automatically from your corporate environment and even perform remote sessions, provided that your organization proxy server allows it.
ru: Это дополнение позволяет программе чтения с экрана NVDA подключаться к Интернету через один или несколько прокси-серверов. Чтобы это стало возможным, оно применяет различные исправления к стандартной библиотеке Python или модифицирует определённые переменные среды в зависимости от выбранной конфигурации. Вы сможете автоматически обновлять NVDA и дополнения из вашей корпоративной среды и даже выполнять удалённые сеансы, если это позволяет прокси-сервер вашей организации.
tr: Bu eklenti, NVDA ekran okuyucusunun bir veya daha fazla proxy sunucusu aracılığıyla İnternet'e bağlanmasına olanak tanır. Bunu mümkün kılmak için, standart Python kitaplığına çeşitli yamalar uygular veya seçilen konfigürasyona bağlı olarak belirli ortam değişkenlerini değiştirir. NVDA'yı ve eklentilerini kurumsal ortamınızdan otomatik olarak güncelleyebilecek ve hatta kuruluş proxy sunucunuzun izin vermesi koşuluyla uzak oturumlar gerçekleştirebileceksiniz.

source: Features
ru: Возможности
tr: Özellikler

source: Support for various proxy server types: http, socks4 and socks5.
ru: Поддержка различных типов прокси-серверов: http, socks4 и socks5.
tr: Çeşitli proxy sunucu türleri için destek: http, çorap4 ve çorap5.

source: Ability to redirect all traffic through the proxy server or only specific traffic (http, https, ftp).
ru: Возможность перенаправить весь трафик через прокси-сервер или только определённый трафик (http, https, ftp).
tr: Tüm trafiği proxy sunucusu veya yalnızca belirli trafik (http, https, ftp) üzerinden yeniden yönlendirme yeteneği.

source: Ability to redirect all traffic through a proxy server and, after that, redirect specific traffic through other servers (nested proxies).
ru: Возможность перенаправить весь трафик через прокси-сервер и после этого перенаправить определённый трафик через другие серверы (вложенные прокси).
tr: Tüm trafiği bir proxy sunucusu üzerinden yeniden yönlendirme ve ardından belirli trafiği diğer sunucular (iç içe geçmiş proxy'ler) üzerinden yeniden yönlendirme yeteneği.

source: Profile switch and config reset aware: if you usually work with a portable copy of NVDA, you can create various profiles for different environments (home, work, office1, office2) and manually activate them.
ru: Переключение профиля и сброс настроек: если вы обычно работаете с переносной копией NVDA, вы можете создавать различные профили для разных сред (дом, работа, офис1, офис2) и активировать их вручную.
tr: Profil değiştirme ve yapılandırma sıfırlama farkındalığı: Genellikle NVDA'nın taşınabilir bir kopyasıyla çalışıyorsanız, farklı ortamlar (ev, iş, ofis1, ofis2) için çeşitli profiller oluşturabilir ve bunları manuel olarak etkinleştirebilirsiniz.

source: Usage
ru: Использование
tr: Kullanım

source: This add-on adds a new category to the NVDA settings dialog called "Proxy". In this category, you will find four settings groups. The first one allows you to configure a general proxy for all traffic. The other groups allow you to configure proxy servers only for specific protocols. All groups have the following fields:
ru: Это дополнение добавляет новую категорию в диалог настроек NVDA под названием "Прокси". В этой категории вы найдёте четыре группы настроек. Первая позволяет настроить общий прокси для всего трафика. Остальные группы позволяют настраивать прокси-серверы только для определённых протоколов. Все группы имеют следующие поля:
tr: Bu eklenti, NVDA Ayarları iletişim kutusuna "Proxy" adlı yeni bir kategori ekler. Bu kategoride dört ayar grubu bulacaksınız. Birincisi, tüm trafik için genel bir proxy yapılandırmanıza izin verir. Diğer gruplar Proxy sunucularını yalnızca belirli protokoller için yapılandırmanıza izin verir. Tüm grupların aşağıdaki alanları vardır:

source: Host: hostname or ip address of the proxy server. Leave empty to disable that particular proxy.
ru: Хост: имя хоста или IP-адрес прокси-сервера. Оставьте пустым, чтобы отключить этот конкретный прокси.
tr: Ana bilgisayar: proxy sunucusunun ana bilgisayar adı veya ip adresi. Söz konusu proxy'yi devre dışı bırakmak için boş bırakın.

source: Port: server port.
ru: Порт: порт сервера.
tr: Bağlantı noktası: sunucu bağlantı noktası.

source: Username: optional. User name for server autentication.
ru: Имя пользователя: необязательно. Имя пользователя для аутентификации сервера.
tr: Kullanıcı adı: isteğe bağlı. Sunucu yetkilendirmesi için kullanıcı adı.

source: Password: optional. Password for server autentication. Note that password is not required for socks4 servers.
ru: Пароль: необязательно. Пароль для аутентификации сервера. Обратите внимание, что для серверов socks4 пароль не требуется.
tr: Şifre: isteğe bağlı. Sunucu yetkilendirmesi için parola. Socks4 sunucuları için şifre gerekmediğini unutmayın.

source: In addition to the previous fields, the following options are available in the first settings group:
ru: Помимо предыдущих полей, в первой группе настроек доступны следующие опции:
tr: Önceki alanlara ek olarak, ilk ayarlar grubunda aşağıdaki seçenekler mevcuttur:

source: SOCKS proxy type: socks4, socks5 or http can be selected.
ru: Тип прокси SOCKS: можно выбрать socks4, socks5 или http.
tr: SOCKS proxy türü: socks4, socks5 veya http seçilebilir.

source: Use proxy for dns requests if possible: when this checkbox is checked, hostnames or domain names will be directly sent to and resolved on the proxy server. When it is unchecked, names will be resolved locally and the server will receive only the destination ip address. Note that not all socks4 proxy servers support this option.
ru: Использовать прокси для запросов DNS, если это возможно: если этот флажок установлен, имена хостов или доменные имена будут напрямую отправляться и разрешаться на прокси-сервере. Если флажок снят, имена будут разрешаться локально, и сервер будет получать только IP-адрес назначения. Обратите внимание, что не все прокси-серверы socks4 поддерживают эту опцию.
tr: Mümkünse dns istekleri için proxy kullan: Bu onay kutusu işaretlendiğinde, ana bilgisayar adları veya alan adları doğrudan proxy sunucusuna gönderilir ve burada çözümlenir. İşareti kaldırıldığında, isimler yerel olarak çözülecek ve sunucu sadece hedef ip adresini alacaktır. Tüm stock4 proxy sunucularının bu seçeneği desteklemediğini unutmayın.

source: Tipically, most users will only have to configure the first settings group. If you don't know your proxy details, ask your organization network administrator for more information.
ru: Как правило, большинству пользователей потребуется настроить только первую группу параметров. Если вы не знаете данные своего прокси-сервера, обратитесь за дополнительной информацией к сетевому администратору вашей организации.
tr: Genellikle çoğu kullanıcının yalnızca ilk ayar grubunu yapılandırması gerekir. Proxy ayrıntılarınızı bilmiyorsanız, daha fazla bilgi için kuruluş ağ yöneticinize danışın.

source: Limitations
ru: Ограничения
tr: Sınırlamalar

source: Very limited IPV6 support.
ru: Очень ограниченная поддержка IPV6.
tr: Çok sınırlı IPV6 desteği.

source: UDP traffic is not supported on all proxy servers.
ru: Трафик UDP поддерживается не на всех прокси-серверах.
tr: UDP trafiği tüm proxy sunucularında desteklenmez.

source: External DLL libraries won't respect the settings configured in this add-on.
ru: Внешние библиотеки DLL не будут учитывать параметры, настроенные в этом дополнении.
tr: Harici DLL kitaplıkları bu eklentide yapılandırılan ayarlara uymaz.

source: Only basic autentication is supported for http proxy servers. Digest autentication is not supported.
ru: Для HTTP-прокси-серверов поддерживается только базовая аутентификация. Дайджест-аутентификация не поддерживается.
tr: Http proxy sunucuları için yalnızca temel kimlik doğrulama desteklenir. Özet kimlik doğrulaması desteklenmiyor.

source: In order to redirect all traffic (including https connections) through an http proxy, the server must support the CONNECT http method.
ru: Для перенаправления всего трафика (включая соединения https) через http-прокси сервер должен поддерживать метод CONNECT http.
tr: Tüm trafiği (https bağlantıları dahil) bir http proxy üzerinden yeniden yönlendirmek için sunucunun CONNECT http yöntemini desteklemesi gerekir.

source: A "direct connection" mode can't be configured. If you disable a specific proxy, the system default will be used instead.
ru: Невозможно настроить режим "прямое подключение". Если вы отключите конкретный прокси, вместо него будет использоваться системное значение по умолчанию.
tr: Bir "doğrudan bağlantı" modu yapılandırılamaz. Belirli bir proxy'yi devre dışı bırakırsanız, bunun yerine sistem varsayılanı kullanılır.

source: Changelog
ru: Журнал изменений
tr: Değişiklik Günlüğü

source: Version 1.2
ru: Версия 1.2
tr: Sürüm 1.2

source: Compatible with NVDA 2023.1.
ru: Совместимость с NVDA 2023.1.
tr: NVDA 2023.1 ile uyumlu.

source: For security reasons, minimum NVDA version is set to 2022.4.
ru: В целях безопасности минимальная версия NVDA установлена на 2022.4.
tr: Güvenlik sebeplerinden dolayı minimum NVDA sürümü 2022.4'e ayarlanmıştır.

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Version 1.1
ru: Версия 1.1
tr: Sürüm 1.1

source: Compatible with NVDA 2022.1.
ru: Совместимость с NVDA 2022.1.
tr: NVDA 2022.1 ile uyumlu.

source: For security reasons, minimum NVDA version is set to 2021.3.
ru: В целях безопасности минимальная версия NVDA установлена на 2021.3.
tr: Güvenlik sebeplerinden dolayı minimum NVDA sürümü 2021.1'e ayarlanmıştır.

source: Patch socket.getaddrinfo function when "Use proxy for dns requests if possible" checkbox is checked and a general proxy has been configured.
ru: Исправлена функция socket.getaddrinfo, когда установлен флажок "Использовать прокси для DNS-запросов, если возможно" и настроен общий прокси.
tr: "Mümkünse dns istekleri için proxy kullan" onay kutusu işaretlendiğinde ve genel bir proxy yapılandırıldığında socket.getaddrinfo işlevini yama.

source: Updated translations.
ru: Обновлены переводы.
tr: Çeviriler güncellendi.

source: Version 1.0
ru: Версия 1.0
tr: Sürüm 1.0

source: Initial release.
ru: Первый выпуск.
tr: İlk sürüm.
