Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/charInfo/*/charInfo.xliff
Languages: pt_pt

source: Character information
pt_pt: Informação do caracter

source: Author: Cyrille Bougot
pt_pt: Autor: Cyrille Bougot

source: NVDA compatibility: 2022.3.3 and beyond
pt_pt: Compatibilidade com NVDA: 2022.3.3 e posterior

source: This add-on allows to present in a message various information about a character.
pt_pt: Este extra permite apresentar numa mensagem várias informações sobre um carater.

source: It also allows to customize the information reported on a character when using review cursor character navigation commands or multiple presses of the review character command.
pt_pt: Também permite personalizar as informações comunicadas sobre um carácter quando se utilizam comandos de navegação do carácter do cursor de revisão ou múltiplas pressões do comando do carácter de revisão.

source: Features
pt_pt: Características

source: Display detailed information on a character, e.g. Unicode name, number, CLDR, symbol name, etc.
pt_pt: Apresentar informações detalhadas sobre um carácter, por exemplo, nome Unicode, número, CLDR, nome do símbolo, etc.

source: This information can be displayed either at the location of the review cursor or at the location of the system cursor.
pt_pt: Essas informações podem ser exibidas no local do cursor de revisão ou no local do cursor do sistema.

source: Customize the reported information when pressing `numpad2`.
pt_pt: Personaliza a informação reportada quando se prime `numpad2`.

source: Use the same custom information when moving the review cursor by character.
pt_pt: Utilize a mesma informação personalizada quando mover o cursor de revisão por carácter.

source: Commands
pt_pt: Comandos

source: `Numpad2` (all keyboard layouts) or `NVDA+.` (laptop layout): when pressed 4 times, displays information about the character of the current navigator object where the review cursor is situated. This command can also be customized in the settings of the add-on.
pt_pt: `Numpad2` (todos os layouts de teclado) ou `NVDA+.` (layout de laptop): quando pressionado 4 vezes, exibe informações sobre o caractere do objeto do navegador atual onde o cursor de revisão está situado. Este comando também pode ser personalizado nas configurações do add-on.

source: Unassigned: Presents a message with detailed information on the character where the review cursor is situated. If you feel uncomfortable with the four press gesture, you may use this command instead.
pt_pt: Não atribuído: Apresenta uma mensagem com informações detalhadas sobre o carácter onde se encontra o cursor de revisão. Se não se sentir à vontade com o gesto de premir quatro vezes, pode utilizar este comando.

source: Unassigned: Presents a message with detailed information on the character at the position of the caret (works only in places where there is a caret).
pt_pt: Não atribuído: Apresenta uma mensagem com informações detalhadas sobre o carácter na posição do cursor (funciona apenas em locais onde existe um cursor).

source: Unassigned: Opens Character Information add-on settings.
pt_pt: Não atribuído: Abre as definições do suplemento Informações sobre caracteres.

source: The unassigned commands need first to be assigned in the Input gestures dialog to be used.
pt_pt: Para poderem ser utilizados, os comandos não atribuídos têm primeiro de ser atribuídos na caixa de diálogo Gestos de entrada.

source: Detailed information on a character
pt_pt: Informações pormenorizadas sobre uma personagem

source: The presented information include the following sections:
pt_pt: As informações apresentadas incluem as seguintes secções:

source: Unicode: information from Unicode norm, i.e. name, CLDR name, value, block, etc.
pt_pt: Unicode: informações da norma Unicode, ou seja, nome, nome CLDR, valor, bloco, etc.

source: MS font, only for characters written with proprietary Microsoft fonts (Symbol, Wingding 1, 2, 3 and Webding): name and information about the equivalent Unicode character.
pt_pt: Tipo de letra MS, apenas para caracteres escritos com tipos de letra proprietários da Microsoft (Symbol, Wingding 1, 2, 3 e Webding): nome e informações sobre o carácter Unicode equivalente.

source: NVDA symbol description: information allowing to understand how NVDA reports the symbol description. NVDA uses the information in the top most rows containing available information to provide the description of a symbol.
pt_pt: Descrição do símbolo NVDA: informações que permitem compreender como a NVDA reporta a descrição do símbolo. A NVDA utiliza as informações das linhas superiores que contêm informações disponíveis para fornecer a descrição de um símbolo.

source: NVDA character description: information allowing to understand how NVDA reports the character description (e.g. "alpha" for "A"). NVDA uses the information in the top most rows containing available information to provide the description of a character.
pt_pt: Descrição do carácter NVDA: informação que permite compreender a forma como o NVDA reporta a descrição do carácter (por exemplo, "alfa" para "A"). O NVDA utiliza as informações das linhas superiores que contêm informações disponíveis para fornecer a descrição de um carácter.

source: The provided information in the Unicode section is in English since it is part of Unicode norm. If a local translation exists for this add-on, the information is also provided alongside with English.
pt_pt: As informações fornecidas na secção Unicode estão em inglês, uma vez que fazem parte da norma Unicode. Se existir uma tradução local para este suplemento, a informação também é fornecida juntamente com o inglês.

source: Regarding NVDA symbol description section: This add-on does not yet support custom symbol dictionaries (introduced in NVDA 2024.4).
pt_pt: Relativamente à secção de descrição de símbolos do NVDA: Este add-on ainda não suporta dicionários de símbolos personalizados (introduzidos no NVDA 2024.4).

source: They already appear in the list "Options used to compute the symbol" but not in the table itself.
pt_pt: Já aparecem na lista "Opções utilizadas para calcular o símbolo", mas não na tabela propriamente dita.

source: Settings
pt_pt: Configurações

source: This add-on has its own category in NVDA's settings dialog where you can configure the following options.
pt_pt: Esta extensão tem a sua própria categoria na caixa de diálogo de definições do NVDA, onde pode configurar as seguintes opções.

source: Action for multiple presses of the report review character command
pt_pt: Ação para múltiplas pressões do comando de caracteres de revisão do relatório

source: The three combo boxes of this group allow to customize what is reported by the report review character command (`numpad2`) when using two, three or four presses.
pt_pt: As três caixas combinadas deste grupo permitem personalizar o que é reportado pelo comando de caracteres de revisão do relatório (`numpad2`) quando se utilizam duas, três ou quatro pressões.

source: By default, NVDA reports the character description on second press and its numeric value, decimal and hexadecimal, on third press.
pt_pt: Por predefinição, o NVDA apresenta a descrição do carácter na segunda pressão e o seu valor numérico, decimal e hexadecimal, na terceira pressão.

source: You can change what is reported on the character at the position of the review cursor upon multiple presses.
pt_pt: É possível alterar o que é reportado no carácter na posição do cursor de revisão após múltiplas pressões.

source: For example, you can report its CLDR English name on second press, its Unicode name on third press and display detailed information on it on fourth press.
pt_pt: Por exemplo, pode indicar o seu nome CLDR em inglês na segunda pressão, o seu nome Unicode na terceira pressão e apresentar informações detalhadas sobre o mesmo na quarta pressão.

source: Remember these action during character navigation
pt_pt: Lembre-se destas acções durante a navegação de caracteres

source: When you have reported specific information with the report review character command (`numpad2`) called multiple times, you may want to continue reporting the same information while navigating with the review cursor (`numpad1` and `numpad3`).
pt_pt: Quando tiver reportado informação específica com o comando reportar carácter de revisão (`numpad2`) chamado várias vezes, pode querer continuar a reportar a mesma informação enquanto navega com o cursor de revisão (`numpad1` e `numpad3`).

source: Checking this option will allow you to do it, as long as you navigate with the review cursor by character just after a multiple press of `numpad2`.
pt_pt: Se selecionar esta opção, poderá fazê-lo, desde que navegue com o cursor de revisão por carácter logo após uma pressão múltipla de `numpad2`.

source: Change log
pt_pt: Registro de Alterações

source: Version 3.5
pt_pt: Versão 3.5

source: Partial implementation of the support for custom dictionaries (introduced in NVDA 2024.4).
pt_pt: Implementação parcial do suporte para dicionários personalizados (introduzido no NVDA 2024.4).

source: Fixed Unicode 16.0 support: block names for English and French updated.
pt_pt: Suporte Unicode 16.0 corrigido: nomes de blocos para inglês e francês actualizados.

source: Compatibility with NVDA 2025.1.
pt_pt: Compatibilidade com NVDA 2025.1.

source: Version 3.4
pt_pt: Versão 3.4

source: Fixed an issue preventing NVDA to run safe scripts on lock screen.
pt_pt: Foi corrigido um problema que impedia o NVDA de executar scripts seguros no ecrã de bloqueio.

source: Version 3.3
pt_pt: Versão 3.3

source: Update to Unicode 16.0.
pt_pt: Atualização para Unicode 16.0.

source: Version 3.2
pt_pt: Versão 3.2

source: Bugfix: characters for which only the speech level has been changed do not prevent anymore the information report to be displayed.
pt_pt: Correção: os caracteres para os quais apenas o nível de voz foi alterado já não impedem a apresentação do relatório de informações.

source: Version 3.1
pt_pt: Versão 3.1

source: Fixed an error when there was no value to report for a character.
pt_pt: Foi corrigido um erro quando não havia nenhum valor a reportar para um carácter.

source: Compatibility with NVDA 2024.1.
pt_pt: Compatibilidade com o NVDA 2024.1.

source: Version 3.0
pt_pt: Versão 3.0

source: It is now possible to configure the property reported for the character under the review cursor upon multiple presses on `numpad2`. Optionally, after having used multiple press on `numpad2`, the last reported property can also be reported as long as you navigate by character with the review cursor (`numpad1` and `numpad3`).
pt_pt: Agora é possível configurar a propriedade relatada para o caractere sob o cursor de revisão ao pressionar várias vezes o `numpad2`. Opcionalmente, depois de ter usado múltiplos pressionamentos no `numpad2`, a última propriedade reportada também pode ser reportada desde que você navegue por caractere com o cursor de revisão (`numpad1` e `numpad3`).

source: Prepares compatibility with NVDA 2024.1: speech on-demand support.
pt_pt: Prepara a compatibilidade com o NVDA 2024.1: suporte de voz a pedido.

source: Addresses potential security issues related to [GHSA-xg6w-23rw-39r8][4] when using the add-on with older versions of NVDA. However, it is recommended to use NVDA 2023.3.3 or higher.
pt_pt: Resolve potenciais problemas de segurança relacionados com [GHSA-xg6w-23rw-39r8][4] ao utilizar o suplemento com versões mais antigas do NVDA. No entanto, recomenda-se a utilização do NVDA 2023.3.3 ou superior.

source: Version 2.6
pt_pt: Versão 2.6

source: Update to Unicode 15.1.
pt_pt: Atualização para Unicode 15.1.

source: Adds support for Python 3.11 to prepare compatibility with NVDA 2024.1.
pt_pt: Adiciona suporte para Python 3.11 para preparar a compatibilidade com o NVDA 2024.1.

source: Note: From now on, translation updates will not appear anymore in the change log.
pt_pt: Nota: A partir de agora, as actualizações de tradução deixarão de aparecer no registo de alterações.

source: Version 2.5
pt_pt: Versão 2.5

source: Fixed import error with last NVDA alpha versions, NVDA 2023.2 development cycle (contribution Noelia Ruiz Martínez).
pt_pt: Correção do erro de importação com as últimas versões alfa do NVDA, ciclo de desenvolvimento do NVDA 2023.2 (contribuição de Noelia Ruiz Martínez).

source: Version 2.4
pt_pt: Versão 2.4

source: Updated localizations.
pt_pt: Traduções actualizadas.

source: Version 2.3
pt_pt: Versão 2.3

source: Updated localizations.
pt_pt: Traduções actualizadas.

source: Version 2.2
pt_pt: Versão 2.2

source: Removed the dev channel.
pt_pt: Removido o canal de desenvolvimento.

source: Updated localizations.
pt_pt: Traduções actualizadas.

source: Version 2.1
pt_pt: Versão 2.1

source: Fixed some bugs preventing the character information report to be displayed when some options were used.
pt_pt: Foram corrigidos alguns erros que impediam a apresentação do relatório de informações sobre os caracteres quando eram utilizadas algumas opções.

source: Updated localizations.
pt_pt: Traduções actualizadas.

source: Version 2.0
pt_pt: Versão 2.0

source: Enhanced the character information report with information on NVDA symbol and NVDA character description.
pt_pt: Melhoria do relatório de informações sobre caracteres com informações sobre o símbolo NVDA e a descrição do carácter NVDA.

source: Added the support of compound character, e.g. letters with diacritic consisting in two or more Unicode characters.
pt_pt: Adicionado o suporte de caracteres compostos, por exemplo, letras com diacríticos que consistem em dois ou mais caracteres Unicode.

source: Update to Unicode 15.0
pt_pt: Atualização para Unicode 15.0

source: Updated French block data.
pt_pt: Dados actualizados do bloco francês.

source: Viewing character information is not allowed on lock screen and secure screens.
pt_pt: A visualização de informações de caracteres não é permitida no ecrã de bloqueio e nos ecrãs seguros.

source: On Windows lock screen, the script to review the current character can now operate normally (single, double or triple press).
pt_pt: No ecrã de bloqueio do Windows, o script para rever o carácter atual pode agora funcionar normalmente (pressão simples, dupla ou tripla).

source: Compatibility with NVDA 2023.1.
pt_pt: Compatibilidade com o NVDA 2023.1.

source: Drops compatibility with NVDA below 2022.3.3. The last version compatible with NVDA 2019.3 is the [1.8][3].
pt_pt: Deixa de ser compatível com o NVDA abaixo de 2022.3.3. A última versão compatível com o NVDA 2019.3 é a [1.8][3].

source: Update localizations.
pt_pt: Atualizar as localizações.

source: Version 1.8
pt_pt: Versão 1.8

source: Update to Unicode 14.0.
pt_pt: Atualização para Unicode 14.0.

source: Compatibility with NVDA 2022.1.
pt_pt: Compatibilidade com NVDA 2022.1.

source: Drops compatibility with NVDA below 2019.3. The last version compatible with NVDA 2017.3 is the [1.7][2].
pt_pt: Deixa de ser compatível com o NVDA abaixo de 2019.3. A última versão compatível com o NVDA 2017.3 é a [1.7][2].

source: The release is now performed thanks to a GitHub action instead of appVeyor.
pt_pt: O lançamento é agora efectuado graças a uma ação GitHub em vez de appVeyor.

source: Update localizations.
pt_pt: Atualizar as localizações.

source: Version 1.7
pt_pt: Versão 1.7

source: Added localizations.
pt_pt: Adicionadas traduções.

source: Version 1.6
pt_pt: Versão 1.6

source: Compatibility NVDA 2021.1.
pt_pt: Compatibilidade com o NVDA 2021.1.

source: Version 1.5
pt_pt: Versão 1.5

source: Prepare compatibility with NVDA 2021.1 (contribution Lukasz Golonka).
pt_pt: Preparar a compatibilidade com o NVDA 2021.1 (contribuição de Lukasz Golonka).

source: Update along with last modifications on add-on template.
pt_pt: Atualizar juntamente com as últimas modificações no modelo de suplemento.

source: Version 1.4
pt_pt: Versão 1.4

source: Added a script to get information for the character at the caret position (contribution Lukasz Golonka).
pt_pt: Adicionado um script para obter informações sobre o carácter na posição do cursor (contribuição de Lukasz Golonka).

source: Update to Unicode 13.0.
pt_pt: Atualização para Unicode 13.0.

source: Version 1.3
pt_pt: Versão 1.3

source: Fixes a bug with NVDA 2019.3.
pt_pt: Corrige um erro com o NVDA 2019.3.

source: Version 1.2
pt_pt: Versão 1.2

source: Provides additional information on characters written with Microsoft fonts.
pt_pt: Fornece informações adicionais sobre caracteres escritos com tipos de letra Microsoft.

source: Version 1.1
pt_pt: Versão 1.1

source: Updates to support newer versions of NVDA (Python 2 and 3 compatible)
pt_pt: Actualizações para suportar as versões mais recentes do NVDA (Compatibilidade com Python 2 e 3)

source: Releases performed now with appveyor
pt_pt: actualizações realizadas agora com o apveyor

source: Version 1.0
pt_pt: Versão 1.0

source: Initial release.
pt_pt: Lançamento inicial.
