Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/charInfo/*/charInfo.po
Languages: ru, tr

source: Detailed character information
ru: Подробная информация о символе
tr: Detaylı karakter bilgisi

source: [Not defined]
ru: [Не определено]
tr: [Tanımlanmamış]

source: [No file]
ru: [Нет файла]
tr: [Dosya yok]

source: No value
ru: Нет значения
tr: Değer yok

source: Character
ru: Символ
tr: Karakter

source: Name
ru: Название
tr: Ad

source: CLDR name
ru: Название CLDR
tr: CLDR adı

source: Decimal value
ru: Десятичное значение
tr: Ondalık değer

source: Hex value
ru: Шестнадцатиричное значение
tr: Onaltılık değer

source: Category
ru: Категория
tr: Kategori

source: Block
ru: Юникодовый блок
tr: Blok

source: MS name
ru: Название MS
tr: MS adı

source: MS Font
ru: Шрифт MS
tr: MS yazı tipi

source: Equivalent Unicode character name
ru: Эквивалентное имя символа Юникода
tr: Denk gelen Unicode karakter adı

source: Equivalent Unicode character hex value
ru: Эквивалентное шестнадцатиричное значение символа Юникода
tr: Denk gelen Unicode karakter onaltılık değeri

source: Equivalent Unicode character decimal value
ru: Эквивалентное десятичное значение символа Юникода
tr: Denk gelen Unicode karakter ondalık değeri

source: Symbol description
ru: Описание символа
tr: Sembol tanımı

source: Symbol description in user file ({lang})
ru: Описание символа в пользовательском файле ({lang})
tr: Kullanıcı dosyasındaki sembol tanımı ({lang})

source: Symbol description in locale file{langInfo}
ru: Описание символа в языковом файле{langInfo}
tr: Dil dosyasındaki simge tanımı{langInfo}

source: Symbol description in locale CLDR file{langInfo}
ru: Описание символа в языковом файле CLDR{langInfo}
tr: CLDR Dil dosyasındaki sembol tanımı{langInfo}

source: Symbol description in English file
ru: Описание символов в английском файле
tr: İngilizce dosyasında sembol tanımı

source: Symbol description in English CLDR file
ru: Описание символа в английском файле CLDR
tr: İngilizce CLDR dosyasında sembol tanımı

source: Character description
ru: Фонетическое описание символа
tr: Karakter tanımı

source: Character description{langInfo}
ru: Фонетическое описание символа {langInfo}
tr: Karakter tanımı{langInfo}

source: Character description (English file)
ru: Фонетическое описание символа в файле английского языка
tr: Karakter tanımı (İngilizce dosya)

source: Unicode
ru: Юникод

source: Microsoft font
ru: Шрифт Microsoft
tr: Microsoft yazı tipi

source: Symbol description in NVDA
ru: Описание символа в NVDA
tr: NVDA'daki sembol tanımı

source: Character description in NVDA
ru: Описание символа в NVDA
tr: NVDA'da karakter tanımı

source: No Block
ru: Блок отсутствует
tr: Blok Yok

source: On
ru: Включено
tr: Açık

source: Off
ru: Выключено
tr: Kapalı

source: Value
ru: Значение
tr: Değer

source: Character {numChar}
ru: Символ {numChar}
tr: Karakter {numChar}

source: Attribute
ru: Атрибут
tr: Özellik

source: Options used to compute the symbol:
ru: Параметры, используемые для вычисления символа:
tr: Sembol hesaplamak için kullanılan seçenekler:

source: Voice language
ru: Язык голоса
tr: Ses dili

source: NVDA interface language
ru: Язык NVDA
tr: NVDA arayüz dili

source: . Pressing four times presents a message with detailed information on this character.
ru: . При нажатии четыре раза появляется сообщение с подробной информацией об этом символе.
tr: . Dört kez basıldığında karakter hakkında detaylı bilgi gösterir.

source: Presents a message with detailed information on the character of the current navigator object where the review cursor is situated.
ru: Показывает сообщение с подробной информацией о символе текущего объекта навигатора, на котором находится просмотровый курсор.
tr: İnceleme imlecinin bulunduğu konumdaki nesne sunucusu karakteri hakkında ayrıntılı bilgi gösterir.

source: Presents a message with detailed information on the character at the position of the caret.
ru: Показывает сообщение с подробной информацией о символе под кареткой.
tr: Düzenleme imlecinin konumunda bulunan karakter hakkında ayrıntılı bilgi gösterir.

source: No caret
ru: Нет каретки
tr: Düzenleme imleci yok

source: Opens Character Information add-on settings
ru: Открывает настройки дополнения
tr: Karakter Bilgisi eklenti ayarlarını açar

source: Report the character
ru: Сообщить символ
tr: Karakteri bildirir

source: Report the character description
ru: Сообщить описание символа
tr: Karakter tanımını bildirir

source: Report the character number
ru: Сообщить номер символа
tr: Karakter numarasını bildirir

source: Display information on the character
ru: Показать информацию о символе
tr: Karakterle ilgili bilgileri görüntüler

source: Report the CLDR locale name of the character
ru: Сообщить название символа в соответствии с языковым стандартом CLDR
tr: Karakterin CLDR yerel dildeki adını bildirir

source: Report the CLDR English name of the character
ru: Сообщить английское название символа CLDR
tr: Karakterin CLDR İngilizce adını bildirir

source: Report the locale name of the character
ru: Сообщить языковое название символа
tr: Karakterin yerel dildeki adını bildirir

source: Report the English name of the character
ru: Сообщить английское название символа
tr: Karakterin İngilizce adını bildirir

source: Report Microsoft font proprietary character (name, font and equivalent Unicode name)
ru: Сообщить о проприетарном символе шрифта Microsoft (название, шрифт и эквивалентное название Юникода)
tr: Microsoft yazı tipinin özel karakterini bildirir (ad, yazı tipi ve eşdeğer Unicode adı)

source: Action for multiple presses of the report review character command
ru: Действие при многократном нажатии команды просмотра информации о символе
tr: Gözden geçirme karakteri bildirimi komutuna birden fazla basılması için eylem

source: Remember these action during character navigation
ru: Запомнить действия при навигации по символам
tr: Karakter gezintisi sırasında bu eylemleri hatırla

source: {n} presses:
ru: {n} нажатий:
tr: {n} defa basma:

source: Character information
ru: Информация о символе
tr: Karakter bilgisi

source: This add-on allows to present in a message various information about a character. It also allows to customize the information reported on a character when using review cursor character navigation commands or multiple presses of the review character command.
ru: Это дополнение позволяет отображать в сообщении различную информацию о символе. Оно также позволяет настраивать информацию, сообщаемую о символе, при использовании команд навигации по символам с помощью просмотрового курсора или многократного нажатия команды просмотра символов.
tr: Bu eklenti, bir mesajda bir karakter hakkında çeşitli bilgiler sunulmasına imkan verir. Ayrıca, gözden geçirme imleci karakter gezinme komutlarını kullanırken veya karakteri gözden geçir komutuna birden çok basıldığında bir karakter hakkında bildirilen bilgileri özelleştirmeye olanak tanır.
