Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/beepKeyboard/*/beepKeyboard.xliff
Languages: ru

source: Beep keyboard NVDA Add-on #
ru: Дополнение сигнал клавиатуры для NVDA #

source: This add-on allows the user to configure NVDA to beeps with some keyboard events.
ru: Это дополнение позволяет пользователю настроить NVDA на подачу звуковых сигналов при некоторых событиях с клавиатуры.

source: Copyright (C) 2019 David CM <dhf360@gmail.com>
ru: Авторское право (C) 2019 David CM <dhf360@gmail.com>

source: This package is distributed under the terms of the GNU General Public License, version 2 or later.
ru: Этот пакет распространяется в соответствии с условиями общей публичной лицензии GNU, версии 2 или позже.

source: Features
ru: Возможности

source: This add-on provides the following features you can use to adapt NVDA keyboard behavior:
ru: Это дополнение предоставляет следующие возможности, которые вы можете использовать для адаптации поведения NVDA с клавиатурой:

source: Beep for uppercases when caps lock is on: if this feature is enabled, NVDA will beep when you typing an uppercase and caps lock is on. Don't make any more uppercase mistakes!
ru: Звуковой сигнал для заглавных букв при включённом caps lock: если эта функция включена, NVDA будет подавать звуковой сигнал при вводе заглавных букв и включенной caps lock. Больше не допускайте ошибок в верхнем регистре!

source: Beep for typed characters when shift is pressed: with this feature NVDA will beep if you type a character with shift key pressed.
ru: Звуковой сигнал для вводимых символов при нажатой клавише shift: с помощью этой функции NVDA будет подавать звуковой сигнал, если вы вводите символ с нажатой клавишей shift.

source: Beep for toggle keys changes: with this feature, NVDA will beep higher if a toggle key goes on, and lower tone if it goes off. Please note that Windows has a toggle keis beep function built-in on Ease of Access Center. This native feature works well if you don't use laptop keyboard layout setting.
ru: Звуковой сигнал при изменении клавиш-переключателей: с помощью этой функции NVDA будет подавать более высокий звуковой сигнал при включении кнопки переключения и более низкий - при её выключении. Обратите внимание, что в Windows есть функция звукового сигнала при переключении клавиш, встроенная в Центр специальных возможностей. Эта встроенная функция хорошо работает, если вы не используете настройку раскладки клавиатуры ноутбука.

source: Announce toggle keys changes: just when "Beep for toggle keys changes" is on. You can enable or disable NVDA to announce toggle key status.
ru: Объявлять об изменениях клавиш-переключателей: сразу после включения функции "Звуковой сигнал для клавиш-переключателей". Вы можете включить или отключить NVDA для оповещения о состоянии клавиши-переключателя.

source: Beep for specified characters: NVDA will beep for all characters that you set in advanced settings.
ru: Звуковой сигнал для указанных символов: NVDA будет подавать звуковой сигнал для всех символов, которые вы задали в дополнительных настройках.

source: Disable beeping on password fields: this feature is enabled by default to aboid security risks. Disable it if you want to hear beeps on password fields.
ru: Отключить звуковые сигналы при вводе пароля: эта функция включена по умолчанию для предотвращения угроз безопасности. Отключите её, если вы хотите, чтобы при вводе пароля раздавались звуковые сигналы.

source: Requirements
ru: Требования

source: You need NVDA 2018.2 or later.
ru: Вам нужна NVDA 2018.2 или выше.

source: Installation
ru: Установка

source: Just install it as a NVDA add-on.
ru: Просто установите его как дополнение NVDA.

source: Usage
ru: Использование

source: To enable or disable features, go to NVDA settings and select beep keyboard category. In that category you can configure all supported features by this add-on.
ru: Чтобы включать или отключать возможности, перейдите в настройки NVDA и выберите категорию сигнала клавиатуры. В этой категории вы можете настроить все поддерживаемые функции этого дополнения.

source: "Beep for uppercases when caps lock is on" is enabled by default.
ru: "Звуковой сигнал для заглавных букв при включенном caps lock" включен по умолчанию.

source: If you need more settings, open the advanced settings dialog that contains the following options:
ru: Если вам нужны дополнительные настройки, откройте диалог дополнительных настроек, содержащий следующие параметры:

source: Ignored characters with shift pressed: all characters here will be ignored to beeping when shift is pressed. Escape Sequences are allowed, e.g. "\t" for tab, "\r" for carriage return.
ru: Игнорируемые символы при нажатой клавише shift: все введённые здесь символы будут игнорироваться, и при нажатии клавиши shift с ними сигнал не раздастся. Разрешены управляющие последовательности, например "\t" для табуляции, "\r" для возврата каретки.

source: Beep always for the following characters: set here all characters that you want NVDA beeps for. Escape Sequences are allowed, e.g. "\t" for tab, "\r" for carriage return.
ru: Звуковой сигнал всегда для следующих символов: укажите здесь все символы, для которых вы хотите, чтобы NVDA подавал звуковой сигнал. Разрешены управляющие последовательности, например "\t" для табуляции, "\r" для возврата каретки.

source: Select tone to configure: you can configure parameters for all tones. Select one here, and set the parameters in the next text boxes. When change selection, NVDA will beep for the current selected tone with the current parameters set in the dialog.
ru: Выберите тон для настройки: вы можете настроить параметры для всех тонов. Выберите один из них здесь и задайте параметры в следующих текстовых полях. При изменении выбранного тона NVDA подаст звуковой сигнал для текущего выбранного тона с текущими параметрами, установленными в диалоге.

source: Tone pitch: tone pitch for the current selected tone.
ru: Высота тона: высота тона для текущего выбранного тона.

source: Tone length: tone length for the current selected tone.
ru: Длительность тона: длительность тона для текущего выбранного тона.

source: Tone volume: tone volume for the current selected tone.
ru: Громкость тона: громкость тона для текущего выбранного тона.

source: Test tone: this button lets you to play a test with the current set parameters.
ru: Протестировать тон: эта кнопка позволяет воспроизвести тест с текущими заданными параметрами.

source: Press OK button to save settings or cancel to discard.
ru: Нажмите кнопку ОК, чтобы сохранить настройки, или отмену, чтобы отменить.
