Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/beepKeyboard/*/beepKeyboard.po
Languages: fi, ru, tr

source: Beep keyboard
fi: Näppäimistön merkkiääni
ru: Сигнал клавиатуры
tr: Sesli klavye

source: Beep for uppercases when &caps lock is on
fi: Ilmaise isot kirjaimet merkkiäänellä, kun &Caps Lock on käytössä
ru: Звуковой сигнал для заглавных букв при включённом &caps lock
tr: Capslock &açıkken büyük harf yazıldığında bip sesi çıkar

source: Beep for typed characters when &shift is pressed
fi: Ilmaise kirjoitetut merkit merkkiäänellä Va&ihto-näppäintä painettaessa
ru: Звуковой сигнал для вводимых символов при нажатой клавише &shift
tr: Shift &tuşu basılıyken karakter yazıldığında bip sesi çıkar

source: Beep for &toggle keys changes
fi: Ilmaise ti&lanvaihtonäppäinten muutokset merkkiäänellä
ru: Звуковой сигнал для клавиш-&переключателей
tr: Açılıp &kapanan tuşların durumu değiştiğinde bip sesi çıkar

source: &Announce toggle keys changes (if Beep for toggle keys changes is disabled NVDA will have the original behavior)
fi: &Puhu tilanvaihtonäppäinten muutokset (mikäli Ilmaise tilanvaihtonäppäinten muutokset merkkiäänellä ei ole käytössä, NVDA käyttäytyy alkuperäisellä tavalla)
ru: &Объявлять об изменениях клавиш-переключателей (если сигнал для изменения клавиш-переключателей отключен, NVDA будет вести себя как обычно)
tr: Açılıp k&apanan tuş değişikliklerini söyle (Açılıp kapanan tuşların durumu değiştiğinde bip sesi çıkar seçeneği devredışı bırakılırsa NVDA her zamanki gibi devam eder)

source: &disable beeping on password fields
fi: P&oista merkkiääni käytöstä salasanakentissä
ru: & отключить звуковой сигнал в полях ввода пароля
tr: Ş&ifre alanlarında bip sesi çıkarma

source: &Open advanced options
fi: &Avaa lisäasetukset
ru: &Открыть дополнительные параметры
tr: Gelişmiş seçenekleri aç

source: Advanced settings - Keyboard beep
fi: Lisäasetukset – Näppäimistön merkkiääni
ru: Дополнительные настройки - Сигнал клавиатуры
tr: Gelişmiş seçenekler - Klavye sesi

source: &Ignored characters with shift pressed
fi: O&hitettavat merkit Vaihto-näppäintä painettaessa
ru: &Игнорируемые символы при нажатой клавише shift
tr: S&hift tuşu basılıyken yoksayılacak karakterler

source: Beep &always for the following characters
fi: Ilmaise seuraavat merkit &aina merkkiäänellä
ru: Звуковой сигнал &всегда для следующих символов
tr: Ş&u karakterler yazıldığında her zaman bip sesi çıkar

source: &Select tone to configure
fi: Valit&se määritettävä merkkiääni
ru: &Выберите тон для настройки
tr: A&yarlamak için ses seçin

source: Typed characters with shift pressed
fi: Kirjoitetut merkit Vaihto-näppäintä painettaessa
ru: Вводимые символы с нажатой клавишей shift
tr: Shift tuşu basılıyken karakter yazıldı

source: Custom characters
fi: Mukautetut merkit
ru: Пользовательские символы
tr: Özgün karakterler

source: Typed characters when caps lock is on
fi: Kirjoitetut merkit, kun Caps Lock on käytössä
ru: Вводимые символы при включенном caps lock
tr: Capslock açıkken karakter yazıldı

source: Toggle key goes off
fi: Tilanvaihtonäppäin poistetaan käytöstä
ru: Клавиша-переключатель выключена
tr: Açılıp kapanan tuş kapandı

source: Toggle key goes on
fi: Tilanvaihtonäppäin otetaan käyttöön
ru: Клавиша-переключатель включена
tr: Açılıp kapanan tuş açıldı

source: Tone &pitch
fi: Merkkiäänen &korkeus
ru: &Высота тона
tr: S&es kalınlığı

source: Tone &length
fi: Merkkiäänen k&esto
ru: &Длительность тона
tr: Se&s uzunluğu

source: Tone &volume
fi: Merkkiäänen voi&makkuus
ru: &Громкость тона
tr: Ses y&üksekliği

source: &Test tone
fi: Testaa &ääntä
ru: &Протестировать тон
tr: Sesi tes&t et

source: You entered a wrong value. Please correct it or discard changes.
fi: Kirjoitit väärän arvon. Korjaa se tai hylkää muutokset.
ru: Вы ввели неверное значение. Пожалуйста, исправьте его или отмените изменения.
tr: Yanlış değer girdiniz. Düzeltin veya değişiklikleri iptal edin.

source: This add-on beeps with some keyboard events.
fi: Tämä lisäosa antaa merkkiäänen joillekin näppäimistön tapahtumille.
ru: Это дополнение подает звуковой сигнал при некоторых событиях на клавиатуре.
tr: Bu eklentiyle NVDA'nın bazı klavye durumları için ses çıkarması sağlanır.
