Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/mp3DirectCut/*/mp3DirectCut.xliff
Languages: tr

source: Author(s) : Abdel, Rémy, Abdellah zineddine, Jean-François COLAS
tr: Yazarlar: Abdel, Rémy, Abdellah Zinedine, Jean-François COLAS

source: Download [stable version][1]
tr: [Kararlı Sürümü İndirin][1]

source: Download [development version][2]
tr: [Geliştirici sürümünü indirin][2]

source: Presentation #
tr: Sunum #

source: This add-on improves the accessibility of the software mp3DirectCut with NVDA.
tr: Bu eklenti, NVDA ile mp3DirectCut yazılımının erişilebilirliğini iyileştirir.

source: It has been tested with versions of mp3DirectCut ranging from 212 up to 233.
tr: 212'den 223'e kadar olan mp3DirectCut sürümleriyle test edilmiştir.

source: Keyboard shortcuts ##
tr: Klavye kısayolları ##

source: This addon offers the following commands:
tr: Bu eklenti aşağıdaki komutları sunar:

source: Used to confirm correct placement of the marker of the beginning of the selection B.
tr: B seçiminin başlangıcındaki işaretçinin doğru yerleşimini onaylamak için kullanılır.

source: Used to indicate the position of the marker of the beginning of selection B.
tr: B seçiminin başlangıcındaki işaretçinin konumunu belirtmek için kullanılır.

source: Double pressure lets give you the duration of the selection.
tr: Çift basım, size seçim süresini vermeyi sağlar.

source: Gives the duration from the beginning of the file to the current position of the playback cursor.
tr: Dosyanın başlangıcından oynatma imlecinin geçerli konumuna kadar olan süreyi verir.

source: Double pressure lets give you the total duration.
tr: İki kez basıldığında size toplam süreyi verir.

source: Confirms that the selection has been canceled.
tr: Seçimin iptal edildiğini onaylar.

source: Gives the time remaining from the current position of the playback cursor to the end of the file.
tr: Oynatma imlecinin mevcut konumundan dosyanın sonuna kadar kalan süreyi verir.

source: Used to indicate the position of the marker of the end of selection N.
tr: N seçiminin sonundaki işaretçinin konumunu belirtmek için kullanılır.

source: Double pressure gives recapitulatif positions B and N, and the duration of the selection.
tr: İki kez basıldığında, özet B ve N konumlarını ve seçimin süresini verir.

source: Give the reference of the actual part and the total number of parts in the current file.
tr: Mevcut dosyadaki gerçek parçanın pozisyonunu ve toplam parça sayısını verir.

source: Ctrl+Shift+Space
tr: Ctrl+Shift+boşluk çubuğu

source: Used to determine the current level of the vu-meter, during recording.
tr: Kayıt sırasında vu-metrenin mevcut seviyesini belirlemek için kullanılır.

source: Double pressure reset it.
tr: İki kez basıldığında seviye sıfırlanır.

source: Down Arrow
tr: Aşağı ok

source: Lets you see the current position of the playhead.
tr: Oynatma üst bilgisinin geçerli konumunu görmenizi sağlar.

source: This command also position the cursor at the location of the marker of the end of selection N, while giving the location of this marker if a selection has been made.
tr: Bu komut ayrıca, bir seçim yapılmışsa bu işaretçinin konumunu verirken, imleci N seçiminin sonundaki işaretçinin konumuna da konumlandırır.

source: In the volume dialog box, vocalise the next value that can be reached generally with downArrow.
tr: Ses seviyesi iletişim kutusunda, genellikle aşağı ok ile ulaşılabilen bir sonraki değeri seslendirir.

source: This value is not vocalized default.
tr: Bu değer varsayılan olarak seslendirilmez.

source: Moves the playback cursor at the end of the current file and give the total time.
tr: Çalma imlecini geçerli dosyanın sonuna taşır ve toplam süreyi verir.

source: Moves the playback cursor at the beginning of the current file.
tr: Çalma imlecini geçerli dosyanın başına taşır.

source: Left Arrow
tr: Sol ok

source: Lets make a brief return back of one second during playback, while giving the current duration.
tr: Oynatma sırasında mevcut süreyi verirken bir saniyelik kısa bir geri dönüş yapmanızı sağlar.

source: This duration is configurable in the options of mp3directcut.
tr: Bu süre, Mp3DirectCut seçeneklerinde yapılandırılabilir.

source: Used to confirm correct placement of the marker of the end of the selection N.
tr: N seçiminin sonundaki işaretçinin doğru yerleşimini onaylamak için kullanılır.

source: Lets make a leap forward of 10 seconds during playback, while giving the current duration.
tr: Oynatma sırasında mevcut süreyi verirken ileri doğru 10 saniyelik bir sıçrama yapar.

source: This duration is configurable in the options of mp3directcut.
tr: Bu süre, Mp3DirectCut seçeneklerinde yapılandırılabilir.

source: Lets make a return back of 10 seconds during playback, while giving the current duration.
tr: Oynatma sırasında mevcut süreyi verirken 10 saniye geriye doğru sıçrama yapar.

source: This duration is configurable in the options of mp3directcut.
tr: Bu süre, Mp3DirectCut seçeneklerinde yapılandırılabilir.

source: Allows to prepare a record and whether you can press spacebar to start.
tr: Boşluk çubuğuna basarak başlayabileceğiniz kayıt hazırlık penceresini açmanızı sağlar.

source: Right Arrow
tr: Sağ ok

source: Lets do a brief forward of one second during playback, while giving the current duration.
tr: Oynatma sırasında mevcut süreyi verip parçayı bir saniye ileri sarar.

source: This duration is configurable in the options of mp3directcut.
tr: Bu süre, Mp3DirectCut seçeneklerinde yapılandırılabilir.

source: Ctrl+Right Arrow
tr: Ctrl+sağ ok

source: Moves to the next splitting point, while giving the current duration.
tr: Geçerli süreyi verip bir sonraki bölme noktasına gider.

source: Ctrl+Left Arrow
tr: Ctrl+Sol ok

source: Moves to the previous splitting point, while giving the current duration.
tr: Geçerli süreyi verip önceki bölme noktasına gider.

source: Shift+Right Arrow
tr: Shift+sağ ok

source: Lets do a brief forward of four hundredths of seconds during playback, while giving the current duration.
tr: Mevcut süreyi verip, oynatma sırasında saniyenin yüzde dördü kadar ileri sarar.

source: Shift+Left Arrow
tr: Shift+Sol ok

source: Lets do a brief backwards of four hundredths of seconds during playback, while giving the current duration.
tr: Oynatma sırasında mevcut süreyi verip saniyenin yüzde dördü kadar geri gider.

source: Used to stop the reading and give the current duration.
tr: Okumayı durdurmak ve mevcut süreyi vermek için kullanılır.

source: Space
tr: Boşluk çubuğu

source: If the recording is ready, start this recording.
tr: Kayıt hazırsa, bu kaydı başlatır.

source: If a recording is in progress, stop it by positioning the cursor at the beginning.
tr: Bir kayıt devam ediyorsa, imleci başa getirerek kaydı durdurur.

source: If a file is loaded, start the reading.
tr: Bir dosya yüklenmişse, okumaya başlatır.

source: If a read is in progress, allows to do a pause by giving current duration.
tr: Devam eden bir okuma varsa o anki süreyi vererek duraklama yapılmasını sağlar.

source: If read is paused, allows to restart the reading from the current location.
tr: Okuma duraklatılmışsa, okumanın geçerli konumdan yeniden başlatılmasını sağlar.

source: Up Arrow
tr: Yukarı Ok

source: Lets you see the current position of the playhead.
tr: Oynatma üst bilgisinin geçerli konumunu görmenizi sağlar.

source: This command also position the cursor at the location of the marker of the beginning of selection B, while giving the location of this marker if a selection has been made.
tr: Bu komut ayrıca, bir seçim yapılmışsa bu işaretçinin konumunu verirken, imleci B seçiminin başlangıcındaki işaretçinin konumunda konumlandırır.

source: In the volume dialog box, vocalise the previous value that can be reached generally with upArrow.
tr: Ses seviyesi iletişim kutusunda, genellikle yukarı ok ile ulaşılabilen bir önceki değeri seslendirir.

source: This value is not vocalized default.
tr: Bu değer varsayılan olarak seslendirilmez.

source: Lets open the help of the current add-on.
tr: Mevcut eklentinin yardımını açar.

source: Compatibility ##
tr: Uyumluluk ##

source: This add-on is compatible with the versions of NVDA ranging from 2019.3 and beyond.
tr: Bu eklenti, NVDA'nın 2019.3 ve sonrası sürümleriyle uyumludur.

source: Changes for 20231007.0.0 ##
tr: 20231007.0.0 için değişiklikler ##

source: After placing the cutting points and after opening the cutting properties window, with "Ctrl+N", adding accessibility to the title of this window by indicating the part index.
tr: Kesim noktaları yerleştirildikten ve kesim özellikleri penceresi açıldıktan sonra "Ctrl+N" ile bu pencerenin başlığına parça indeksi belirtilerek erişilebilirlik eklenir.

source: In reading mode, after moving the start or end markers of selections with keys 1 to 6 of the alphanumeric pad, addition of automatic start of reading from the new position;
tr: Okuma modunda, seçimlerin başlangıç ​​veya bitiş işaretlerini alfanümerik tuş takımının 1'den 6'ya kadar olan tuşlarıyla hareket ettirdikten sonra, yeni konumdan otomatik okuma başlangıcının eklenmesi;

source: Fixed a bug that occurred when consulting the remaining time with "control+shift+r" from the beginning of the track.
tr: Parçanın başlangıcından itibaren "control+shift+r" ile kalan süreye bakılırken oluşan bir hata düzeltildi.

source: Changes for 20230728.0.0 ##
tr: 20230728.0.0 için değişiklikler ##

source: Applied the flake8 and mypy rules to the code;
tr: Flake8 ve mypy kuralları koda uygulandı;

source: Changed the minimum supported NVDA version to 2019.3 to support annotations introduced in Python 3.
tr: Python 3'te tanıtılan ek açıklamaları desteklemek için desteklenen minimum NVDA sürümü 2019.3 olarak değiştirildi.

source: Changes for 20230607.0.0 ##
tr: 20230607.0.0 için değişiklikler ##

source: Added the following workflows:
tr: Aşağıdaki iş akışları eklendi:

source: auto-update-translations - to automatically update translations from NVDA's translation system.
tr: otomatik Güncelleme Çevirileri - NVDA'nın çeviri sisteminden çevirileri otomatik olarak güncellemek için.

source: release-on-tag..yaml: to build and publish the addon as soon as a new tag is pushed;
tr: release-on-tag..yaml: yeni bir etiket gönderilir gönderilmez eklentiyi oluşturmak ve yayınlamak;

source: manual-release.yaml: to build and release new versions of the add-on manually.
tr: manual-release.yaml: Eklentinin yeni sürümlerini manuel olarak oluşturmak ve yayınlamak.

source: Updated translations.
tr: Çeviriler güncellendi.

source: Changes for version 20230508.0.0 and beyond ##
tr: 20230508.0.0 ve sonrası sürümler için değişiklikler ##

source: • Changed version number, minimum NVDA version and download link according to store conventions/requirements.
tr: • Mağaza kurallarına/gereksinimlerine göre sürüm numarası, minimum NVDA sürümü ve indirme bağlantısı değiştirildi.

source: Change for version 20.12 ##
tr: 20.12 sürümü için değişiklikler ##

source: Stop speech during recording and reading for the latest versions of mp3directcut;
tr: En son Mp3DirectCut sürümleri için kayıt ve okuma sırasında konuşmayı durdurur;

source: Fixed reading remaining time for new versions of NVDA using Python 3.
tr: Python 3 kullanan yeni NVDA sürümleri için kalan okuma süresinin okunması sorunu düzeltildi.

source: Change for version 19.02 ##
tr: 19.02 sürümü için değişiklikler ##

source: Added the add-on's configuration in the settings panel available since nvda 2018.2;
tr: Eklenti yapılandırması, nvda 2018.2'den itibaren mevcut olan ayarlar paneline eklendi;

source: Changed version numbering using YY.MM (The year in 2 digits, followed by a dot, followed by the month in 2 digits);
tr: Yıl.ay kullanılarak değiştirilen sürüm numaralandırması. (2 basamaklı yıl, ardından nokta, ardından 2 basamaklı ay);

source: Added compatibility with the new versioning format of add-on, appeared since nvda 2019.1.
tr: Nvda 2019.1'den bu yana ortaya çıkan eklentinin yeni sürüm oluşturma biçimiyle uyumluluk eklendi.

source: Change for version 4.0 ##
tr: 4.0 sürümü için değişiklikler ##

source: Added the Compatibility of the add-on with both Python 2.7 and 3;
tr: Eklenti hem Python 2.7 hem de 3 ile uyumlu hale getirildi;

source: Fixed a bug with add-on paths that contain non-ASCII characters.
tr: ASCII olmayan karakterler içeren eklenti yollarıyla ilgili bir hata düzeltildi.

source: Change for version 3.0 ##
tr: 3.0 sürümü için değişiklikler ##

source: Used the gui.guiHelper module to ensure the correct appearance of the addon's configuration dialog;
tr: Eklentinin yapılandırma iletişim kutusunun doğru görünümünü sağlamak için gui.guiHelper modülünü kullandı;

source: Used format instead of %s for formatted strings;
tr: Biçimlendirilmiş stringler için %s yerine format kullanıldı;

source: Used compliance with guidelines for implementation.
tr: Uygulama yönergelerine uygunluk kullanıldı.

source: Change for version 2.3 ##
tr: 2.3 sürümü için değişiklikler ##

source: Added the GPL license to the addon;
tr: Eklentiye GPL lisansı eklendi;

source: Changed the shortcut of the script giving the end of selection from Ctrl + Shift + N to Ctrl + Shift + E because Ctrl + Shift + N doesn't work with the latest versions of mp3DirectCut;
tr: Ctrl + Shift + N, mp3DirectCut'un en son sürümleriyle çalışmadığından, sonuna dek seçmeyi sağlayan komut dosyasının kısayolu Ctrl + Shift + N'den Ctrl + Shift + E'ye değiştirildi;

source: Added a script to confirm that the selection has been canceled with 'Ctrl+r';
tr: Seçimin 'Ctrl+r' ile iptal edildiğini onaylamak için bir script eklendi;

source: Made some corrections in the code of the appModule 'mp3directcut.py'.
tr: AppModule 'mp3directcut.py' kodunda bazı düzeltmeler yapıldı.

source: Change for version 2.2 ##
tr: 2.2 sürümü için değişiklikler ##

source: Correction of the scripts giving the selection markers' locations.
tr: Seçim işaretçilerinin konumlarını veren script dosyalarının düzeltilmesi.

source: Change for version 2.1.1 ##
tr: 2.1.1 sürümü için değişiklikler ##

source: Removing the script giving the total time and adding this information to the script giving the elapsed time;
tr: Toplam süreyi veren script kaldırıldı ve bu bilgiler geçen süreyi veren scripte eklendi;

source: Added the ability to enable or disable the announcements related to the space key in the module's configuration options, separately from other announcements;
tr: Modülün yapılandırma seçeneklerinde boşluk tuşu ile ilgili duyuruları diğer duyurulardan ayrı olarak etkinleştirme veya devre dışı bırakma özelliği eklendi;

source: Added the ability to enable or disable the announcement of placement of the selection marqueures in the module's configuration options;
tr: Modülün yapılandırma seçeneklerinde seçim çerçevesinin yerleşim duyurusunu etkinleştirme veya devre dışı bırakma özelliği eklendi;

source: Adding the announcement of the current part when moving through the cutting points;
tr: Kesişim sınırlarından geçerken mevcut parçanın duyrulması eklendi;

source: Correction of announcements related to vertical keys;
tr: Dikey tuşlarla ilgili duyuruların düzeltilmesi;

source: Adding a script to open the help of the current add-on with 'NVDA+H';
tr: 'NVDA+H' ile mevcut eklentinin yardımını açmak için bir komut eklendi;

source: Displacement of the add-on's configuration menu from the Tools menu to the Preferences menu of NVDA.
tr: Eklentinin yapılandırma menüsünün Araçlar menüsünden NVDA'nın Tercihler menüsüne kaydırılması.

source: Change for version 2.1 ##
tr: 2.1 sürümü için değişiklikler ##

source: Adding a script to vocalize moving to the next splitting point with Control+Right Arrow;
tr: Kontrol+Sağ Ok ile sonraki bölme noktasına geçişi seslendirmek için bir script eklendi;

source: Adding a script to vocalize moving to the previous splitting point with Control+Left Arrow;
tr: Kontrol+Sol Ok ile önceki bölme noktasına geçişi seslendirmek için bir script eklendi;

source: Adding a script to vocalize the displacement of 4 hundredths of second ahead, with Shift+Right Arrow;
tr: Shift+Sağ Ok ile saniyenin yüzde 4'ü kadar ileri kaymayı seslendiren bir script eklendi;

source: Adding a script to vocalize the displacement of 4 hundredths of second back, with Shift+Left Arrow;
tr: Saniyenin yüzde dördü kadar geri kaymayı Shift+Sol Ok ile seslendiren bir komut eklendi;

source: Correction of the addon's summary from 'for mp3DirectCut' to 'mp3DirectCut'.
tr: Eklenti özetinin gösteriminin 'mp3DirectCut için'den 'mp3DirectCut'a düzeltildi.

source: Change for version 2.0 ##
tr: 2.0 sürümü için değişiklikler ##

source: Adding a script to know the remaining time with 'Control Shift R';
tr: 'Kontrol Shift R' ile kalan süreyi öğrenebilmek için bir komut eklendi;

source: Fixed reading durations including hours;
tr: Saatlerinde dahil edildiği okuma süreleri düzeltildi;

source: Added ability to differentiate thousandths or hundredths of seconds.
tr: Saniyenin binde birini veya yüzde birini ayırt etme yeteneği eklendi.

source: Change for version 1.1 ##
tr: 1.1 sürümü için değişiklikler ##

source: Added the ability to include the mp3DirectCut category into the Input Gestures;
tr: Girdi Hareketlerine mp3DirectCut kategorisini dahil etme yeteneği eklendi;

source: They will be visible only during use of the mp3DirectCut software.
tr: Yalnızca mp3DirectCut yazılımının kullanımı sırasında görünür olacaklardır.

source: Added the ability to enable or disable automatic messages, in the tools menu of NVDA, item 'mp3DirectCut configuration';
tr: NVDA'nın araçlar menüsünde 'mp3DirectCut konfigürasyonu' öğesinde otomatik mesajları etkinleştirme veya devre dışı bırakma özelliği eklendi;

source: Change for version 1.0 ##
tr: 1.0 sürümü için değişiklikler ##

source: Initial version.
tr: İlk sürüm.
