Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/mp3DirectCut/*/mp3DirectCut.po
Languages: ru

source: {0} addon configuration
ru: Настройки {0}

source: Allows you display the configuration dialog of {0} addon.
ru: Позволяет отобразить диалог настроек дополнения {0}.

source: Enable announcements of the space key
ru: Включить сообщения клавиши пробел

source: Announce the placement of the selection markers
ru: Сообщать о размещении маркеров выделения

source: Enable the other announces
ru: Включить другие сообщения

source: Configuration of the addon {0}
ru: Настройки дополнения {0}

source: hours
ru: часов

source: minutes
ru: минут

source: seconds
ru: секунд

source: hundredths
ru: сотых

source: thousandths
ru: тысячных

source: No selection
ru: Нет выделения

source: Beginning of the file.
ru: Начало файла.

source: End of the file.
ru: Конец файла.

source: Not file is loaded. Please check that you are in a file, open one with Control O, or R to start recording.
ru: Файл не загружен. Пожалуйста, убедитесь, что вы находитесь в меню "файл", откройте с помощью Control + O, или R, чтобы начать запись.

source: This command is not available in a recording mode, it is available only in a reading mode !
ru: Эта команда недоступна в режиме записи, она доступна только в режиме воспроизведения !

source: The marker of the beginning of selection B is at
ru: Маркер начала выделения B на

source: The marker of the End of selection N is at
ru: Маркер окончания выделения N на

source: The level of the vu-meter is at
ru: Уровень индикатора на

source: Total time:
ru: Общее время:

source: Duration of selection
ru: Продолжительность выделения

source: Actual part
ru: Фактическая часть

source: Selection not found.
ru: Выделение не найдено.

source: Information specific to the actual part is not available.
ru: Сведения, относящиеся к фактической части не имеются.

source: Please check that no selection has been made.
ru: Пожалуйста, убедитесь, что не сделано выделение.

source: Please chek that you are not in a recording mode.
ru: Пожалуйста убедитесь, что вы не в режиме записи.

source: The recording is ready ! It remains only to press spacebar for begin the recording. This same spacebar will stop the recording !
ru: Запись готова ! Остаётся лишь нажать клавишу пробела для начала. Этот же пробел остановит запись !

source: A recording is in progress, please press spacebar for stop it and start a new one.
ru: Идёт запись, пожалуйста, нажмите пробел, для её остановки и начните новую.

source: The recording is not ready !
ru: Запись не готова !

source: The vu-meter is not available. Please verify if a recording is in progress, and that the checkbox enable the margin button is checked in the options of {0}.
ru: Индикатор не доступен. Пожалуйста, проверьте, идёт ли запись, и что флажок "Кнопка 'Индикатор' доступна" отмечен в опциях для {0}.

source: The level of the vu-meter has been reset !
ru: Уровень индикатора был сброшен!

source: Start selection marker set.
ru: Выбран маркер начала выделения.

source: End selection marker set.
ru: Выбран маркер окончания выделения.

source: Selection canceled.
ru: Выделение отменено.

source: of
ru: из

source: Part
ru: Часть

source: No time remaining !
ru: Время закончилось !

source: Elapsed time:
ru: Прошло времени:

source: Gives the duration from the beginning of the file to the current position of the playback cursor. If pressed twice, gives the total duration.
ru: Предоставляет время от начала файла до текущей позиции курсора. Если нажать дважды, предоставляет общую продолжительность.

source: Remaining time:
ru: Оставшееся время:

source: Gives the time remaining from the current position of the playback cursor to the end of the file.
ru: Предоставляет время, оставшееся от текущей позиции курсора до конца файла.

source: Used to determine the current level of the vu-meter, during recording, double pressure reset it.
ru: Используется для определения текущего уровня 'запаса' во время записи. Двойное нажатие сбрасывает его.

source: Used to indicate the position of the marker of the beginning of selection B. Double pressure lets give you the duration of the selection.
ru: Используется для определения положения маркера начала выделения B. Двойное нажатие предоставляет время выделения.

source: Used to indicate the position of the marker of the end of selection N. Double pressure gives recapitulatif positions B and N, and the duration of the selection.
ru: Используется для определения положения маркера окончания выделения N. Двойное нажатие предоставляет обзор позиции B и N и длительность выделения.

source: Give the reference of the actual part and the total number of parts in the current file.
ru: Предоставляет ссылку на фактическую часть и общее количество частей в текущем файле.

source: Lets open the help of the current add-on.
ru: Позволяет открыть справку текущего дополнения.

source: some commands to use mp3directcut with NVDA
ru: некоторые команды использования mp3directcut с NVDA
