Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/readFeeds/*/readFeeds.po
Languages: pt_pt

source: Unable to refresh feed. Check your Internet conectivity or that the specified feed address is correct.
pt_pt: Não é possível atualizar o feed. Verifique a sua conetividade com a Internet ou se o endereço de feed especificado está correto.

source: Feeds copied
pt_pt: Feeds copiados

source: Folder not copied
pt_pt: Pasta Não copiada

source: Copy Error
pt_pt: Erro ao copiar

source: Feeds restored
pt_pt: RSS recuperados

source: &Filter by:
pt_pt: &Filtrar por:

source: List of &articles...
pt_pt: Lista de &artigos...

source: &Open feed
pt_pt: &Abrir alimentação

source: Open feed as &HTML
pt_pt: Abrir o feed como &HTML

source: Cop&y feed address
pt_pt: Endereço de alimentação Cop&y

source: &New...
pt_pt: &Novo...

source: &Delete...
pt_pt: &apagar...

source: S&et default
pt_pt: S&et por defeito

source: &Import feeds from OPML file...
pt_pt: &importar feeds do ficheiro OPML...

source: &Save feeds to OPML file...
pt_pt: &guardar feeds para ficheiro OPML...

source: &Preferences...
pt_pt: &Preferências.

source: Cannot add feed: %s
pt_pt: Não é possível adicionar um feed: %s

source: Error
pt_pt: Erro

source: Do you want to copy feed address to the clipboard? {}
pt_pt: Pretende copiar o endereço do feed para a área de transferência? {}

source: Copy feed address
pt_pt: Copiar endereço de alimentação

source: Address of a new feed:
pt_pt: Endereço de um novo feed:

source: New feed
pt_pt: Novo feed

source: Are you sure you want to delete this feed? This cannot be undone.
pt_pt: Tem a certeza de que pretende apagar este feed? Isto não pode ser anulado.

source: New name:
pt_pt: Novo nome:

source: Rename feed
pt_pt: Mudar o nome do feed

source: Open OPML file
pt_pt: Abrir ficheiro OPML

source: OPML files (*.opml)|*.opml
pt_pt: Ficheiros OPML (*.opml)|*.opml

source: Save As
pt_pt: Guardar como

source: List of articles
pt_pt: Lista de artigos

source: Unable to locate article title.
pt_pt: Não foi possível localizar o título do artigo.

source: Open &web page of selected article.
pt_pt: Abrir a página &Web do artigo seleccionado.

source: &About article...
pt_pt: &Sobre o artigo...

source: {} {} Do you want to copy article title and link to the clipboard?
pt_pt: {} {} Pretende copiar o título do artigo e a hiperligação para a área de transferência?

source: Article information
pt_pt: Informações sobre o artigo

source: &Search edit box after feeds list
pt_pt: &Caixa de edição de pesquisa após a lista de feeds

source: &Show articles Date
pt_pt: &Mostrar dados dos artigos

source: Unable to locate article link.
pt_pt: Não foi possível localizar a hiperligação do artigo.

source: Show date
pt_pt: Mostrar data

source: Show buttons to copy
pt_pt: Mostrar botões para copiar

source: Copy
pt_pt: Copiar

source: &Feeds...
pt_pt: &RSS.

source: Activates the Feeds dialog of Read Feeds.
pt_pt: Ativa a caixa de diálogo Feeds de Ler Feeds.

source: Shows the %s settings.
pt_pt: Mostra as definições %s.

source: Refreshes the current feed and announces the most recent article title.
pt_pt: Actualiza o feed atual e anuncia o título do artigo mais recente.

source: Announces the title of the current article. Pressed two times, copies title and related link to the clipboard.
pt_pt: Anuncia o título do artigo atual. Se premir duas vezes, copia o título e a hiperligação relacionada para a área de transferência.

source: Announces the title of the next article.
pt_pt: Anuncia o título do próximo artigo.

source: Announces the title of the previous article.
pt_pt: Anuncia o título do artigo anterior.

source: Announces article link, when pressed two times, opens related web page.
pt_pt: Anuncia o link do artigo, quando premido duas vezes, abre a página Web relacionada.

source: Copies title and related link of the current article to the clipboard.
pt_pt: Copia o título e o link relacionado do artigo atual para a área de transferência.

source: Read Feeds
pt_pt: Ler feeds

source: Add-on for using NVDA as a feed reader.
pt_pt: Complemento para utilizar o NVDA como leitor de feeds.
