Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/readFeeds/*/readFeeds.xliff
Languages: ru, tr

source: Read Feeds #
ru: Читатель Каналов #
tr: Akışları Oku #

source: Authors: Noelia Ruiz Martínez, Mesar Hameed
ru: Авторы: Noelia Ruiz Martínez, Mesar Hameed
tr: Yazarlar: Noelia Ruiz Martínez, Mesar Hameed

source: This addon provides a straightforward way to read feeds in Atom or RSS formats using NVDA.
ru: Это дополнение обеспечивает простой способ читать новости формата Atom или RSS, используя NVDA.
tr: Bu eklenti NVDA kullanarak Atom veya RSS biçiminde akışları okumak için basit bir yol sunar.

source: The feeds will not be refreshed automatically.
ru: Новостные каналы не будут обновляться автоматически.
tr: Akışlar otomatik olarak yenilenmeyecektir.

source: Below when we mention feeds, we mean both RSS and ATOM feeds.
ru: Ниже, когда мы упоминаем новостные каналы, мы имеем в виду как RSS, так и ATOM каналы.
tr: Aşağıda akışlardan bahsettiğimizde, hem RSS hem de ATOM akışlarını kastediyoruz.

source: Commands ##
ru: Команды ##
tr: Komutlar ##

source: Read Feeds dialog ###
ru: Диалог Чтение Новостей ###
tr: Akışları Oku iletişim kutusu ###

source: You can access the Read Feeds dialog from the nvda menu, Tools submenu, Feeds item.
ru: Вы можете получить доступ к диалогу чтения новостных каналов из меню nvda, подменю сервиса, пункта новостных каналов.
tr: Akışları Oku iletişim kutusuna nvda menüsü, Araçlar alt menüsü, akış listesi öğesinden erişebilirsiniz.

source: It contains the following controls:
ru: Он содержит следующие элементы управления:
tr: Aşağıdaki kontrolleri içerir:

source: Filter by: An edit box to search previously saved feeds.
ru: Фильтр по: поле редактирования для поиска ранее сохранённых новостных каналов.
tr: Filtreleme kriteri: Önceden kaydedilmiş beslemeleri aramak için bir düzenleme kutusu.

source: A list of the saved feeds, focused when the dialog is opened.
ru: В фокусе будет список сохраненных каналов, отображаемый при открытии диалога.
tr: İletişim kutusu açıldığında odaklanılan kayıtlı akışların listesi.

source: List of articles: Opens a dialog which presents the articles list from your current feed. Select the article you want to read and press Enter or Open web page of selected article button to open the corresponding page in your browser. Press About article button to open a dialog showing title and link of the selected article; from this dialog, you'll be able to copy this info to the clipboard.
ru: Список статей: Открывает диалог, в котором представлен список статей из вашего текущего канала. Выберите статью, которую вы хотите прочитать, и нажмите Enter или кнопку Открыть веб-страницу выбранной статьи, чтобы открыть соответствующую страницу в вашем браузере. Нажмите кнопку "О статье", чтобы открыть диалог с названием и ссылкой на выбранную статью; из этого диалога вы сможете скопировать эту информацию в буфер обмена.
tr: Makale listesi: Mevcut akışınızdaki makalelerin listesini sunan bir iletişim kutusu açar. Okumak istediğiniz makaleyi seçin ve ilgili sayfayı tarayıcınızda açmak için Enter veya Seçilen makalenin web sayfasını aç düğmesine basın. Seçilen makalenin başlığını ve bağlantısını gösteren bir iletişim kutusu açmak için Makale hakkında düğmesine basın; bu iletişim kutusundan, bu bilgiyi panoya kopyalayabilirsiniz.

source: Open feed: Opens the selected feed in the default application.
ru: Открыть новостной канал: Открывает выбранный новостной канал в приложении по умолчанию.
tr: Akışı aç: Seçili akışı varsayılan uygulamada açar.

source: Open feed as HTML: Opens the selected feed in the default web browser. You will be able to show or hide publication dates and buttons to copy information about articles to clipboard.
ru: Открыть новостной канал как HTML: открывает выбранный канал в веб-браузере по умолчанию. Вы сможете отображать или скрывать даты публикации и кнопки для копирования информации о статьях в буфер обмена.
tr: Akışı HTML olarak aç: Seçili akışı varsayılan web tarayıcısında açar. Makaleler hakkındaki bilgileri panoya kopyalamak için yayın tarihlerini ve düğmeleri gösterip gizleyebileceksiniz.

source: Copy feed address: Opens a dialog to confirm if you want to copy the feed address to clipboard.
ru: Копировать адрес канала: Открывает диалог для подтверждения того, хотите ли вы скопировать адрес канала в буфер обмена.
tr: Akış adresini kopyala: Akış adresini panoya kopyalamak isteyip istemediğinizi onaylamak için bir iletişim kutusu açar.

source: New: Opens a dialog with an edit box to enter the address of a new feed. If the address is valid and the feed can be saved, its name, based on the feed title, will appear at the bottom of the feeds list.
ru: Новый: открывает диалог с полем редактирования, где можно ввести адрес нового канала. Если адрес действителен и новостной канал может быть сохранён, его имя появится в низу списка новостных каналов, исходя из названия канала.
tr: Yeni: Yeni bir akışın adresini girmek için bir düzenleme kutusu içeren bir iletişim kutusu açar. Adres geçerliyse ve yayın kaydedilebilirse, yayın başlığına göre adı, yayın listesinin içinde görünecektir.

source: Rename: Opens a dialog with an edit box to rename the selected feed.
ru: Переименовать: открывает диалог с полем редактирования для переименования выбранного новостного канала.
tr: Yeniden Adlandır: Seçili akışı yeniden adlandırmak için bir düzenleme kutusu içeren bir iletişim kutusu açar.

source: Delete: Opens a dialog to delete the selected feed after confirmation.
ru: Удалить: открывает диалог для удаления выбранного канала после подтверждения.
tr: Sil: Onaydan sonra seçilen akışın silinmesi için bir iletişim kutusu açar.

source: Set default: Sets the selected feed as the default, so that its articles can be accessed with NVDA's gestures.
ru: Установить по умолчанию: устанавливает выбранный канал по умолчанию, и его статьи могут быть доступны с помощью жестов NVDA.
tr: Varsayılan olarak ayarla: Seçilen beslemeyi varsayılan olarak ayarlar, böylece makalelerine ilgili NVDA girdi hareketleriyle erişilebilir.

source: Import feeds from OPML file: Opens a dialog to add new feeds from an OPML file.
ru: Импорт новостных каналов из файла OPML: Открывает диалог для добавления новых каналов из файла OPML.
tr: OPML dosyasından akışları içe aktar: Bir OPML dosyasından yeni akışlar eklemek için bir iletişim kutusu açar.

source: Save feeds to OPML file: Opens a dialog to save the feeds available from the Feeds dialog in an OPML file.
ru: Сохранить новостные каналы в файл OPML: Открывает диалог для сохранения каналов, доступных в диалоге новостных каналов, в файл OPML.
tr: Akışları OPML dosyasına kaydet: Akışlar iletişim kutusunda bulunan beslemeleri bir OPML dosyasına kaydetmek için bir iletişim kutusu açar.

source: Preferences: Opens the settings dialog for readFeeds, also available in NVDA's menu, Preferences, settings, readFeeds category.
ru: Настройки: Открывает диалог настроек для readFeeds, также доступное в меню NVDA, настройках, категории readFeeds.
tr: Tercihler: NVDA menüsünde Tercihler, ayarlar, Akışları oku kategorisinde de bulunan akışları oku için ayarlar diyalog penceresini açar.

source: Close: Closes the Feeds dialog.
ru: Закрыть: закрывает диалог новостных каналов.
tr: Kapat: Akışlar iletişim kutusunu kapatır.

source: Notes #####
ru: Примечания #####
tr: Notlar #####

source: The Filter by edit box can be placed after the Open article button from NVDA's menu, Preferences, Settings, Read feeds category, or pressing the Preferences button of the Feeds dialog.
ru: Поле редактирования фильтра можно установить после кнопки открытия статьи в меню NVDA, параметры, настройки, категория читателя каналов или нажав кнопку настроек в диалоге новостных каналов.
tr: Filtreye göre düzenleme kutusu NVDA menüsünden Tercihler, Ayarlar, Akışları oku kategorisinden veya akışlar iletişim kutusundaki Tercihler düğmesine basarak Makaleyi aç düğmesinden sonra yerleştirilebilir.

source: This panel has an option to show article dates on the List of articles dialog.
ru: На этой панели есть возможность отображать даты статей в диалоге списка статей.
tr: Bu panel, Makalelerin listesi iletişim kutusunda makale tarihlerini gösterme seçeneğine sahiptir.

source: Keyboard commands ###
ru: Клавишные команды ###
tr: Klavye komutları ###

source: Ctrl+Shift+NVDA+Space: Announces current article's URL. Pressing twice will open the web page.
ru: Ctrl+Shift+NVDA+Пробел: Объявляет URL текущей статьи. Двойное нажатие откроет веб-страницу.
tr: Ctrl+Shift+NVDA+Boşluk çubuğu: Mevcut makalenin URL'sini duyurur. İki kez basmak web sayfasını açacaktır.

source: Ctrl+Shift+NVDA+8: Refreshes the selected feed and announces its most recent title.
ru: Ctrl+Shift+NVDA+8: Обновляет выбранную новостную ленту и объявляет своё последнее название.
tr: Ctrl+Shift+NVDA+8: Seçili akışı yeniler ve en son başlığı duyurur.

source: Ctrl+Shift+NVDA+I: Announces current feed title and link. Pressing twice will copy the title and related link to clipboard.
ru: Ctrl+Shift+NVDA+I: Объявляет название и ссылку текущей новостной ленты. Двойное нажатие скопирует название и соответствующую ссылку в буфер обмена.
tr: Ctrl+Shift+NVDA+I: Mevcut akış başlığını ve bağlantısını duyurur. İki kez basmak, başlığı ve ilgili bağlantıyı panoya kopyalayacaktır.

source: Ctrl+Shift+NVDA+U: Announces previous feed title.
ru: Ctrl+Shift+NVDA+U: Объявляет название предыдущей новостной ленты.
tr: Ctrl+Shift+NVDA+U: Önceki akış başlığını duyurur.

source: Ctrl+Shift+NVDA+O: Announces next feed title.
ru: Ctrl+Shift+NVDA+O: Объявляет название следующей новостной ленты.
tr: Ctrl+Shift+NVDA+O: Sonraki akış başlığını duyurur.

source: Notifications ##
ru: Оповещения ##
tr: Bildirimler ##

source: When the title or URL have been copied.
ru: Когда название или URL были скопированы.
tr: Başlık veya URL kopyalandığında.

source: When unable to connect/refresh a feed, or the URL does not correspond to a valid feed.
ru: Когда не удается подключить/обновить ленту, или URL-адрес не соответствует допустимой новостной ленте.
tr: Bir akışa bağlanılamadığında/yenileme yapılamadığında veya URL, geçerli bir akışa karşılık gelmediğinde.

source: NVDA will display an error message if a new feed cannot be created.
ru: NVDA отобразит сообщение об ошибке, если новый канал не может быть создан.
tr: Yeni bir akış oluşturulamıyorsa NVDA bir hata mesajı görüntüler.

source: The title of the articles list dialog displays the selected feed name and number of items available.
ru: Диалог с названием списка статей отображает имя выбранной новостной ленты с количеством доступных элементов.
tr: Makale listesi iletişim kutusunun başlığı, seçilen akış adını ve mevcut öğelerin sayısını gösterir.

source: Changes for 39.0.0
ru: Изменения для 39.0.0
tr: 39.0.0 İçin değişiklikler

source: Improved notifications when title or URL are copied.
ru: Улучшены уведомления, когда название или URL были скопированы.
tr: Başlık veya URL kopyalandığında geliştirilmiş bildirimler.

source: Changes for 34.0.0
ru: Изменения для 34.0.0
tr: 34.0.0 İçin değişiklikler

source: Added support for rss.cbc.ca feeds.
ru: Добавлена поддержка каналов rss.cbc.ca.
tr: Rss.cbc.ca akışları için destek eklendi.

source: Changes for 21.0
ru: Изменения для 21.0
tr: 21.0 İçin değişiklikler

source: Feeds with untitled articles can be presented in the Articles dialog, and opened as HTML.
ru: Ленты со статьями без названия могут быть представлены в диалоге статей и открыты в формате HTML.
tr: Başlıksız makaleler içeren akışlar, Makaleler iletişim kutusunda sunulabilir ve HTML olarak açılabilir.

source: Changes for 20.0
ru: Изменения для 20.0
tr: 20.0 İçin değişiklikler

source: universalFeedParser is updated to 5.0.1, adding support for more feeds.
ru: universalFeedParser обновлен до версии 5.0.1, добавлена поддержка большего количества каналов.
tr: universalFeedParser, 5.0.1'e güncellendi ve daha fazla akış için destek eklendi.

source: Changes for 15.0
ru: Изменения для 15.0
tr: 15.0 İçin değişiklikler

source: Compatible with NVDA 2023.1.
ru: Совместимость с NVDA 2023.1.
tr: NVDA 2023.1 ile uyumlu.

source: Changes for 14.0
ru: Изменения для 14.0
tr: 14.0 İçin değişiklikler

source: Fixed a bug that made impossible to add some feeds.
ru: Исправлена ошибка, из-за которой было невозможно добавлять некоторые каналы.
tr: Bazı yayınların eklenmesini imkansız kılan bir hata düzeltildi.

source: Changes for 13.0
ru: Изменения для 13.0
tr: 13.0 İçin değişiklikler

source: The add-on cannot be used on secure screens.
ru: Дополнение нельзя использовать на защищённых экранах.
tr: Eklenti, güvenli ekranlarda kullanılamaz.

source: Feeds are managed from OPML files.
ru: Новостные ленты управляются из файлов OPML.
tr: Yayınlar, OPML dosyalarından yönetilir.

source: Due to changes in the feeds management system, there are changes in the configuration file where the default feed is set. Please, use the Feeds dialog if you want to set it again.
ru: В связи с изменениями в системе управления лентами, в конфигурационный файл, в котором установлен канал по умолчанию, внесены изменения. Пожалуйста, воспользуйтесь диалогом новостных лент, если вы хотите настроить его снова.
tr: Akış yönetim sistemindeki değişiklikler nedeniyle, varsayılan akışın ayarlandığı yapılandırma dosyasında değişiklikler vardır. Tekrar ayarlamak istiyorsanız lütfen akışlar iletişim kutusunu kullanın.

source: Your old text files used in previous versions will be automatically imported into the new OPML format when the add-on is started.
ru: Ваши старые текстовые файлы, использовавшиеся в предыдущих версиях, будут автоматически импортированы в новый формат OPML при запуске дополнения.
tr: Önceki sürümlerde kullanılan eski metin dosyalarınız, eklenti başlatıldığında otomatik olarak yeni OPML biçimine aktarılacaktır.

source: The copy and restore feeds feature has been replaced with the ability to import from and save to OPML files.
ru: Функция копирования и восстановления каналов была заменена возможностью импорта из файлов OPML и сохранения в них.
tr: Akışları kopyala ve geri yükle özelliği, OPML dosyalarından içe aktarma ve kaydetme özelliğiyle değiştirildi.

source: Non well-formed feeds can be processed before being added to make them compatible with the add-on.
ru: Некондиционные ленты можно обработать перед добавлением, чтобы сделать их совместимыми с дополнением.
tr: İyi biçimlendirilmemiş akış adresleri , eklentiyle uyumlu hale getirilmeleri için eklenmeden önce işlenebilir.

source: In the Read Feeds settings panel, a new option allows to show article dates on the List of articles dialog.
ru: На панели настроек каналов чтения появилась новая опция, позволяющая отображать даты статей в диалоге списка статей.
tr: Akışları oku ayarları panelinde yeni bir seçenek, makale tarihlerinin Makale listesi iletişim kutusunda gösterilmesine olanak tanır.

source: Changes for 12.0
ru: Изменения для 12.0
tr: 12.0 İçin değişiklikler

source: Fixed a bug which made shortcuts for items of NVDA's tools menu don't work as expected.
ru: Исправлена ошибка, из-за которой ярлыки для элементов меню сервисов NVDA работали не так, как ожидалось.
tr: NVDA'nın araçlar menüsündeki öğeler için kısayolların beklendiği gibi çalışmamasına neden olan bir hata düzeltildi.

source: Changes for 11.0
ru: Изменения для 11.0
tr: 11.0 İçin değişiklikler

source: Compatible with NVDA 2021.1
ru: Совместимость с NVDA 2021.1
tr: NVDA 2021.1 ile uyumlu

source: Changes for 10.0 ##
ru: Изменения для 10.0 ##
tr: 10.0 İçin değişiklikler ##

source: Added a button to open the selected feed as HTML in the default web browser.
ru: Добавлена кнопка для открытия выбранной ленты в формате HTML в веб-браузере по умолчанию.
tr: Varsayılan web tarayıcısında seçilen akışı HTML olarak açmak için bir düğme eklendi.

source: If a new feed cannot be created, this will be notified in an error dialog.
ru: Если новая новостная лента не может быть создана, об этом будет сообщено в диалоге с сообщением об ошибке.
tr: Yeni bir akış oluşturulamıyorsa, bu durum bir hata iletişim kutusunda bildirilecektir.

source: Improved order and presentation of some articles.
ru: Улучшен порядок и представление некоторых статей.
tr: Bazı makalelerin düzeni ve sunumunda iyileştirme.

source: More feeds may be supported.
ru: Возможно, будут поддерживаться дополнительные новостные ленты.
tr: Daha fazla akış desteklenebilir.

source: When the feeds dialog is opened, the list of feeds will be focused instead of the search edit box.
ru: Когда откроется диалог новостных каналов, в центре внимания будет список каналов, а не поле редактирования поиска.
tr: Akışlar iletişim kutusu açıldığında, arama düzenleme kutusu yerine yayınların listesine odaklanılacaktır.

source: You can choose if the search edit box is placed after the list of feeds, useful to focus the list even when switching from another window without closing the Feeds dialog.
ru: Вы можете выбрать, размещать ли поле редактирования поиска после списка каналов, что полезно для фокусировки на списке даже при переключении из другого окна, не закрывая диалог новостных лент.
tr: Arama düzenleme kutusunun akış listesinden sonra yerleştirilip yerleştirilmeyeceğini seçebilirsiniz; bu, akışlar iletişim kutusunu kapatmadan başka bir pencereden geçiş yaparken bile listeye odaklanmak için yararlı olabilir.

source: Added a button to copy the feed address to clipboard from the feeds dialog.
ru: Добавлена кнопка для копирования адреса канала в буфер обмена из диалога каналов.
tr: Akış iletişim kutusundan akış adresini panoya kopyalamak için bir düğme eklendi.

source: Changes for 9.0 ##
ru: Изменения для 9.0 ##
tr: 9.0 İçin değişiklikler ##

source: Requires NVDA 2019.3 or later.
ru: Требуется NVDA 2019.3 или позже.
tr: NVDA 2019.3 veya sonraki bir sürümünü gerektirir.

source: Changes for 8.0 ##
ru: Изменения для 8.0 ##
tr: 8.0 İçin değişiklikler ##

source: When the add-on is updated, feeds saved in the previous version of the add-on will be automatically copied to the new version, unless you prefer to import feeds saved in the main configuration folder of NVDA.
ru: При обновлении дополнения каналы, сохранённые в предыдущей версии дополнения, будут автоматически скопированы в новую версию, если только вы не предпочитаете импортировать каналы, сохранённые в главной папке конфигурации NVDA.
tr: Eklenti güncellendiğinde, NVDA'nın ana yapılandırma klasörüne kaydedilen akışları içe aktarmayı tercih etmediğiniz sürece, eklentinin önceki sürümünde kaydedilen akışlar otomatik olarak yeni sürüme kopyalanacaktır.

source: When using the dialog to copy feeds, if the chosen folder is not named personalFeeds, a subfolder with this name will be created to prevent the deletion of directories containing important data, such as Documents or Downloads.
ru: При использовании диалога для копирования новостных каналов, если выбранная папка не имеет имени personalFeeds, будет создана подпапка с таким именем, чтобы предотвратить удаление каталогов, содержащих важные данные, такие как документы или загрузки.
tr: Akışları kopyalamak için iletişim kutusunu kullanırken, seçilen klasörün adı personalFeeds değilse, Belgeler veya İndirilenler gibi önemli verileri içeren dizinlerin silinmesini önlemek için bu ada sahip bir alt klasör oluşturulacaktır.

source: Changes for 7.0 ##
ru: Изменения для 7.0 ##
tr: 7.0 İçin değişiklikler ##

source: The Feeds dialog includes a button to open a folder which may contain a backup of feeds.
ru: В диалоге новостных лент есть кнопка для открытия папки, которая может содержать резервную копию каналов.
tr: Akışlar iletişim kutusu, akışların yedeğini içerebilecek bir klasörü açmak için bir düğme içerir.

source: When using the edit box to filter feeds, if no results are found, the list of feeds and other controls are disabled, so that NVDA doesn't report "unknown" in the empty list.
ru: При использовании поля редактирования для фильтрации каналов, если результаты не найдены, список каналов и другие элементы управления отключаются, чтобы NVDA не сообщала "неизвестно" в пустом списке.
tr: Yayınları filtrelemek için düzenleme kutusunu kullanırken, hiçbir sonuç bulunmazsa, yayınların listesi ve diğer kontroller devre dışı bırakılır, böylece NVDA boş listede "bilinmeyen" demez.

source: If the list of articles dialog can't be shown, for example due to errors in the feed, NVDA will raise an error, so that the feeds dialog can be used without restarting NVDA.
ru: Если диалог списка статей не может быть отображён, например, из-за ошибок в ленте, NVDA выдаст сообщение об ошибке, так что диалог лент можно будет использовать без перезапуска NVDA.
tr: Makaleler listesi iletişim kutusu, örneğin akıştaki hatalar nedeniyle gösterilemiyorsa, NVDA bir hata oluşturur, böylece akışlar iletişim kutusu NVDA'yı yeniden başlatmadan kullanılabilir.

source: Changes for 6.0 ##
ru: Изменения для 6.0 ##
tr: 6.0 İçin değişiklikler ##

source: When the default feed has been updated and it stops working due to server issues, the previous articles aren't deleted and can be read with the corresponding keystrokes.
ru: Когда лента новостей по умолчанию обновляется и перестаёт работать из-за проблем с сервером, предыдущие статьи не удаляются и могут быть прочитаны с помощью соответствующих нажатий клавиш.
tr: Varsayılan akış güncellendiğinde ve sunucu sorunları nedeniyle çalışmayı durdurduğunda, önceki makaleler silinmez ve ilgili tuşlarla okunabilir.

source: Fix regression: The default feed can be updated twice again.
ru: Исправлена регрессия: лента данных по умолчанию может быть обновлена ещё дважды.
tr: Gerileme düzeltmesi: Varsayılan besleme iki kez tekrar güncellenebilir.

source: Changes for 5.0 ##
ru: Изменения для 5.0 ##
tr: 5.0 İçin değişiklikler ##

source: The articles list dialog has been enhanced.
ru: Улучшен диалог со списком статей.
tr: Makaleler listesi iletişim kutusu geliştirildi.

source: Compatible with NVDA 2018.3 or later (required).
ru: Совместимо с NVDA 2018.3 или позднее (обязательно).
tr: NVDA 2018.3 veya üstü ile uyumlu (gerekli).

source: Changes for 4.0 ##
ru: Изменения для 4.0 ##
tr: 4.0 İçin değişiklikler ##

source: Added a button to open the selected feed from the Feeds dialog.
ru: Добавлена кнопка открытия новостной ленты в диалоге новостных лент.
tr: Akışlar iletişim kutusundan seçilen akışı açmak için bir düğme eklendi.

source: Changes for 3.0 ##
ru: Изменения для 3.0 ##
tr: 3.0 İçin değişiklikler ##

source: The dialogs to manage feed files have been removed. Now their functionality is included in the Feeds dialog.
ru: Диалоги управления файлами лент были удалены. Сейчас их функциональность вошла в диалог новостных лент.
tr: Akış dosyalarını yönetmek için kullanılan iletişim kutuları kaldırıldı. Artık işlevleri akışlar iletişim kutusuna dahil edildi.

source: The visual presentation of the dialogs has been enhanced, adhering to the appearance of the dialogs shown in NVDA.
ru: Визуальное представление диалогов было модифицировано, придерживаясь внешнего вида диалогов, отображаемых в NVDA.
tr: NVDA'da gösterilen iletişim kutularının görünümüne bağlı kalınarak iletişim kutularının görsel sunumu geliştirildi.

source: The default feed is saved on the NVDA's configuration. Therefore, it's possible to set different default feeds in configuration profiles.
ru: Новостная лента по умолчанию сохраняется в конфигурации NVDA. Таким образом, можно установить различные новостные ленты по умолчанию в различных профилях конфигурации.
tr: Varsayılan akış, NVDA'nın yapılandırmasına kaydedilir. Dolayısıyla, yapılandırma profillerinde farklı varsayılan akışlar ayarlamak mümkündür.

source: Requires NVDA 2016.4.
ru: Требуется NVDA 2016.4.
tr: NVDA 2016.4 gerektirir.

source: Changes for 2.0 ##
ru: Изменения для 2.0 ##
tr: 2.0 İçin değişiklikler ##
