Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/readFeeds/*/readFeeds.xliff
Languages: ru, tr

source: Add-on help is available from the Add-ons Manager.
ru: Справка дополнения доступна в диспетчере дополнений.
tr: Eklenti yardımına, Eklenti Yöneticisi'nden ulaşılabilir.

source: Changes for 1.0 ##
ru: Изменения для 1.0 ##
tr: 1.0 İçin değişiklikler ##

source: Initial version.
ru: Первоначальная версия.
tr: İlk sürüm.
