Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/rdAccess/*/rdAccess.xliff
Languages: pt_pt, ru, tr

source: This option is enabled by default. It is strongly encouraged to leave this option enabled if the Remote Desktop server has no audio output.
pt_pt: Esta opção está activada por predefinição. Recomenda-se vivamente que deixe esta opção activada se o servidor de Ambiente de Trabalho Remoto não tiver saída de áudio.
ru: Эта опция включена по умолчанию. Настоятельно рекомендуется оставить эту опцию включённой, если на сервере удалённого рабочего стола нет аудиовыхода.
tr: Bu seçenek varsayılan olarak etkindir. Uzak Masaüstü sunucusunda ses çıkışı yoksa, bu seçeneği etkin bırakmanız kesinlikle önerilir.

source: Allow Remote System to Control Driver Settings
pt_pt: Permitir que o sistema remoto controle as definições do condutor
ru: Разрешить удалённой системе управлять настройками драйвера
tr: Uzak Sistemin Sürücü Ayarlarını Kontrol Etmesine İzin Ver

source: When enabled in the client, this option allows you to control driver settings (such as synthesizer voice and pitch) from the remote system. Changes made on the remote system will automatically reflect locally.
pt_pt: Quando activada no cliente, esta opção permite-lhe controlar as definições do controlador (como a voz e o tom do sintetizador) a partir do sistema remoto. As alterações efectuadas no sistema remoto serão automaticamente reflectidas localmente.
ru: Если эта опция включена, она позволяет управлять настройками драйвера (например, голосом и высотой тона синтезатора) из удалённой системы. Изменения, внесённые в удалённую систему, будут автоматически отражены на локальном компьютере.
tr: İstemcide etkinleştirildiğinde, bu seçenek sürücü ayarlarını (sentezleyici sesi ve perdesi gibi) uzak sistemden kontrol etmenizi sağlar. Uzak sistemde yapılan değişiklikler otomatik şekilde yerel olarak yansıtılacaktır.

source: Persist Client Support When Exiting NVDA
pt_pt: Persistir o suporte ao cliente ao sair do NVDA
ru: Сохранять постоянную поддержку клиента при выходе из NVDA
tr: NVDA kapatıldığında istemci desteğini sürdür

source: This client option, available on installed copies of NVDA, ensures that the client portion of NVDA is loaded in your remote desktop client even when NVDA is not running.
pt_pt: Esta opção de cliente, disponível em cópias instaladas do NVDA, garante que a parte do cliente do NVDA é carregada no seu cliente de ambiente de trabalho remoto, mesmo quando o NVDA não está a ser executado.
ru: Этот параметр клиента доступен только в установленных копиях NVDA, Если он включён, это гарантирует, что клиентская часть NVDA будет загружена в клиент удалённого рабочего стола, даже если NVDA не запущена.
tr: NVDA'nın yüklü kopyalarında bulunan bu istemci seçeneği, NVDA çalışmadığında bile NVDA'nın istemci kısmının uzak masaüstü istemcinize yüklenmesini sağlar.

source: To use the client portion of RDAccess, changes need to be made in the Windows Registry.
pt_pt: Para utilizar a parte cliente do RDAccess, é necessário efetuar alterações no Registo do Windows.
ru: Чтобы использовать клиентскую часть RDAccess, необходимо внести несколько изменений в реестр Windows.
tr: Uzak Masaüstü Erişilebilirliği'nin istemci bölümünü kullanmak için Windows Kayıt Defteri'nde değişiklik yapılması gerekir.

source: The add-on ensures that these changes are made under the profile of the current user, requiring no administrative privileges.
pt_pt: O add-on garante que estas alterações são efectuadas no perfil do utilizador atual, não necessitando de privilégios administrativos.
ru: Дополнение гарантирует, что эти изменения будут внесены в профиль текущего пользователя, для этих изменений не требуются права администратора.
tr: Eklenti, bu değişikliklerin mevcut kullanıcının profili altında yapılmasını sağlar ve yönetici ayrıcalığı gerektirmez.

source: Therefore, NVDA can automatically apply the necessary changes when loaded and undo these changes when exiting NVDA, ensuring compatibility with portable versions of NVDA.
pt_pt: Por conseguinte, o NVDA pode aplicar automaticamente as alterações necessárias quando é carregado e anular essas alterações quando sai do NVDA, garantindo a compatibilidade com versões portáteis do NVDA.
ru: Таким образом, NVDA может автоматически применять необходимые изменения при загрузке и отменять их при выходе из NVDA, гарантируя полную совместимость дополнения с переносными версиями NVDA.
tr: Bu nedenle, NVDA yüklendiğinde gerekli değişiklikleri otomatik olarak uygulayabilir ve NVDA'dan çıkarken bu değişiklikleri geri alabilir, böylece NVDA'nın taşınabilir sürümleriyle uyumluluk sağlanır.

source: This option is disabled by default. However, if you are running an installed copy and you are the only user of the system, it is advised to enable this option for smooth operation when connecting to a remote system after NVDA starts.
pt_pt: Esta opção está desactivada por predefinição. No entanto, se estiver a executar uma cópia instalada e for o único utilizador do sistema, é aconselhável ativar esta opção para um funcionamento suave ao ligar a um sistema remoto após o início do NVDA.
ru: Эта опция отключена по умолчанию. Однако, если вы запускаете установленную копию и являетесь единственным пользователем системы, рекомендуется включить эту опцию для плавной работы при подключении к удаленной системе после запуска NVDA.
tr: Bu seçenek varsayılan olarak devre dışı bırakılır. Ancak, yüklü bir kopya çalıştırıyorsanız ve sistemin tek kullanıcısıysanız, NVDA başladıktan sonra uzak bir sisteme bağlanırken bu seçeneği düzgün çalışma için etkinleştirmeniz önerilir.

source: Enable Default Remote Desktop Support
pt_pt: Ativar o suporte predefinido para o ambiente de trabalho remoto
ru: Включить поддержку удалённого рабочего стола По умолчанию
tr: Varsayılan uzak masaüstü desteğini etkinleştir

source: This option, enabled by default, ensures that the client portion of RDAccess is loaded in the Microsoft Remote Desktop client (mstsc) when starting NVDA.
pt_pt: Esta opção, activada por predefinição, garante que a parte do cliente do RDAccess é carregada no cliente Microsoft Remote Desktop (mstsc) ao iniciar o NVDA.
ru: Этот параметр включен по умолчанию и гарантирует, что клиентская часть RDAccess будет загружена в клиент удалённого рабочего стола Microsoft (mstsc) при запуске NVDA.
tr: Bu seçenek varsayılan olarak etkindir ve NVDA başlatılırken Uzak Masaüstü Erişilebilirliği'nin istemci kısmının Microsoft Uzak Masaüstü istemcisine (mstsc) yüklenmesini sağlar.

source: This is also required for VMware Horizon, Parallels RAS, Azure Virtual Desktop. etc.
pt_pt: Isto também é necessário para o VMware Horizon, o Parallels RAS, o Ambiente de Trabalho Virtual do Azure, etc.
ru: Это также требуется для VMware Horizon, Parallels RAS, Azure Virtual Desktop. и т. д.
tr: Bu, VMware Horizon, Parallels RAS, Azure Virtual Desktop vb. için de gereklidir.

source: Changes made through this option will be automatically undone when exiting NVDA unless persistent client support is enabled.
pt_pt: As alterações efectuadas através desta opção serão automaticamente anuladas quando sair do NVDA, a menos que o suporte de cliente persistente esteja ativado.
ru: Если не включена постоянная поддержка клиентов путём включения предыдущей опции, эти изменения будут автоматически отменены при выходе из NVDA.
tr: Bu seçenek aracılığıyla yapılan değişiklikler, kalıcı istemci desteği etkinleştirilmediği sürece NVDA'dan çıkarken otomatik olarak geri alınacaktır.

source: Enable Citrix Workspace Support
pt_pt: Ativar o suporte do Citrix Workspace
ru: Включить поддержку Citrix Workspace
tr: Citrix çalışma alanı desteğini etkinleştir

source: This option, enabled by default, ensures that the client portion of RDAccess is loaded in the Citrix Workspace app when starting NVDA.
pt_pt: Esta opção, activada por predefinição, assegura que a parte do cliente do RDAccess é carregada na aplicação Citrix Workspace quando se inicia o NVDA.
ru: Эта опция включена по умолчанию и гарантирует, что клиентская часть RDAccess будет загружена в приложение Citrix Workspace при запуске NVDA.
tr: Bu seçenek varsayılan olarak etkindir ve NVDA başlatılırken Uzak Masaüstü Erişilebilirliği'nin istemci kısmının Citrix çalışma alanı uygulamasına yüklenmesini sağlar.

source: Changes made through this option will be automatically undone when exiting NVDA unless persistent client support is enabled.
pt_pt: As alterações efectuadas através desta opção serão automaticamente anuladas quando sair do NVDA, a menos que o suporte de cliente persistente esteja ativado.
ru: Если не включена постоянная поддержка клиентов путём включения предыдущей опции, эти изменения будут автоматически отменены при выходе из NVDA.
tr: Bu seçenek aracılığıyla yapılan değişiklikler, kalıcı istemci desteği etkinleştirilmediği sürece NVDA'dan çıkarken otomatik olarak geri alınacaktır.

source: This option is available only under the following conditions:
pt_pt: Esta opção só está disponível nas seguintes condições:
ru: Эта опция доступна только в следующих случаях:
tr: Bu seçenek yalnızca aşağıdaki durumlarda kullanılabilir:

source: Citrix Workspace is installed. Note that the Windows Store version of the app is not supported due to limitations in the app itself.
pt_pt: O Citrix Workspace está instalado. Note-se que a versão Windows Store da aplicação não é suportada devido a limitações da própria aplicação.
ru: Установлен Citrix Workspace. Обратите внимание, что версия приложения из магазина Windows Store не поддерживается из-за ограничений в самом приложении.
tr: Citrix çalışma alanı kurulmuşsa. Uygulamanın kendisindeki sınırlamalar nedeniyle uygulamanın Windows Mağazası sürümünün desteklenmediğini unutmayın.

source: It is possible to register RDAccess under the current user context. After installing the app, you have to start a remote session once to enable this.
pt_pt: É possível registar o RDAccess no contexto do utilizador atual. Depois de instalar a aplicação, tem de iniciar uma sessão remota uma vez para ativar esta opção.
ru: Можно зарегистрировать RDAccess в контексте текущего пользователя. После установки приложения вам необходимо один раз запустить удалённый сеанс, чтобы это стало возможным.
tr: Geçerli kullanıcı bağlamı altında Uzak Masaüstü Erişilebilirliği'ni kaydetmek mümkündür. Uygulamayı yükledikten sonra, bunu mümkün kılmak için bir kez uzaktan oturum başlatmanız gerekir.

source: Notify of connection changes with
pt_pt: Notificar as alterações de ligação com
ru: Уведомлять об изменениях подключения с помощью
tr: Bağlantı değişikliklerini şununla bildir

source: This combo box allows you to control notifications received when a remote system opens or closes the remote speech or braille connection.
pt_pt: Esta caixa combinada permite-lhe controlar as notificações recebidas quando um sistema remoto abre ou fecha a ligação remota de voz ou braille.
ru: Этот комбинированный список позволяет вам управлять уведомлениями, получаемыми, когда удалённая система открывает или закрывает соединения удалённой речи или брайля.
tr: Bu birleşik kutu, uzak bir sistem uzak konuşmayı veya Braille bağlantısını açtığında ya da kapattığında alınan bildirimleri kontrol etmenizi sağlar. Aralarında seçim yapabilirsiniz.

source: You can choose between:
pt_pt: Pode escolher entre:
ru: Вы можете выбрать между:
tr: Aralarında seçim yapabilirsiniz:

source: Off (No notifications)
pt_pt: Desligado (Sem notificações)
ru: Отключены (без уведомлений)
tr: Kapalı (bildirim yok)

source: Messages (e.g. "Remote braille connected")
pt_pt: Mensagens (por exemplo, "Braille remoto ligado")
ru: Сообщения (например, "Удаленный Брайль подключен")
tr: Mesajlar (örn. "Uzak Braille bağlı")

source: Sounds (NVDA 2025.1+)
pt_pt: Sons (NVDA 2025.1+)
ru: Звуки (NVDA 2025.1+)
tr: Sesler (NVDA 2025.1+)

source: Both messages and sounds
pt_pt: Mensagens e sons
ru: Сообщения и звуки
tr: Hem mesajlar hem de sesler

source: Note that sounds are not available on NVDA versions older than 2025.1. Beeps will be used on older versions.
pt_pt: Note que os sons não estão disponíveis nas versões do NVDA anteriores à 2025.1. Os sinais sonoros serão utilizados em versões mais antigas.
ru: Обратите внимание, что звуки недоступны в версиях NVDA старше 2025.1. В старых версиях будут использоваться сигналы.
tr: Seslerin 2025.1'den daha eski NVDA sürümlerinde mevcut olmadığını unutmayın. Bip sesleri eski sürümlerde kullanılacaktır.

source: Open diagnostics report
pt_pt: Abrir relatório de diagnóstico
ru: Открыть диагностический отчёт
tr: Tanılama raporunu aç

source: This button opens a browsable message with JSON output containing several diagnostics that can possibly aid in debugging.
pt_pt: Este botão abre uma mensagem navegável com saída JSON contendo vários diagnósticos que podem eventualmente ajudar na depuração.
ru: Эта кнопка открывает просмотровое сообщение с выводом JSON, содержащее некоторую диагностику, которая может помочь в отладке.
tr: Bu düğme, hata ayıklamaya yardımcı olabilecek çeşitli tanılamalar içeren JSON çıkışına sahip göz atılabilir bir ileti açar.

source: When [filing an issue at GitHub][4], you might be asked to provide this report.
pt_pt: Ao [registar um problema no GitHub][4], poderá ser-lhe pedido que forneça este relatório.
ru: При [подаче проблемы в GitHub][4], вас могут попросить предоставить этот отчет.
tr: [GitHub'da bir sorun sunarken][4], bu raporu vermeniz istenebilir.

source: Citrix Specific Instructions
pt_pt: Instruções específicas da Citrix
ru: Конкретные инструкции Citrix
tr: Citrix'e özgü talimatlar

source: There are important points to note when using RDAccess with the Citrix Workspace app:
pt_pt: Existem pontos importantes a ter em conta quando se utiliza o RDAccess com a aplicação Citrix Workspace:
ru: При использовании RDAccess в приложении Citrix Workspace необходимо обратить внимание на несколько важных моментов:
tr: Uzak Masaüstü Erişilebilirliği'ni Citrix çalışma alanı uygulamasıyla kullanırken dikkat edilmesi gereken bazı önemli noktalar vardır:

source: Client-Side Requirements
pt_pt: Requisitos do lado do cliente
ru: Требования на стороне клиента
tr: İstemci tarafı gereksinimleri

source: The Windows Store variant of the app is *not* supported.
pt_pt: A variante Windows Store da aplicação *não* é suportada.
ru: Версия приложения из магазина Windows Store *не* поддерживается.
tr: Uygulamanın Windows Mağazası varyantı *desteklenmez*.

source: After installing Citrix Workspace, you need to start a remote session once to let RDAccess register itself. This occurs because the application copies system settings to user settings during the initial session setup. Following this, RDAccess can register itself under the current user context.
pt_pt: Depois de instalar o Citrix Workspace, é necessário iniciar uma sessão remota uma vez para permitir que o RDAccess se registe. Isto acontece porque a aplicação copia as definições do sistema para as definições do utilizador durante a configuração inicial da sessão. Depois disso, o RDAccess pode registar-se no contexto do utilizador atual.
ru: После установки Citrix Workspace вам необходимо один раз запустить удалённый сеанс, чтобы разрешить регистрацию RDAccess. Причина этого заключается в том, что приложение копирует конфигурацию системы в конфигурацию пользователя при первом запуске сеанса. После этого RDAccess может самостоятельно зарегистрироваться в текущем пользовательском контексте.
tr: Citrix çalışma alanı'nı kurduktan sonra, Uzak Masaüstü Erişilebilirliği'nin kendisini kaydetmesine izin vermek için bir kez uzak oturum başlatmanız gerekir. Bunun nedeni, uygulamanın ilk defa oturum oluşturduğunda sistem yapılandırmasını kullanıcı yapılandırmasına kopyalamasıdır. Bundan sonra, Uzak Masaüstü Erişilebilirliği kendisini geçerli kullanıcı bağlamı altında kaydedebilir.

source: Server-Side Requirement
pt_pt: Requisito do lado do servidor
ru: Требования к серверной части
tr: Sunucu tarafı gereksinimi

source: In Citrix Virtual Apps and Desktops 2109, Citrix enabled the so-called virtual channel allow list, restricting third-party virtual channels, including the channel required by RDAccess, by default.
pt_pt: No Citrix Virtual Apps and Desktops 2109, a Citrix activou a chamada lista de permissões de canais virtuais, restringindo canais virtuais de terceiros, incluindo o canal exigido pelo RDAccess, por predefinição.
ru: В Citrix Virtual Apps и Desktops 2109 Citrix включила так называемый список разрешенных виртуальных каналов. Это означает, что сторонние виртуальные каналы, включая канал, необходимый для RDAccess, по умолчанию запрещены.
tr: Citrix Sanal Uygulamalar ve Masaüstleri 2109'da Citrix, sanal kanal izin verilenler listesini etkinleştirdi. Bu, Uzak Masaüstü gerektirdiği kanal da dahil olmak üzere üçüncü taraf sanal kanallarına varsayılan olarak izin verilmediği anlamına gelir.

source: For more information, [see this Citrix blog post](https://www.citrix.com/blogs/2021/10/14/virtual-channel-allow-list-now-enabled-by-default/).
pt_pt: Para obter mais informações, [consulte esta publicação no blogue da Citrix] (https://www.citrix.com/blogs/2021/10/14/virtual-channel-allow-list-now-enabled-by-default/).
ru: Для получения дополнительной информации [смотрите эту запись в блоге Citrix](https://www.citrix.com/blogs/2021/10/14/virtual-channel-allow-list-now-enabled-by-default/).
tr: Daha fazla bilgi için, [Bu Citrix blog gönderisine bakın](https://www.citrix.com/blogs/2021/10/14/virtual-channel-allow-list-now-enabled-by-default/).

source: Explicitly allowing the RdPipe channel required by RDAccess is not yet tested. For now, it is best to disable the allow list altogether. If your system administrator has concerns, feel free to [address the issue here][3].
pt_pt: Permitir explicitamente o canal RdPipe requerido pelo RDAccess ainda não foi testado. Por enquanto, é melhor desativar a lista de permissões completamente. Se o administrador do sistema tiver dúvidas, sinta-se à vontade para [abordar o problema aqui][3].
ru: Явное разрешение канала RdPipe, требуемого RDAccess, ещё не протестировано. На данный момент, вероятно, лучше всего полностью отключить список разрешений. Если ваш системный администратор недоволен этим, не стесняйтесь [написать об этом в соответствующем выпуске][3].
tr: Uzak Masaüstü Erişilebilirliği tarafından gerekli görülen RdPipe kanalına açıkça izin verilmesi henüz test edilmemiştir. Şimdilik, izin verilenler listesini tamamen devre dışı bırakmak muhtemelen en iyi seçeneğinizdir. Sistem yöneticiniz bundan memnun değilse, [özel konuya bir bildirim bırakın][3] çekinmeyin.

source: Issues and Contributing
pt_pt: Questões e contributos
ru: Проблемы и вклад в их решение
tr: Sorunlar ve katkıda bulunma

source: To report an issue or contribute, refer to [the issues page on Github][4].
pt_pt: Para reportar um problema ou contribuir, consulte [a página de problemas no Github][4].
ru: Если вы хотите сообщить о проблеме или внести свой вклад, загляните на [страницу проблем на Github][4].
tr: Bir sorunu bildirmek veya katkıda bulunmak istiyorsanız [Github'daki sorunlar sayfasına][4] göz atın.

source: External Components
pt_pt: Componentes externos
ru: Внешние компоненты
tr: Dış bileşenler

source: This add-on relies on [RD Pipe][5], a library written in Rust backing the remote desktop client support.
pt_pt: Este complemento baseia-se no [RD Pipe][5], uma biblioteca escrita em Rust que suporta o cliente de ambiente de trabalho remoto.
ru: Это дополнение основано на [RD Pipe][5], библиотеке, написанной на Rust и поддерживающей клиентскую поддержку удаленных рабочих столов.
tr: Bu eklenti, uzak masaüstü istemci desteğini destekleyen trust ile yazılmış bir kütüphane olan [Rd Pipe](5) sürümüne dayanmaktadır.

source: RD Pipe is redistributed as part of this add-on under the terms of [version 3 of the GNU Affero General Public License][6].
pt_pt: O RD Pipe é redistribuído como parte deste add-on sob os termos da [versão 3 da GNU Affero General Public License][6].
ru: RD Pipe распространяется как часть этого дополнения в соответствии с условиями [глабальной публичной лицензии GNU версии 3][5].
tr: RD Pipe, bu eklentinin bir parçası olarak [GNU Affero Genel Kamu Lisansı'nın 3. sürümü][6] koşulları altında yeniden dağıtılır.
