Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/rdAccess/*/rdAccess.xliff
Languages: pt_pt, ru, tr

source: RDAccess: Remote Desktop Accessibility
pt_pt: RDAccess: Acessibilidade do ambiente de trabalho remoto
ru: RDAccess: Доступность Удалённого Рабочего Стола
tr: Uzak Masaüstü Erişilebilirliği

source: Authors: [Leonard de Ruijter][1]
pt_pt: Autores: [Leonard de Ruijter][1]
ru: Авторы: [Leonard de Ruijter][1]
tr: Yazarlar: [Leonard de Ruijter][1]

source: Download [latest stable version][2]
pt_pt: Descarregar [última versão estável][2]
ru: Загрузить [последнюю стабильную версию][2]
tr: [En son kararlı sürümü indirin][2]

source: NVDA compatibility: 2024.1 and later
pt_pt: Compatibilidade com NVDA: 2024.1 e posterior
ru: Совместимость с NVDA: 2024.1 и выше
tr: NVDA uyumluluğu: 2024.1 ve sonrası

source: The RDAccess add-on (Remote Desktop Accessibility) adds support for Microsoft Remote Desktop, Citrix, Parallels RAS, or VMware Horizon remote sessions to NVDA.
pt_pt: O complemento RDAccess (Remote Desktop Accessibility) adiciona suporte para sessões remotas do Microsoft Remote Desktop, Citrix, Parallels RAS ou VMware Horizon ao NVDA.
ru: Дополнение RDAccess (Remote Desktop Accessibility, Доступность удаленного рабочего стола) добавляет поддержку доступа к сеансам удалённого рабочего стола в NVDA с помощью Удалённого Рабочего Стола Microsoft, Citrix, Parallels RAS или VMware Horizon.
tr: RDAccess eklentisi (uzak masaüstü erişilebilirliği) Microsoft uzak masaüstü, citrix, paralellikler RAS veya VMware Horizon uzak oturumları için NVDA'ya destek ekler.

source: When installed on both the client and the server in NVDA, speech and braille generated on the server will be spoken and displayed in braille on the client machine.
pt_pt: Quando instalado no cliente e no servidor do NVDA, a fala e o braille gerados no servidor serão falados e apresentados em braille no computador cliente.
ru: При установке в NVDA как на клиенте, так и на сервере, речь и брайль, сгенерированные на сервере, будут воспроизводиться на клиентском компьютере.
tr: NVDA'da hem istemciye hem de sunucuya kurulduğunda, sunucuda oluşturulan konuşma ve braille, istemci makinede braille olarak seslendirilecek ve görüntülenecektir.

source: This enables a user experience where managing a remote system feels as seamless as operating the local system.
pt_pt: Isto permite uma experiência de utilizador em que a gestão de um sistema remoto é tão simples como a operação do sistema local.
ru: Это позволяет пользователю управлять удаленной системой так же эффективно, как и локальной системой.
tr: Bu, uzak bir sistemi yönetmenin yerel sistemi çalıştırmak kadar sorunsuz hissettirdiği bir kullanıcı deneyimi sağlar.

source: Features
pt_pt: Características
ru: Возможности
tr: Özellikler

source: Support for Microsoft Remote Desktop (including Azure Virtual Desktop and Microsoft Cloud PC), Citrix, Parallels RAS, and VMware Horizon
pt_pt: Suporte para Microsoft Remote Desktop (incluindo Azure Virtual Desktop e Microsoft Cloud PC), Citrix, Parallels RAS e VMware Horizon
ru: Поддержка Microsoft Remote Desktop(включая Azure Virtual Desktop и Microsoft Cloud PC), Citrix, Parallels RAS и VMware Horizon
tr: Microsoft uzak masaüstü (Azure Virtual Masaüstü ve Microsoft Cloud PC dahil), Citrix ve VMware Horizon için destek

source: Speech and braille output
pt_pt: Saída de voz e braille
ru: Вывод речи и брайля
tr: Konuşma ve braille çıktısı

source: Automatic detection of remote braille using NVDA's automatic braille display detection
pt_pt: Deteção automática de braille remoto utilizando a deteção automática de ecrã braille do NVDA
ru: Автоматическое распознавание удалённого Брайля с помощью функции автоматического распознавания брайлевского дисплея NVDA
tr: NVDA'nın otomatik braille ekran algılamasını kullanarak uzaktan braille'in otomatik olarak algılanması

source: Automatic detection of remote speech using a dedicated detection process that can be disabled in NVDA's settings dialog
pt_pt: Deteção automática de voz remota utilizando um processo de deteção dedicado que pode ser desativado na caixa de diálogo de definições do NVDA
ru: Автоматическое распознавание удалённой речи с помощью специального процесса обнаружения, который можно отключить в диалоге настроек NVDA
tr: NVDA'nın ayarlar iletişim kutusunda devre dışı bırakılabilen özel bir algılama işlemi kullanarak uzaktan konuşmanın otomatik olarak algılanması

source: Support for portable copies of NVDA running on a server (additional configuration required for Citrix)
pt_pt: Suporte para cópias portáteis do NVDA em execução num servidor (configuração adicional necessária para Citrix)
ru: Поддержка переносных копий NVDA, запущенных на сервере (для Citrix требуется дополнительная настройка)
tr: Bir sunucuda çalışan NVDA'nın taşınabilir kopyaları için destek (Citrix için ek yapılandırma gerekli)

source: Full support for portable copies of NVDA running on a client (no additional administrative privileges required to install the add-on)
pt_pt: Suporte total para cópias portáteis do NVDA em execução num cliente (não são necessários privilégios administrativos adicionais para instalar o complemento)
ru: Полная поддержка переносных копий NVDA, запущенных на клиенте (для установки дополнения не требуются дополнительные административные привилегии)
tr: Bir istemcide çalışan taşınabilir NVDA kopyaları için tam destek (eklentiyi yüklemek için ek yönetici ayrıcalığı gerekmez)

source: Multiple active client sessions simultaneously
pt_pt: Várias sessões de cliente activas em simultâneo
ru: Несколько активных клиентских сеансов одновременно
tr: Aynı anda birden fazla aktif istemci oturumu

source: Remote desktop instantly available after NVDA start
pt_pt: Ambiente de trabalho remoto disponível instantaneamente após o arranque do NVDA
ru: Удалённый рабочий стол доступен мгновенно после запуска NVDA
tr: Uzak masaüstü, NVDA başladıktan sonra anında kullanılabilir

source: Ability to control specific synthesizer and braille display settings without leaving the remote session
pt_pt: Capacidade de controlar definições específicas do sintetizador e do ecrã braille sem sair da sessão remota
ru: Возможность управлять определёнными настройками синтезатора и брайлевского дисплея, не выходя из удалённого сеанса
tr: Uzak oturumdan ayrılmadan belirli sentezleyici ve braille ekran ayarlarını kontrol etme yeteneği

source: Ability to use speech and braille from the user session when accessing secure desktops
pt_pt: Capacidade de utilizar a voz e o braille a partir da sessão do utilizador ao aceder a ambientes de trabalho seguros
ru: Возможность использования речи и брайля в пользовательском сеансе при доступе к защищённым рабочим столам
tr: Güvenli masaüstlerine erişirken kullanıcı oturumundan konuşma ve braille kullanabilme özelliği

source: Changelog
pt_pt: Relatório de alterações
ru: Журнал изменений
tr: Değişiklik günlüğü

source: Version 1.6
pt_pt: Versão 1.6
ru: Версия 1.6
tr: Sürüm 1.6

source: Documented and improved Parallels RAS support.
pt_pt: Suporte documentado e melhorado ao Parallels RAS.
ru: Задокументирована и улучшена поддержка Parallels RAS.
tr: Belgelenmiş ve geliştirilmiş Parallels RAS desteği.

source: The minimum compatible NVDA version is now 2025.1. Removed support for earlier versions.
pt_pt: A versão mínima compatível do NVDA é agora a 2025.1. Removido o suporte para versões anteriores.
ru: Минимальная совместимая версия NVDA теперь 2025.1. Удалена поддержка более ранних версий.
tr: En düşük uyumlu NVDA sürümü artık 2025.1'dir. Önceki sürümler için destek kaldırıldı.

source: Updated RdPipe dependency.
pt_pt: Atualização da dependência do RdPipe.
ru: Обновлена зависимость RdPipe.
tr: Güncellenmiş RDPipe bağımlılığı.

source: Added the ability to configure RdPipe log level.
pt_pt: Adicionada a capacidade de configurar o nível de registo do RdPipe.
ru: Добавлена ​​возможность настроить уровень журнала RdPipe.
tr: RdPipe günlük seviyesini yapılandırma yeteneği eklendi.

source: Added a viewer for the RdPipe log, available from the settings panel.
pt_pt: Adicionado um visualizador para o registo RdPipe, disponível no painel de definições.
ru: Добавлен просмотрщик для журнала RDPipe, доступный на панели настроек.
tr: Ayarlar panelinde bulunan RdPipe günlüğü için bir görüntüleyici eklendi.

source: Improved uninstall behavior (no longer raise errors or remove Citrix support when Citrix is not available).
pt_pt: Comportamento de desinstalação aprimorado (não gera mais erros ou remove o suporte Citrix quando o Citrix não está disponível).
ru: Улучшено поведение удаления (больше не поднимает ошибки и не удаляет поддержку Citrix, когда Citrix недоступен).
tr: Geliştirilmiş kaldırma davranışı (Citrix kullanılamadığında artık hata oluşturmuyor veya Citrix desteğini kaldırmıyor).

source: Version 1.5
pt_pt: Versão 1.5
ru: Версия 1.5
tr: Sürüm 1.5

source: Add the ability to create a debugging diagnostics report by means of a button in the RDAccess settings panel [#23](https://github.com/leonardder/rdAccess/pull/23).
pt_pt: Adicionar a capacidade de criar um relatório de diagnóstico de depuração através de um botão no painel de definições do RDAccess [#23](https://github.com/leonardder/rdAccess/pull/23).
ru: Добавлена возможность создать диагностический отчёт отладки с помощью кнопки на панели настроек RDAccess [#23](https://github.com/leonardder/rdAccess/pull/23).
tr: Uzak Masaüstü Erişilebilirliği Ayar panelinde [#23](https://github.com/leonardder/rdaccess/pull/23) bir düğme aracılığıyla bir hata ayıklama teşhis raporu oluşturma olanağı eklendi.

source: Support for multi-line braille displays in NVDA 2025.1 and newer [#19](https://github.com/leonardder/rdAccess/pull/13).
pt_pt: Suporte para ecrãs braille de várias linhas no NVDA 2025.1 e mais recente [#19](https://github.com/leonardder/rdAccess/pull/13).
ru: Поддержка многострочных брайлевских дисплеев в NVDA 2025.1 и новее [#19](https://github.com/leonardder/rdAccess/pull/13).
tr: NVDA 2025.1 ve daha yeni sürümlerde çok satırlı braille ekranları için destek [#19](https://github.com/leonardder/rdAccess/pull/13).

source: The minimum compatible NVDA version is now 2024.1. Removed support for earlier versions.
pt_pt: A versão mínima compatível do NVDA é agora a 2024.1. Removido o suporte para versões anteriores.
ru: Минимальная совместимая версия NVDA теперь 2024,1. Удалена поддержка более ранних версий.
tr: En düşük uyumlu NVDA sürümü artık 2024.1'dir. Önceki sürümler için destek kaldırıldı.

source: Added client connection notifications [#25](https://github.com/leonardder/rdAccess/pull/25).
pt_pt: Adicionadas notificações de ligação do cliente [#25](https://github.com/leonardder/rdAccess/pull/25).
ru: Добавлены уведомления о подключении клиента [#25](https://github.com/leonardder/rdAccess/pull/25).
tr: İstemci bağlantısı bildirimleri eklendi [#25](https://github.com/leonardder/rdAccess/pull/25).

source: Updated RdPipe dependency.
pt_pt: Atualização da dependência do RdPipe.
ru: Обновлена зависимость RdPipe.
tr: Güncellenmiş RDPipe bağımlılığı.

source: Updated translations.
pt_pt: Traduções actualizadas.
ru: Обновлены переводы.
tr: Güncellenmiş çeviriler.

source: Version 1.4
pt_pt: Versão 1.4
ru: Версия 1.4
tr: Sürüm 1.4

source: New stable release.
pt_pt: Nova versão estável.
ru: Новый стабильный выпуск.
tr: Yeni kararlı sürüm.

source: Version 1.3
pt_pt: Versão 1.3
ru: Версия 1.3
tr: Sürüm 1.3

source: Fixed broken braille display gestures.
pt_pt: Correção de gestos de visualização em braille avariados.
ru: Исправлены повреждённые жесты брайлевского дисплея.
tr: Bozuk braille görüntüleme hareketleri düzeltildi.

source: Version 1.2
pt_pt: Versão 1.2
ru: Версия 1.2
tr: Sürüm 1.2

source: Use [Ruff](https://github.com/astral-sh/ruff) as a formatter and linter. [#13](https://github.com/leonardder/rdAccess/pull/13).
pt_pt: Utilize [Ruff](https://github.com/astral-sh/ruff) como formatador e linter. [#13](https://github.com/leonardder/rdAccess/pull/13).
ru: Используется [ruff](https://github.com/astral-sh/ruff) в качестве форматера и линтера. [#13](https://github.com/leonardder/rdAccess/pull/13).
tr: [Ruff kullanın](https://github.com/astral-sh/ruff) as a formatter and linter. [#13](https://github.com/leonardder/rdAccess/pull/13).

source: Fixed an issue where NVDA on the client generates an error when pausing speech on the server.
pt_pt: Foi corrigido um problema em que o NVDA no cliente gerava um erro ao colocar a fala em pausa no servidor.
ru: Исправлена ​​проблема, в которой NVDA на клиенте генерирует ошибку при приостановке речи на сервере.
tr: Sunucudaki konuşmayı duraklatırken istemcideki NVDA'nın bir hata oluşturduğu bir sorun düzeltildi.

source: Fixed support for `winAPI.secureDesktop.post_secureDesktopStateChange`.
pt_pt: Corrigido o suporte para `winAPI.secureDesktop.post_secureDesktopStateChange`.
ru: Исправлена поддержка для `winAPI.secureDesktop.post_secureDesktopStateChange`.
tr: `winAPI.secureDesktop.post_secureDesktopStateChange` desteği düzeltildi.

source: Improved driver initialization on the server.
pt_pt: Melhoria da inicialização do driver no servidor.
ru: Улучшена инициализация драйвера на сервере.
tr: Sunucuda geliştirilmiş sürücü başlatma.

source: Version 1.1
pt_pt: Versão 1.1
ru: Версия 1.1
tr: Sürüm 1.1

source: Added support for NVDA 2023.3 style device registration for automatic detection of braille displays. [#11](https://github.com/leonardder/rdAccess/pull/11).
pt_pt: Adicionado suporte para o registo de dispositivos de estilo NVDA 2023.3 para deteção automática de ecrãs braille. [#11](https://github.com/leonardder/rdAccess/pull/11).
ru: Добавлена ​​поддержка для регистрации устройства в стиле NVDA 2023.3 для автоматического обнаружения брайлевских дисплеев. [#11](https://github.com/leonardder/rdAccess/pull/11).
tr: Braille ekranlarının otomatik olarak algılanması için NVDA 2023.3 stili cihaz kaydı desteği eklendi. [#11](https://github.com/leonardder/rdAccess/pull/11).

source: Added support for NVDA 2024.1 Alpha `winAPI.secureDesktop.post_secureDesktopStateChange` extension point. [#12](https://github.com/leonardder/rdAccess/pull/12).
pt_pt: Adicionado suporte para o ponto de extensão NVDA 2024.1 Alpha `winAPI.secureDesktop.post_secureDesktopStateChange`. [#12](https://github.com/leonardder/rdAccess/pull/12).
ru: Добавлена поддержка NVDA 2024.1 Alpha точка расширения `winAPI.secureDesktop.post_secureDesktopStateChange`. [#12](https://github.com/leonardder/rdAccess/pull/12).
tr: NVDA 2024.1 alfa `winAPI.secureDesktop.post_secureDesktopStateChange` uzatma noktası için destek eklendi. [#12](https://github.com/leonardder/rdAccess/pull/12).

source: Version 1.0
pt_pt: Versão 1.0
ru: Версия 1.0
tr: Sürüm 1.0

source: Initial stable release.
pt_pt: Versão estável inicial.
ru: Первый стабильный выпуск.
tr: İlk kararlı sürüm.

source: Getting Started
pt_pt: Começar
ru: Приступая к работе
tr: Başlarken

source: Install RDAccess on both a client and server copy of NVDA.
pt_pt: Instale o RDAccess numa cópia de cliente e de servidor do NVDA.
ru: Установите RDAccess как в клиентской, так и в серверной копии NVDA.
tr: Uzak Masaüstü Erişilebilirliği eklentisini NVDA'nın hem istemci hem de sunucu kopyasına kurun.

source: The remote system should automatically start speaking using the local speech synthesizer. If not, in the NVDA instance on the server, select the remote speech synthesizer from NVDA's synthesizer selection dialog.
pt_pt: O sistema remoto deve começar a falar automaticamente usando o sintetizador de fala local. Caso contrário, na instância do NVDA no servidor, selecione o sintetizador de voz remoto na caixa de diálogo de seleção do sintetizador do NVDA.
ru: Удалённая система должна автоматически начать говорить, используя локальный синтезатор речи. Если нет, то в экземпляре NVDA на сервере выберите удалённый синтезатор речи в диалоге выбора синтезатора NVDA.
tr: Uzak sistem, yerel konuşma sentezleyicisini kullanarak otomatik olarak konuşmaya başlamalıdır. Değilse, sunucudaki NVDA örneğinde, NVDA'nın sentezleyici seçim iletişim kutusundan uzak konuşma sentezleyicisini seçin.

source: To use braille, enable automatic braille display detection using the braille display selection dialog.
pt_pt: Para utilizar braille, active a deteção automática de ecrã braille utilizando a caixa de diálogo de seleção de ecrã braille.
ru: Чтобы использовать брайль, включите автоматическое определение брайлевского дисплея в диалоге выбора брайлевского дисплея.
tr: Braille'i kullanmak için braille ekran seçimi iletişim kutusunu kullanarak otomatik braille ekran algılamayı etkinleştirin.

source: Configuration
pt_pt: Configuração
ru: Конфигурация
tr: Yapılandırma

source: After installation, the RDAccess add-on can be configured using NVDA's settings dialog, accessible from the NVDA Menu by choosing Preferences > Settings...
pt_pt: Após a instalação, o complemento RDAccess pode ser configurado utilizando a caixa de diálogo de definições do NVDA, acessível a partir do menu NVDA, selecionando Preferências > Definições...
ru: После установки дополнение RDAccess можно настроить с помощью диалога настроек NVDA, доступ к которому можно получить из меню NVDA, выбрав "Параметры" > "Настройки...
tr: Kurulumdan sonra, Uzak Masaüstü Erişilebilirliği eklentisi, NVDA Menüsünden Tercihler > Ayarlar seçilerek erişilebilen NVDA'nın ayarlar iletişim kutusu kullanılarak yapılandırılabilir.

source: Then, choose the Remote Desktop category.
pt_pt: Em seguida, selecione a categoria Ambiente de trabalho remoto.
ru: После этого выберите категорию "Доступность удалённого рабочего стола".
tr: Ardından, uzak masaüstü kategorisini seçin.

source: This dialog contains the following settings:
pt_pt: Esta caixa de diálogo contém as seguintes definições:
ru: Этот диалог содержит следующие настройки:
tr: Bu iletişim kutusu aşağıdaki ayarları içerir:

source: Enable Remote Desktop Accessibility for
pt_pt: Ativar a acessibilidade do ambiente de trabalho remoto para
ru: Включить доступ к удалённому рабочему столу для
tr: Şunlar için uzak masaüstü erişilebilirliğini etkinleştir

source: This list of checkboxes controls the operating mode of the add-on. Choose between:
pt_pt: Esta lista de caixas de verificação controla o modo de funcionamento do add-on. Escolha entre:
ru: Этот список флажков определяет режим работы дополнения. Вы можете выбирать между:
tr: Bu onay kutuları listesi, eklentinin çalışma modunu kontrol eder. Aşağıdakiler arasında seçim yapabilirsiniz:

source: Incoming connections (Remote Desktop Server): Choose this option if the current instance of NVDA is running on a remote desktop server.
pt_pt: Conexões de entrada (servidor de área de trabalho remota): Escolha esta opção se a instância atual do NVDA estiver sendo executada em um servidor de área de trabalho remota.
ru: Входящие подключения (сервер удалённого рабочего стола): Выберите этот параметр, если текущий экземпляр NVDA запущен на сервере удалённого рабочего стола.
tr: Gelen bağlantılar (Uzak Masaüstü Sunucusu): Geçerli NVDA örneği bir uzak masaüstü sunucusunda çalışıyorsa bu seçeneği seçin.

source: Outgoing connections (Remote Desktop Client): Choose this option if the current instance of NVDA is running on a remote desktop client that connects to one or more servers.
pt_pt: Ligações de saída (cliente de ambiente de trabalho remoto): Escolha esta opção se a instância atual do NVDA estiver sendo executada em um cliente de área de trabalho remota que se conecta a um ou mais servidores.
ru: Исходящие подключения (клиент удалённого рабочего стола): Выберите этот параметр, если текущий экземпляр NVDA запущен на клиенте удалённого рабочего стола, который подключается к одному или нескольким серверам.
tr: Giden bağlantılar (Uzak Masaüstü İstemcisi): Geçerli NVDA örneği, bir veya daha fazla sunucuya bağlanan bir uzak masaüstü istemcisinde çalışıyorsa bu seçeneği seçin.

source: Secure Desktop pass-through: Choose this option if you want to use braille and speech from the user instance of NVDA when accessing the secure desktop. Note that for this to work, you need to make the RDAccess add-on available on the secure desktop copy of NVDA. For this, choose "Use currently saved settings during sign-in and on secure screens (requires administrator privileges)" in NVDA's general settings.
pt_pt: Passagem do ambiente de trabalho seguro: Escolha esta opção se pretender utilizar o braille e a voz da instância do utilizador do NVDA ao aceder ao ambiente de trabalho seguro. Note que, para que isto funcione, é necessário disponibilizar o suplemento RDAccess na cópia do NVDA para o ambiente de trabalho seguro. Para tal, escolha "Utilizar definições atualmente guardadas durante o início de sessão e em ecrãs seguros (requer privilégios de administrador)" nas definições gerais do NVDA.
ru: Пропуск на безопасный рабочий стол: выберите этот параметр, если вы хотите использовать Брайль и речь из пользовательского экземпляра NVDA при доступе к безопасному рабочему столу. Обратите внимание, что для того, чтобы это сработало, вам необходимо сделать дополнение RDAccess доступным в копии NVDA на защищённом рабочем столе. Для этого выберите "Использовать последнюю сохранённую конфигурацию на экране входа в систему и на других защищённых экранах (требуются права администратора)" в общих настройках NVDA.
tr: Güvenli Masaüstü geçişi: Güvenli masaüstüne erişirken NVDA'nın kullanıcı örneğinden Braille ve konuşma kullanmak istiyorsanız bu seçeneği belirleyin. Bunun çalışması için RDAccess eklentisini NVDA'nın güvenli masaüstü kopyasında kullanılabilir hale getirmeniz gerektiğini unutmayın. Bunun için NVDA'nın ayarlar Genel içerisinde "Oturum açma sırasında ve güvenli ekranlarda şu anda kayıtlı ayarları kullan (yönetici ayrıcalıkları gerektirir)" seçeneğini belirleyin.

source: To ensure a smooth start with the add-on, all options are enabled by default. However, you are encouraged to disable server or client mode as appropriate.
pt_pt: Para garantir um início sem problemas com o add-on, todas as opções estão activadas por defeito. No entanto, encorajamo-lo a desativar o modo de servidor ou de cliente, conforme apropriado.
ru: Для обеспечения бесперебойной работы с дополнением все опции включены по умолчанию. Однако рекомендуется отключать серверный или клиентский режим в зависимости от обстоятельств.
tr: Eklenti ile sorunsuz bir başlangıç ​​sağlamak için tüm seçenekler varsayılan olarak etkinleştirilir. Ancak, uygun şekilde sunucu veya istemci modunu devre dışı bırakmaya teşvik edilirsiniz.

source: Automatically Recover Remote Speech after Connection Loss
pt_pt: Recuperar automaticamente o discurso remoto após perda de ligação
ru: Автоматически восстанавливать удалённую речь после сбоя соединения
tr: Bağlantı kesintisinden sonra uzak konuşmayı otomatik olarak kurtar

source: This option is only available in server mode. It ensures that the connection will automatically be re-established when the Remote Speech synthesizer is active and the connection is lost, similar to braille display auto-detection.
pt_pt: Esta opção só está disponível no modo de servidor. Assegura que a ligação é restabelecida automaticamente quando o sintetizador de voz remoto está ativo e a ligação se perde, à semelhança da deteção automática do ecrã braille.
ru: Эта опция доступна только в режиме сервера. Это гарантирует, что соединение будет автоматически восстановлено при включении удалённого синтезатора речи и потере соединения, подобно автоматическому определению брайлевского дисплея.
tr: Bu seçenek yalnızca sunucu modunda mevcuttur. Uzaktan konuşma sentezleyicisi etkin olduğunda ve Braille ekran otomatik tespitine benzer şekilde bağlantı kaybolduğunda bağlantının otomatik olarak yeniden kurulmasını sağlar.
