Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/rdAccess/*/rdAccess.po
Languages: pt_pt, ru, tr

source: Remote Braille
pt_pt: Braille remoto
ru: Удалённый брайль
tr: Uzak Braille

source: RDAccess Diagnostics
pt_pt: Diagnóstico RDAccess
ru: Диагностика RDAccess
tr: Uzak Masaüstü Erişilebilirliği Tanılamaları

source: RdPipe Log Viewer
pt_pt: Visualizador de registos RdPipe
ru: Просмотрщик Журнала RdPipe
tr: RdPipe Günlük Görüntüleyicisi

source: Remote Desktop Accessibility
pt_pt: Acessibilidade ao ambiente de trabalho remoto
ru: Доступность удалённого рабочего стола
tr: Uzak Masaüstü Erişilebilirliği

source: &Enable remote desktop accessibility for
pt_pt: &ativar a acessibilidade do ambiente de trabalho remoto para
ru: &Включить доступность удалённого рабочего стола для
tr: Aşağıdakiler için uzak masaüstü &erişilebilirliğini etkinleştir

source: Server
pt_pt: Servidor
ru: Сервер
tr: Sunucu

source: &Automatically recover remote speech after connection loss
pt_pt: Recuperar &Automaticamente a voz à distância após a perda da ligação
ru: &Автоматически восстанавливать удалённую речь после сбоя соединения
tr: &Bağlantı kesintisinden sonra uzak konuşmayı otomatik olarak kurtar

source: Client
pt_pt: Cliente
ru: Клиент
tr: İstemci

source: &Allow remote system to control driver settings
pt_pt: &Permitir que o sistema remoto controle as configurações do driver
ru: &Разрешить удалённой системе управлять настройками драйвера
tr: Uz&ak sistemin sürücü ayarlarını kontrol etmesine izin ver

source: &Persist client support when exiting NVDA
pt_pt: suporte ao cliente &Persist ao sair do NVDA
ru: &Сохранять поддержку клиента при выходе из NVDA
tr: NVDA kapatıldığında istem&ci desteğini sürdür

source: Enable default &Remote Desktop support
pt_pt: Ativar o suporte predefinido do &Remote Desktop
ru: Включить поддержку &удалённых рабочих столов по умолчанию
tr: Varsayılan Mic&rosoft Uzak Masaüstü desteğini etkinleştir

source: Enable &Citrix Workspace support
pt_pt: Ativar o suporte do &Citrix Workspace
ru: Включить поддержку &Citrix Workspace
tr: &Citrix Workspace desteğini etkinleştir

source: &Notify of connection changes with
pt_pt: &Notificar as alterações de ligação com
ru: &Уведомлять об изменениях подключения с помощью
tr: Bağla&ntı değişikliklerini şu şekilde bildir

source: &RdPipe log level
pt_pt: nível de registo do &RdPipe
ru: Уровень журнала &RdPipe
tr: &RdPipe Günlük seviyesi

source: Open RdPipe Log...
pt_pt: Abrir o registo do RdPipe...
ru: Открыть журнал RdPipe...
tr: RdPipe Günlük dosyasını Aç...

source: Open diagnostics report...
pt_pt: Abrir o relatório de diagnóstico...
ru: Открыть диагностический отчёт...
tr: Tanılama raporunu aç...

source: You need to enable remote destkop accessibility support for at least incoming or outgoing connections.
pt_pt: É necessário ativar o suporte de acessibilidade destkop remota, pelo menos para as ligações de entrada ou de saída.
ru: Вам необходимо включить удаленную поддержку специальных возможностей desktop, по крайней мере, для входящих или исходящих подключений.
tr: En azından gelen veya giden bağlantılar için NVDA Uzak Masaüstü Erişilebilirliği'ni etkinleştirmeniz gerekir.

source: Error
pt_pt: Erro
ru: Ошибка
tr: Hata

# connection type
source: speech
pt_pt: fala
ru: речь
tr: konuşma

# connection type
source: braille
ru: брайль

source: connected
pt_pt: ligado
ru: подключено
tr: bağlı

source: disconnected
pt_pt: desligado
ru: отключено
tr: bağlantı kesildi

source: Remote {} {}
pt_pt: Remoto {} {}
ru: Удалённое {} {}
tr: Uzak {} {} {} {}

source: Incoming connections (Remote Desktop Server)
pt_pt: Ligações de entrada (Servidor de Ambiente de Trabalho Remoto)
ru: Входящие подключения (сервер удалённого рабочего стола)
tr: Gelen bağlantılar (Uzak Masaüstü Sunucusu)

source: Outgoing connections (Remote Desktop Client)
pt_pt: Ligações de saída (cliente de ambiente de trabalho remoto)
ru: Исходящие подключения (клиент удалённого рабочего стола)
tr: Giden bağlantılar (Uzak Masaüstü İstemcisi)

source: Secure Desktop pass through
pt_pt: Passagem segura do ambiente de trabalho
ru: Пропуск на безопасный рабочий стол
tr: Güvenli Masaüstü geçişi

# connection notifications
source: Off
pt_pt: Desligado
ru: Отключены
tr: Kapalı

# connection notifications
source: Messages
pt_pt: Mensagens
ru: Сообщения
tr: Mesajlar

# connection notifications
source: Sounds
pt_pt: Sons
ru: Звуки
tr: Sesler

# connection notifications
source: Both Messages and sounds
pt_pt: Mensagens e sons
ru: Сообщения и звуки
tr: Hem mesaj hem de sesler

source: Remote speech
pt_pt: Discurso à distância
ru: Удалённая речь
tr: Uzak konuşma

source: &Fallback synthesizer
pt_pt: &Sintetizador de retorno
ru: &Резервный синтезатор
tr: &Yedek sentezleyici

source: Allows using speech and braille with Microsoft Remote Desktop, Citrix Workspace, Parallels RAS and VMware Horizon
pt_pt: Permite a utilização de voz e braille com o Microsoft Remote Desktop, Citrix Workspace, Parallels RAS e VMware Horizon
ru: Позволяет использовать речь и Брайль в Microsoft Remote Desktop, Citrix Workspace, Parallels RAS и VMware Horizon
tr: Microsoft Uzak Masaüstü, Citrix Workspace, Parallels RAS ve VMware Horizon ile konuşma ve braille kullanımına izin verir
