Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/outlookExtended/*/outlookExtended.po
Languages: fi, ru, tr

source: Busy
fi: Varattu
ru: Не на рабочем месте
tr: Meşgul

source: Out of Office
fi: Poissa
ru: Не на рабочем месте
tr: Ofis Dışında

source: Free
fi: Vapaa
ru: Свободен
tr: Ücretsiz

source: Working Elsewhere
fi: Työskentelee muualla
ru: Работа в другом месте
tr: Başka Yerde Çalış

source: Tentative
fi: Alustava
ru: Предварительно
tr: Geçici olarak

source: Mark a message as read
fi: Merkitse viesti luetuksi
ru: Пометить сообщение как прочитанное
tr: İletiyi okundu olarak işaretle

source: Mark a message as unread
fi: Merkitse viesti lukemattomaksi
ru: Пометить сообщение как непрочитанное
tr: İletiyi okunmadı olarak işaretle

source: Messages group: %s
fi: Viestiryhmä: %s
ru: Группа сообщений: %s
tr: İleti grubu: %s

source: Messages: %s
fi: Viestit: %s
ru: Сообщения: %s
tr: İletiler: %s

source: No message selected
fi: Viestiä ei valittu
ru: Нет выделенных сообщений
tr: Seçili ileti yok

source: unread
fi: lukematon
ru: не прочитанно
tr: okunmamış

source: read
fi: luettu
ru: прочитанно
tr: okunmuş

source: Column navigation not supported in the address book
fi: Sarakeselausta ei tueta osoitekirjassa
ru: Навигация по столбцам не поддерживается в адресной книге
tr: Adres defterinde sütun dolaşımı desteklenmiyor

source: Fake root
fi: Väärä juuri
ru: Поддельный корень
tr: Sahte kök

source: More or less information
fi: Enemmän tai vähemmän tietoja
ru: Больше или меньше информации
tr: Az ya da çok bilgi

source: Not in a message window
fi: Ei viesti-ikkunassa
ru: Не в окне сообщения
tr: İleti penceresinde değil

source: Copied to clipboard
fi: Kopioitu leikepöydälle
ru: Скопировано в буфер обмена
tr: Panoya kopyalandı

source: Reports the notification in a message. If pressed twice, moves the focus to it. If pressed three times, copies its content to the clipboard.
fi: Lukee viestin ilmoituksen. Kahdesti painettaessa kohdistus siirretään siihen ja kolmesti painettaessa sen sisältö kopioidaan leikepöydälle.
ru: Озвучивает уведомление в сообщении. Если нажать дважды, переводит в него фокус. Если нажать трижды, копирует его содержимое в буфер обмена.
tr: Bildirimi bir mesaj içinde bildirir. İki kez basılırsa, odağı ona taşır. Üç kez basılırsa, içeriğini panoya kopyalar.

source: No notification
fi: Ei ilmoitusta
ru: Нет уведомления
tr: Bildirim yok

source: Reports the information bar in a message, calendar item or task window. If pressed twice, moves the focus to it. If pressed three times, copies its content to the clipboard.
fi: Lukee viestin, kalenterimerkinnän tai tehtäväikkunan tietopalkin. Kahdesti painettaessa kohdistus siirretään siihen ja kolmesti painettaessa sen sisältö kopioidaan leikepöydälle.
ru: Озвучивает информационную панель в сообщении, событии календаря или окне задачи. Если нажать дважды, переводит в него фокус. Если нажать трижды, копирует их содержимое в буфер обмена.
tr: Bir iletideki, takvim öğesindeki ya da görevler penceresindeki bilgi çubuğunu okur. İki kez basılırsa odağı bilgi çubuğuna taşır. Üç kez basılırsa içeriğini panoya kopyalar.

source: No information bar
fi: Ei tietopalkkia
ru: Нет информационной панели
tr: Bİlgi çubuğu yok

source: Moves the focus to the message body
fi: Siirtää kohdistuksen viestirunkoon
ru: Переводит фокус в тело сообщения
tr: Odağı ileti penceresine taşır

source: Reports the number and the names of attachments in a message window. If pressed twice, moves the focus to it.
fi: Lukee viesti-ikkunassa liitteiden määrän ja nimet. Kahdesti painettaessa kohdistus siirretään liiteluetteloon.
ru: Сообщает число и имена вложений в окне сообщения. Если нажать дважды, переводит к ним фокус.
tr: İleti penceresinde eklenti sayısı ve adlarını okur. İki kez basılırsa odağı eklenti bölümüne taşır.

source: All Attendees Status
fi: Kaikkien osallistujien tila
ru: Состояние всех участников
tr: Tüm Katılımcıların Durumu

source: No Information
fi: Ei tietoja
ru: Нет Информации
tr: Bilgi Yok

source: Test case path not defined.
fi: Testitapauksen polkua ei määritetty.
ru: Тестовый путь не определён.
tr: Test senaryosu yolu tanımlanmadı.

source: Test mode offf
fi: Testitila pois
ru: Тестовый режим выключен
tr: Test modu kapalı

source: Test mode is off.
fi: Testitila pois.
ru: Тестовый режим выключен.
tr: Test modu kapalı.

source: Reports the header field %s in a message, calendar item or task window. If pressed twice, moves the focus to this field if possible. If pressed three times, copies its content to the clipboard.
fi: Lukee viestin, kalenterimerkinnän tai tehtäväikkunan %s-otsakekentän. Kahdesti painettaessa kohdistus siirretään siihen, mikäli mahdollista. Kolmesti painettaessa sen sisältö kopioidaan leikepöydälle.
ru: Озвучивает поле заголовка %s в сообщении, событии календаря или окне задачи. Если нажать дважды, переводит в это поле фокус. Если нажать трижды, копирует его содержимое в буфер обмена.
tr: Bir iletide, takvim öğesinde ya da görevler penceresinde %s başlık alanını okur. İki kez basıldığında, mümkünse odağı ilgili alana taşır. Üç kez basılırsa alan içeriğini panoya kopyalar.

source: Outlook Extended
fi: Laajennettu Outlook
ru: Расширенный Outlook
tr: Genişletilmiş Outlook Desteği

source: Extended support and features for Microsoft Outlook.
fi: Laajennettu tuki sekä paranneltuja ominaisuuksia Microsoft Outlookille.
ru: Расширенная поддержка и функции Microsoft Outlook.
tr: Microsoft Outlook için genişletilmiş destek ve özellikler.
