Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/outlookExtended/*/outlookExtended.xliff
Languages: tr

source: Outlook extended
tr: Geliştirilmiş Outlook desteği

source: Authors: Cyrille Bougot, Ralf Kefferpuetz
tr: Yazarlar: Cyrille Bougot, Ralf Kefferpuetz

source: NVDA compatibility: 2019.3 and beyond
tr: NVDA uyumluluğu: 2019.3 ve üzeri sürümler

source: Download [stable version][1]
tr: [Kararlı Sürümü İndirin][1]

source: This addon improves the use of Microsoft Outlook with NVDA: it vocalizes some native commands and adds extra commands and features.
tr: Bu eklenti, Microsoft Outlook'un NVDA ile kullanımını geliştirir: bazı yerel komutları seslendirir ve ekstra komutlar ve özellikler ekler.

source: Commands
tr: Komutlar

source: Alt+1 to Alt+9, Alt+0, Alt+-, Alt+=: Reports the header field 1 to 12 in a message, calendar item or task window. If pressed twice, moves the focus to this field if possible. If pressed three times, copies its content to the clipboard.
tr: Alt+1-9, Alt+0, Alt+-, Alt+=: 1-12 sayılı iletinin, takvim öğesinin veya görev penceresinin başlık alanını söyler. İki kez basıldığında, mümkün olduğunda odağı başlık alanına taşır. Üç kez basıldığında başlık alanının içeriğini panoya kopyalar.

source: NVDA+shift+I (desktop layout) / NVDA+control+shift+I (laptop layout): Reports the information bar in a message, calendar item or task window. If pressed twice, moves the focus to it. If pressed three times, copies its content to the clipboard.
tr: NVDA+shift+I (masaüstü düzeni) / NVDA+control+shift+I (dizüstü düzeni): iletinin, takvim öğesinin veya görev penceresinin bilgi çubuğunu okur. İki kez basıldığında odağı bilgi çubuğuna taşır. Üç kez basıldığında bilgi çubuğunun içeriğini panoya kopyalar.

source: NVDA+shift+A (desktop layout) / NVDA+control+shift+A (laptop layout):
tr: NVDA+shift+A (masaüstü düzeni) / NVDA+control+shift+A (dizüstü düzeni):

source: In a message window: reports the number and the names of attachments; if pressed twice, moves the focus to it.
tr: İleti penceresinde: eklerin sayısını ve adlarını söyler; iki kez basıldığında odağı eklere taşır.

source: In a meeting window, in the all attendees tab: display in a browseable message the attendees status on the time slot of the meeting.
tr: Bir toplantı penceresinde, tüm katılımcılar sekmesinde: toplantının zaman dilimindeki katılımcıların durumunu göz atılabilir bir mesajda görüntüler.

source: NVDA+shift+M (desktop layout) / NVDA+control+shift+M (laptop layout): Moves the focus to the message body.
tr: NVDA+shift+M (masaüstü düzeni) / NVDA+kontrol+shift+M (dizüstü düzeni): Odağı ileti gövdesine taşır.

source: NVDA+shift+N (desktop layout) / NVDA+control+shift+N (laptop layout): Reports the notification in a message window. If pressed twice, moves the focus to it. If pressed three times, copies its content to the clipboard.
tr: NVDA+shift+N (masaüstü düzeni) / NVDA+control+shift+N (dizüstü bilgisayar düzeni): Bildirimi bir mesaj penceresinde bildirir. İki kez basılırsa, odağı ona taşır. Üç kez basıldığında içeriğini panoya kopyalar.

source: Control+Q: in the message list, marks the selected message or group of messages as read.
tr: Kontrol+Q: İleti listesinde, seçilen iletiyi veya ileti grubunu okundu olarak işaretler.

source: Control+U: in the message list, marks the selected message or group of messages as unread.
tr: Kontrol+U: İleti listesinde, seçilen iletileri veya ileti grubunu okunmadı olarak işaretler.

source: Additional improvements
tr: Ek iyileştirmeler

source: When the recipient you have entered in the To, Cc or Bcc fields sends automatic out of office replies or is not present anymore on the Exchange server, Outlook report it in the notification area of the message window. In this notification area, you also have buttons to remove the address of these recipients.
tr: Kime, Bilgi veya Gizli alanlarına girdiğiniz alıcı otomatik olarak ofis dışında yanıtları gönderdiğinde veya artık Exchange sunucusunda bulunmadığında, Outlook bunu ileti penceresinin bildirim alanında bildirir. Bu bildirim alanında, bu alıcıların adresini kaldırmak için düğmeler de vardır.

source: This add-on will inform you with a ding when this notification area appears, disappears or is updated. You can then press NVDA+shif+N / NVDA+control+shift+N once to have it read and twice to jump to this area. Then move with the arrows on the recipient buttons and press a button to remove the corresponding recipient.
tr: Bu eklenti, bu bildirim alanı göründüğünde, kaybolduğunda veya güncellendiğinde sizi bir sesli uyarı ile bilgilendirir. Ardından NVDA+shift+N / NVDA+control+shift+N tuşlarına bir kez basarak okumasını sağlayabilir ve iki kez basarak bu alana atlayabilirsiniz. Daha sonra alıcı düğmelerindeki oklarla hareket edin ve ilgili alıcıyı kaldırmak için bir düğmeye basın.

source: In the address book's result list, you can use horizontal table navigation commands to read the content of each column.
tr: Adres defterinin sonuç listesinde, her sütunun içeriğini okumak için yatay tablo gezinme komutlarını kullanabilirsiniz.

source: Notes
tr: Notlar

source: All the gestures can be modified in the NVDA command gestures dialog. You may want to modify them especially in the following situations:
tr: Tüm komutlar NVDA'nın girdi hareketleri iletişim kutusundan değiştirilebilir. Özellikle aşağıdaki durumlarda komutları değiştirmeniz gerekebilir:

source: The default gestures to mark messages as read or unread are the ones for Outlook english version. If they differ from the ones of your Outlook local version, you will have to change them accordingly.
tr: İletileri okundu veya okunmadı olarak işaretleme komutları İngilizce Outlook'a göre ayarlanmıştır. Komutlar kullandığınız Outlook diliyle eşleşmiyorsa onları değiştirmeniz gerekecektir.

source: The default gestures to read headers correspond to Alt combined with the keys of the first row of the alpha-numeric keyboard. You may need to re-map the gestures tor read header 11 and 12 if they do not match your local keyboard layout.
tr: Başlıkları okuma komutları, Alt tuşu basılı tutulup klavyenin en üst sırasındaki tuşlara basılarak uygulanacak şekilde ayarlanmıştır. 11 ve 12. başlığı okuma komutları klavye düzeninizle eşleşmiyorsa bunları yeniden ayarlamanız gerekebilir.

source: Change log
tr: Değişiklikler

source: Version 3.0
tr: Sürüm 3.0

source: In a meeting window, in the all attendees tab, pressing NVDA+shift+A (desktop layout) / NVDA+control+shift+A (laptop layout) now displays in a browseable message the attendees status on the time slot of the meeting.
tr: Bir toplantı penceresinde, tüm katılımcılar sekmesinde, NVDA+shift+A (masaüstü düzeni) / NVDA+control+shift+A (dizüstü düzeni) tuşlarına basıldığında artık toplantının zaman dilimindeki katılımcıların durumu göz atılabilir bir mesajda görüntüleniyor.

source: Version 2.4
tr: Sürüm 2.4

source: Compatibility with NVDA 2024.1.
tr: Eklenti NVDA 2024.1 ile uyumlu hâle getirildi.

source: Relevant commands are now usable in on-demand speech mode.
tr: İlgili komutlar artık isteğe bağlı konuşma modunda kullanılabilir.

source: Version 2.3
tr: Sürüm 2.3

source: Note: From now on, translation updates will not appear anymore in the change log.
tr: Not: Artık çeviri güncellemeleri değişiklik günlüğünde görünmeyecek.

source: Version 2.2
tr: Sürüm 2.2

source: Restored compatibiliity with NVDA 2019.3.1.
tr: NVDA 2019.3.1 ile uyumluluk geri getirildi.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 2.1
tr: Sürüm 2.1

source: Removed the dev channel.
tr: Geliştirici kanalı kaldırıldı.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 2.0
tr: Sürüm 2.0

source: Improve the user experience with the notifications appearing when entering e-mail addresses which are not valid anymore or which send automatic out of office replies:
tr: Artık geçerli olmayan veya otomatik ofis dışı yanıtları gönderen e-posta adreslerini girerken görünen bildirimlerle kullanıcı deneyimi iyileştirildi:

source: a sound alerts when such notifications appear or are updated, a gesture allows to read it or to move to it, and navigation in this area with arrows is made more easy.
tr: Bu tür bildirimler göründüğünde veya güncellendiğinde bir sesli uyarı verilir, bir hareketle okunabilir veya o bildirimlere geçilebilir ve oklarla bu alanda gezinmek daha kolay hale getirilmiştir.

source: Version 1.10
tr: Sürüm 1.10

source: Compatibility with NVDA 2023.1.
tr: Eklenti NVDA 2023.1 ile uyumlu hâle getirildi.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 1.9
tr: Sürüm 1.9

source: Compatibility with NVDA 2022.1.
tr: Eklenti NVDA 2022.1 ile uyumlu hâle getirildi.

source: Dropped compatibility for versions of NVDA below 2019.3.
tr: NVDA sürümleri için uyumluluk 2019.3'ün altına düşürüldü.

source: The release is now performed thanks to a GitHub action instead of appVeyor.
tr: Sürüm artık appVeyor yerine bir GitHub eylemi sayesinde gerçekleştiriliyor.

source: Fixed the announcement when the user triple-presses alt+number shortcuts.
tr: Kullanıcı alt+sayı kısayollarına üç kez bastığında çıkan duyuru düzeltildi.

source: Fixed an issue preventing from reading calendar items headers of some versions of Outlook 365.
tr: Outlook 365'in bazı sürümlerinin takvim öğeleri başlıklarının okunmasını engelleyen bir sorun düzeltildi.

source: Improvement of the test environment of the add-on: navigation in the fake root dialog.
tr: Eklentinin test ortamının iyileştirilmesi: sahte kök iletişim kutusunda gezinme.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 1.8
tr: Sürüm 1.8

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Ensure that all the variable from the original Outlook appModule are still available.
tr: Orijinal Outlook appModule'deki tüm değişkenlerin hala kullanılabilir durumda olduğundan emin olun.

source: Version 1.7
tr: Sürüm 1.7

source: Update compatibility for NVDA 2021.1.
tr: Eklenti NVDA 2021.1 ile uyumlu hâle getirildi.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 1.6
tr: Sürüm 1.6

source: Fixed various issues when reading messages headers in Outlook 365.
tr: Outlook 365'te ileti başlıkları okunurken ortaya çıkan çeşitli sorunlar düzeltildi.

source: Fixed an error in announce attachments script when a braille keyboard is used.
tr: Braille klavye kullanılırken ekleri okuma skriptinde ortaya çıkan bir sorun düzeltildi.

source: Added a unit test framework.
tr: Birim test çerçevesi eklendi.

source: Updated localizations.
tr: Çeviriler güncellendi.

source: Version 1.5
tr: Sürüm 1.5

source: Reading the information bar is now working with NVDA 2019.3.
tr: Bilgi çubuğu NVDA 2019.3 ile okunabiliyor.

source: Table navigation in the address book results is now working with NVDA 2019.3.
tr: NVDA 2019.3 ile adres defteri sonuçlarında tablo dolaşımı yapılabiliyor.

source: Version 1.4
tr: Sürüm 1.4

source: The script to move focus to headers is working again.
tr: Odağı başlığa taşıma skripti düzeltildi.

source: The script to move to attachments is now working when more attachments are present.
tr: Odağı eke taşıma skripti birden fazla ek olduğunda da çalışıyor.

source: Added localizations.
tr: Çeviriler eklendi.

source: Version 1.3
tr: Sürüm 1.3

source: Fixed message headers reading for newer Office 365 release.
tr: Yeni Office 365 sürümleri için ileti başlığı okuma düzeltildi.

source: Updates to support newer versions of NVDA (Python 2 and 3 compatible).
tr: NVDA'nın yeni sürümlerini desteklemek için güncellemeler (Python 2 ve 3 ile uyumlu).

source: Added localizations.
tr: Çeviriler eklendi.

source: Releases performed now with appveyor.
tr: Yeni sürümler appveyor ile yayımlanıyor.

source: Version 1.2
tr: Sürüm 1.2

source: Fixed header reading when forwarding meeting.
tr: Toplantı iletirken başlık okuma düzeltildi.

source: Added localizations.
tr: Çeviriler eklendi.

source: Version 1.1
tr: Sürüm 1.1

source: Added localizations.
tr: Çeviriler eklendi.

source: Version 1.0
tr: Sürüm 1.0

source: Initial release.
tr: İlk Sürüm.
