Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/cursorLocator/*/cursorLocator.po
Languages: fi, pt_pt, ru, tr, zh_tw

source: Configure {}
fi: Määritä lisäosan {} asetukset
pt_pt: Configurar {}
ru: Конфигурировать {}
tr: Yapılandır {}
zh_tw: 設定 {}

source: Line properties
fi: Rivin ominaisuudet
pt_pt: Propriedades de linha
ru: Свойства строки
tr: Satır özellikleri
zh_tw: 行內容

source: Report &line length:
fi: Ilmoita &rivin pituus:
pt_pt: Indicar &tamanho de linha:
ru: Сообщить &длину строки:
tr: Satır uzun&luğunu bildir:
zh_tw: 讀出行長度(&L)：

source: Ma&ximum number of beeps for start of line notification:
fi: Rivin alun ilmoitusäänimerkkien eni&mmäismäärä:
pt_pt: Número má&ximo de bips para notificação de início de linha:
ru: Ма&ксимальное количество звуковых сигналов для оповещения о начале строки:
tr: Satır başı bildirimi için maksim&um bip sayısı:
zh_tw: 行首通知的最大嗶聲數(&X)：

source: Max&imum number of beeps for end of line notification:
fi: Rivin lopun ilmoitusäänimerkkien enimm&äismäärä:
pt_pt: &Número máximo e mínimo de bipes para notificação de fim de linha:
ru: Макс&имальное количество звуковых сигналов для оповещения о конце строки:
tr: Satır sonu bildirimi için maks&imum bip sayısı:
zh_tw: 行尾通知的最大嗶聲數(&I)：

source: Sound for start of line
fi: Rivin alun ääni
pt_pt: Som de princípio de linha
ru: Звук для начала строки
tr: Satır başı için ses
zh_tw: 行首音效

source: &Pitch of sound for start of line:
fi: Rivin alun äänen &korkeus:
pt_pt: &Pitch do som para o início da linha:
ru: &Высота звука начала строки:
tr: Satır başı için ses &perdesi:
zh_tw: 行首音效的音調(&P)：

source: L&ength of sound for start of line:
fi: Rivin alun äänen &pituus:
pt_pt: &Duração do som de princípio de linha:
ru: Длительность звука &начала строки:
tr: Satır başı için s&es uzunluğu:
zh_tw: 行首音效的長度(&E)：

source: &Test sound for start of line
fi: &Testaa rivin alun ääntä
pt_pt: &Testar som de princípio de linha
ru: &Проверка звука начала строки
tr: Satır başı sesini &Test et
zh_tw: 測試行首音效(&T)

source: Sound for end of line
fi: Rivin lopun ääni
pt_pt: Som de fim de linha
ru: Звук для конца строки
tr: Satır sonu için ses
zh_tw: 行尾音效

source: P&itch of sound for end of line:
fi: Rivin lopun äänen k&orkeus:
pt_pt: T&om do som de fim de linha:
ru: В&ысота звука конца строки:
tr: Satır sonu &için ses perdesi:
zh_tw: 行尾音效的音調(&I)：

source: Le&ngth of sound for end of line:
fi: Rivin lopun äänen p&ituus:
pt_pt: D&uração do som de fim de linha:
ru: Длительность звука &конца строки:
tr: Satır so&nu için ses uzunluğu:
zh_tw: 行尾音效的長度(&N)：

source: Test s&ound for end of line
fi: T&estaa rivin lopun ääntä
pt_pt: Testar s&om de fim de linha
ru: Проверка &звука конца строки
tr: Satır s&onu sesini test et
zh_tw: 測試行尾音效(&O)

source: Shows the {} settings.
fi: Näyttää {} -lisäosan asetukset.
pt_pt: Mostra as configurações {}.
ru: Показывает настройки {}.
tr: {} ayarlarını gösterir.
zh_tw: 顯示 {} 設定。

source: Reports the length of the current line.
fi: Ilmoittaa nykyisen rivin pituuden.
pt_pt: Indica o tamanho da linha actual.
ru: Объявляет длину текущей строки.
tr: Geçerli satırın uzunluğunu bildirir.
zh_tw: 讀出目前行的長度。

source: Line length: %d
fi: Rivin pituus: %d
pt_pt: Comprimento da linha: %d
ru: Длина строки: %d
tr: Satır uzunluğu: %d
zh_tw: 行長度：%d

source: Cursor Locator
fi: Kohdistimen paikallistaja
pt_pt: Configurações do localizador de cursor
ru: Локатор Курсора
tr: İmleç Konumlandırıcı
zh_tw: 游標定位器

source: Reports cursor positions while typing on multiline edit controls.
fi: Ilmoittaa kohdistimen sijainnin monirivisissä muokkaussäätimissä kirjoitettaessa.
pt_pt: Informa sobre as posições do cursor durante a digitação em controlos de edição de várias linhas.
ru: Объявляет положение курсора при вводе текста в многострочных редактируемых элементах управления.
tr: Çok satırlı düzenleme alanlarında yazarken imleç konumlarını bildirir.
zh_tw: 在多行編輯控制項中輸入時，讀出游標位置。
