Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/cursorLocator/*/cursorLocator.xliff
Languages: tr

source: Cursor Locator #
tr: İmleç Konumlandırıcı #

source: Authors: Noelia Ruiz Martínez, Sergio Gómez Codina.
tr: Yazarlar: Noelia Ruiz Martínez, Sergio Gómez Codina.

source: This add-on makes possible to know the position of the system caret respect to the start of the current line, while typing to add text in documents or multiline controls.
tr: Bu eklenti, belgelere veya çok satırlı kontrollere metin eklemek için yazarken, sistem imlecinin geçerli satırın başlangıcına göre konumunu bilmeyi mümkün kılar.

source: This feature deppends on the visual appearance of applications. Therefore, you may need to disable line adjustment or configure the add-on for different programs.
tr: Bu özellik, uygulamaların görsel görünümüne bağlıdır. Bu nedenle, satır ayarını devre dışı bırakmanız veya eklentiyi farklı programlar için yapılandırmanız gerekebilir.

source: Cursor Locator settings ##
tr: İmleç Konumlandırıcı ayarları ##

source: This panel is available from NVDA's menu, Preferences submenu, Settings dialog.
tr: Bu panele NVDA menüsü, Tercihler alt menüsü, Ayarlar iletişim kutusundan erişilebilir.

source: It provides the following options:
tr: Aşağıdaki seçenekleri sağlar:

source: Report line length: You can type or choose a line length (number of characters between 0 and 600), which will be announced by a hight tone when it's reached. (The default value is 80 characters).
tr: Satırı uzunluğu bildirimi: Ulaşıldığında yüksek bir tonla duyurulacak olan bir satır uzunluğu (0 ile 600 arasındaki karakter sayısı) yazabilir veya seçebilirsiniz. (Varsayılan değer 80 karakterdir).

source: Maximum number of beeps for start of line notification: You can type or select a value between 0 and 600. The default value is 0.
tr: Satır bildiriminin başlangıcı için maksimum bip sesi sayısı: 0 ile 600 arasında bir değer yazabilir veya seçebilirsiniz. Varsayılan değer 0'dır.

source: Maximum number of beeps for end of line notification: You can type or select a value between 0 and 600. The default value is 0.
tr: Satır sonu bildirimi için maksimum bip sayısı: 0 ile 600 arasında bir değer yazabilir veya seçebilirsiniz. Varsayılan değer 0'dır.

source: Pitch of sound for start of line: You can type or select a value between 20 and 20000. (The default value is 400 hertzs).
tr: Satır başlangıcı için ses perdesi: 20 ile 20000 arasında bir değer yazabilir veya seçebilirsiniz. (Varsayılan değer 400 hertz'dir).

source: Length of sound for start of line: You can type or select a value between 20 and 2000. (The default value is 50 milliseconds).
tr: Satır başlangıcı için ses uzunluğu: 20 ile 2000 arasında bir değer yazabilir veya seçebilirsiniz. (Varsayılan değer 50 milisaniyedir).

source: Test sound for start of line: Press this button to test the configured sound for start of line.
tr: Satır başlangıcı için sesi test et: Satır başlangıcı için yapılandırılmış sesi test etmek için bu düğmeye basın.

source: Pitch of sound for end of line: You can type or select a value between 20 and 20000. (The default value is 1000 hertzs).
tr: Satır sonu için ses perdesi: 20 ile 20000 arasında bir değer yazabilir veya seçebilirsiniz. (Varsayılan değer 1000 hertz'dir).

source: Length of sound for end of line: You can type or select a value between 20 and 2000. (The default value is 50 milliseconds).
tr: Satır sonu için ses uzunluğu: 20 ile 2000 arasında bir değer yazabilir veya seçebilirsiniz. (Varsayılan değer 50 milisaniyedir).

source: Test sound for end of line: Press this button to test the configured sound for end of line.
tr: Satır sonu için sesi test et: Satır sonu için yapılandırılmış sesi test etmek için bu düğmeye basın.

source: Commands ##
tr: Komutlar ##

source: You can modify the gestures to the following commands trought the NVDA's menu, Preferences submenu, Input gestures dialog:
tr: NVDA menüsü, Tercihler alt menüsü, Girdi hareketleri iletişim kutusu aracılığıyla hareketleri aşağıdaki komutlara göre değiştirebilirsiniz:

source: NVDA+control+shift+l: When possible, reports the lenght of the current line (System caret category).
tr: NVDA+kontrol+shift+l: Mümkün olduğunda geçerli satırın uzunluğunu bildirir (Sistem düzeltme kategorisi).

source: Not assigned: Shows the Cursor Locator settings dialog (Config category).
tr: Atanmamış: İmleç konumlandırıcı ayarları iletişim kutusunu gösterir (Yapılandırma kategorisi).

source: Changes for 3.0 ##
tr: <target/>

source: Compatible with NVDA 2023.1.
tr: NVDA 2023.1 ile uyumluluk.

source: Changes for 2.0 ##
tr: <target/>

source: Added ability to repeat notifications when reaching end and start of line.
tr: Satırın sonuna ve başına gelindiğinde bildirimleri tekrarlama özelliği eklendi.

source: Added support for Office documents, and Notepad on Windows 11.
tr: Windows 11'de Office belgeleri ve Not Defteri için destek eklendi.

source: Changes for 1.0 ##
tr: <target/>

source: Initial version
tr: İlk Sürüm
