Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/virtualRevision/*/virtualRevision.xliff
Languages: ru

source: Virtual Review
ru: Виртуальный Просмотр

source: Authors: Rui Batista and NVDA Addon Team
ru: Авторы: Rui Batista и Команда Дополнений NVDA

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]

source: Download [development version][2]
ru: Загрузить [разрабатываемую версию][2]

source: NVDA compatibility: 2019.3 and beyond
ru: Совместимость с NVDA: 2019.3 и позднее

source: This Addon allows NVDA users to review a Window content in a text box, similar to window virtualization of JAWS for Windows.
ru: Это дополнение позволяет пользователям NVDA просматривать содержимое окна в текстовом поле, аналогично окну виртуального просмотра в JAWS для Windows.

source: Note, however, that this is just a convenience for users and does not replace NVDA's excellent review modes and object navigation support.
ru: Заметим, что это всего лишь удобство для пользователей, и не заменяет поддержку режимов просмотра и объектной навигации NVDA.

source: Usage ##
ru: Использование ##

source: Press NVDA+control+w to open the virtual revision Window.
ru: Нажмите NVDA+control+w для открытия окна виртуального просмотра.

source: Then simply navigate the shown textbox as you do in any other text content.
ru: Затем перемещайтесь в появившемся текстовом поле, как в любом другом текстовом содержимом.

source: You can press Escape to close the virtual revision window.
ru: Вы можете нажать Escape для закрытия окна виртуального пресмотра.

source: Changes for 3.0
ru: Изменения для 3.0

source: Requires NVDA 2019.3 or later.
ru: Требуется NVDA 2019.3 или выше.

source: Changes for 2.3
ru: Изменения для 2.3

source: Internal changes to support future NVDA releases.
ru: Внутренние изменения для поддержки будущих выпусков NVDA.

source: Changes for 2.2
ru: Изменения для 2.2

source: When windows are minimized or if the foreground window has no title, NVDA will record this fact when displaying virtual review window.
ru: Когда окно свёрнуто или если оно не имеет заголовка, NVDA напишет об этом факте при отображении окна виртуального просмотра.

source: Changes for 2.1
ru: Изменения для 2.1

source: The title of the screen under virtual review will be included.
ru: Теперь включён заголовок экрана виртуального просмотра.

source: It is now possible to review contents of Universal Windows Platform (UWP) apps in Windows 10 and most modern apps in Windows 8.x.
ru: Теперь можно рассмотреть содержимое универсальной Платформы окон (uwp) приложений в Windows 10 и самых современных приложений в Windows 8.x.

source: When obtaining screen contents for modern and universal apps, a beep will be heard to indicate when the virtual review window is ready.
ru: При получении содержимого экрана для современных и универсальных приложений, будет звучать сигнал, указывающий готовность окна к виртуальному просмотру.

source: Changes for 2.0
ru: Изменения для 2.0

source: New name: Virtual Review.
ru: Новое имя: Virtual Review.

source: Due to changes in how content is shown, NVDA 2015.2 or later is required.
ru: В связи с изменениями в отображении содержимого, необходима NVDA 2015.2 или позднее.

source: Thanks to new features in 2015.2 and later, you can now find text in virtualized windows.
ru: Благодаря новым функциям в 2015.2 и позже, теперь можно найти текст в виртуализированных окнах.

source: Fixed the add-on functionality with non-console window.
ru: Исправлена функциональность дополнения в неконсольных окнах.

source: Removed useless blank lines at bottom of virtualized console window.
ru: Удалены бесполезные пустые строки в нижней части виртуализации консольного окна.

source: Some minor adjustments.
ru: Некоторые незначительные изменения.

source: Translations added.
ru: Добавлены переводы.

source: Changes for 1.2
ru: Изменения для 1.2

source: Support virtualizing of console windows
ru: Поддержка виртуализации консольных окон

source: Changes for 1.1
ru: Изменения для 1.1

source: Converted virtual revision to an add-on.
ru: Virtual revision преобразован в дополнение.

source: Changes for 1.0
ru: Изменения для 1.0

source: Initial Release
ru: Первоначальный Выпуск
