Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/winWizard/*/winWizard.po
Languages: fi, ru, tr

source: winWizard
fi: Ikkunavelho

source: &Confirm actions with sounds
fi: V&ahvista toiminnot äänillä
ru: &Звуковая индикация Подтверждения действий
tr: &eylemleri sesli olarak doğrula

source: Idle
fi: Toimeton
ru: Не активно
tr: Boşta

source: Below Normal
fi: Pienempi kuin normaali
ru: Ниже нормы
tr: Normalin altında

source: Normal
fi: Normaali
ru: Нормальный

source: Above normal
fi: Korkeampi kuin normaali
ru: Выше нормы
tr: Normalin üstünde

source: High
fi: Korkea
ru: Высокий
tr: Yüksek

source: Real time
fi: Reaaliaikainen
ru: Реальное время
tr: Gerçek zamanda

source: Stack {}
fi: Pino {}
ru: Стопка {}
tr: Grup {}

source: Change process priority
fi: Muuta prosessin prioriteettia
ru: Изменение приоритета процесса
tr: İşlem önceliğini değiştir

source: Choose priority
fi: Valitse prioriteetti
ru: Выберите приоритет
tr: Öncelik seçin

source: Change
fi: Muuta
ru: Изменить
tr: Değiştir

source: Cancel
fi: Peruuta
ru: Отмена
tr: İptal

source: Hidden windows
fi: Piilotetut ikkunat
ru: Скрытые окна
tr: Gizli pencereler

source: Unhide
fi: Näytä
ru: Показать
tr: Göster

source: Close
fi: Sulje
ru: Закрыть
tr: Kapat

source: {} from process {}
fi: {} prosessista {}
ru: {} из {} процесса
tr: {}, işlem {}

source: Win Wizard
fi: Ikkunavelho

source: Jumps between top-level windows of the current application.
fi: Siirtää ylätason ikkunoiden välillä nykyisessä sovelluksessa.
ru: Переходит между окнами верхнего уровня текущего приложения.
tr: Üzerinde bulunulan uygulamanın en üst seviyedeki pencereleri arasında geçiş yapar.

source: Not supported here.
fi: Ei tueta tässä.
ru: Не поддерживается.
tr: Komut burada desteklenmiyor.

source: This window has no top level windows to cycle to.
fi: Tässä sovelluksessa ei ole ylätason ikkunoita.
ru: В этом окне нет окон верхнего уровня.
tr: Pencerenin geçiş yapılacak en üst seviyedeki penceresi yok.

source: Multiple top level windows detected.
fi: Useita ylätason ikkunoita havaittu.
ru: Обнаружено несколько окон верхнего уровня.
tr: Birden çok en üst seviyede pencere algılandı.

source: Can't retrieve window information for this object.
fi: Tämän objektin ikkunatietoja ei voi noutaa
ru: Не удаётся получить сведения об окне для этого объекта.
tr: Nesnenin pencere bilgisi alınamadı.

source: Kills currently focused process.
fi: Tappaa aktiivisena olevan prosessin.
ru: Завершает текущий процес в фокусе.
tr: Üzerinde bulunulan işlemi sonlandırır.

source: Cannot kill the current process
fi: Nykyistä prosessia ei voi tappaa
ru: Не удаётся завершить текущий процесс
tr: İşlem sonlandırılamıyor

source: Opens a dialog allowing to change title of the current window
fi: Avaa valintaikkunan, jossa voi muuttaa nykyisen ikkunan otsikkoa.
ru: Открывает диалог изменения названия текущего окна
tr: Pencere başlığını değiştirmenize yarayan iletişim kutusunu açar

source: Enter the new title for this window:
fi: Anna tämän ikkunan uusi nimi:
ru: Введите новое название этого окна:
tr: Pencere için bir başlık girin:

source: Change window title
fi: Muuta ikkunan otsikkoa
ru: Изменение названия окна
tr: Pencere başlığını değiştir

source: Failed to change window title!
fi: Ikkunan otsikon muuttaminen epäonnistui.
ru: Не удалось изменить название окна!
tr: Pencere başlığı değiştirilemedi!

source: Error
fi: Virhe
ru: Ошибка
tr: Hata

source: Opens dialog used to change priority of the process of currently focused program.
fi: Avaa valintaikkunan, jota käytetään aktiivisena olevan sovelluksen prosessin prioriteetin muuttamiseen.
ru: Открывает диалог изменения приоритета процесса для програмы в фокусе.
tr: Üzerinde bulunulan programın işlem önceliğini değiştirmek için kullanılan iletişim kutusunu açar.

source: Cannot hide this window!
fi: Tätä ikkunaa ei voi piilottaa.
ru: Не удаётся скрыть это окно!
tr: Pencere gizlenemedi!

source: Shows or hides window in the current slot.
fi: Näyttää tai piilottaa ikkunan nykyisessä paikassa.
ru: Показывает или скрывает окно в текущем слоте.
tr: Üzerinde bulunulan grup öğesindeki pencereyi gizler veya gösterir.

source: Goes to the previous stack
fi: Siirtää edelliseen pinoon.
ru: Переходит к предыдущей стопке
tr: Önceki gruba gider

source: Goes to the next stack
fi: Siirtää seuraavaan pinoon.
ru: Переходит к следующей стопке
tr: Sonraki gruba gider

source: Hides current window in the first available slot
fi: Piilottaa nykyisen ikkunan ensimmäiseen käytettävissä olevaan paikkaan.
ru: Скрывает текущее окно в первом доступном слоте
tr: İlk kullanılabilir grup öğesindeki üzerinde bulunulan pencereyi gizler

source: Shows last hidden window
fi: Näyttää viimeksi piilotetun ikkunan.
ru: Показывает последнее скрытое окно
tr: Son gizlenen pencereyi gösterir

source: There is no window recorded as last hidden!
fi: Viimeksi piilotettua ikkunaa ei ole.
ru: Нет окна, записанного как последнее скрытое!
tr: Son gizlenen pencere bulunamadı!

source: Window recorded as last hidden no longer exists!
fi: Viimeksi piilotettua ikkunaa ei enää ole.
ru: Окно, записанное как последнее скрытое, больше не существует!
tr: Son gizlenen olarak kaydedilen pencere artık yok!

source: Opens dialog for unhiding currently hidden windows.
fi: Avaa valintaikkunan, jota käytetään tällä hetkellä piilotettuina olevien ikkunoiden näyttämiseen.
ru: Открывает диалог для отображения скрытых в данный момент окон.
tr: Gizlenen pencereleri göstermeye yarayan iletişim kutusunu açar.

source: There are no windows currently hidden.
fi: Piilotettuja ikkunoita ei ole.
ru: В настоящее время нет скрытых окон.
tr: Hiçbir pencere gizlenmemiş.

source: This addon allows you to hide windows (NVDA shift and numbers). Also, allows exploration of top level windows (windows+NVDA+tab), and kill a non responding process with windows f4.
fi: Tämän lisäosan avulla voit piilottaa ikkunoita (NVDA+Vaihto+numerot 1-0). Mahdollistaa myös ylätason ikkunoiden tutkimisen (Win+NVDA+Sarkain) ja ei-vastaavan prosessin tappamisen Win+F4:llä.
ru: Это дополнение позволяет скрывать окна (NVDA +shift +клавиши-цифры). Кроме того, позволяет просматривать окна верхнего уровня (windows+ NVDA + tab) и завершать не отвечающий процесс с помощью Windows f4.
tr: Bu eklenti NVDA+shift+numara tuşları ile pencereleri gizlemenize yarar. Ayrıca en üstteki pencerelerde dolaşabilirsiniz (Windows+NVDA+Tab). Yanıt vermeyen işlemleri Windows+F4 ile sonlandırabilirsiniz.
