Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/winWizard/*/winWizard.xliff
Languages: fi, tr

source: Win Wizard
fi: Ikkunavelho

source: Author: Oriol Gómez, Łukasz Golonka, current maintenance by Jakub Lukowicz
fi: Tekijät: Oriol Gómez, Łukasz Golonka, nykyinen ylläpitäjä Jakub Lukowicz
tr: Yazarlar: Oriol Gómez, Łukasz Golonka, güncel bakım: Jakub Lukowicz

source: NVDA compatibility: 2019.3 and beyond
fi: Yhteensopivuus: NVDA 2019.3 tai uudempi
tr: NVDA uyumluluğu: 2019.3 ve sonrası sürümler

source: This add-on allows you to perform some operations on the focused window or the process associated with it.
fi: Tämän lisäosan avulla voit suorittaa joitakin toimintoja aktiiviselle ikkunalle tai siihen liittyvälle prosessille.
tr: Bu eklenti, odaklanılan pencere veya onunla ilişkili işlem üzerinde bazı işlemler gerçekleştirmenize olanak tanır. Bir işlemi öldürürken veya bir pencereyi gösterirken / gizlerken, eylem başarılı olduğunda bir onay bip sesi duyulur. Bunu rahatsız edici bulursanız, NVDA'nın ayarlar iletişim kutusundan Win Wizard'ın ayarlar panelinde bu bip seslerini devre dışı bırakabilirsiniz.

source: When killing a process, or showing / hiding a window a confirmation beep is played when the action succeeds.
fi: Kun prosessi lopetetaan tai ikkuna näytetään/piilotetaan, toiminnon onnistuessa kuuluu vahvistusääni.
tr: Bir süreci öldürürken veya bir pencereyi gösterirken / gizlerken, eylem başarılı olduğunda bir onay bip sesi çalınır.

source: If you find this annoying you can disable these beeps in the Win Wizard's settings panel available from NVDA's settings dialog.
fi: Jos tämä tuntuu ärsyttävältä, voit poistaa äänen käytöstä Ikkunavelhon asetuspaneelista, joka löytyy NVDA:n asetusvalintaikkunasta.
tr: Bunu can sıkıcı bulursanız, NVDA'nın ayarlar iletişim kutusunda bulunan Win Wizard'ın ayarlar panelinden bu bip seslerini devre dışı bırakabilirsiniz.

source: Keyboard commands:
fi: Näppäinkomennot:
tr: Kısayollar:

source: All these commands can be remapped from the Input gestures dialog in the Win Wizard category.
fi: Voit muuttaa näitä komentoja Näppäinkomennot-valintaikkunan Ikkunavelho-kategoriasta.
tr: Tüm kısayollar girdi hareketleri iletişim kutusundaki WinWizard kategorisinden değiştirilebilir.

source: Hiding and showing hidden windows:
fi: Ikkunoiden piilottaminen ja näyttäminen:
tr: Pencere gizleme ve gizli pencereleri gösterme:

source: NVDA+Windows+numbers from 1 to 0 - hides currently focused window in the slot corresponding to the pressed number
fi: NVDA+Win+Numerot 1-0: Piilottaa aktiivisen ikkunan painettua numeroa vastaavaan paikkaan.
tr: NVDA+Windows+1'den 0'a kadar sayılar - basılan sayıya denk gelen yuvadaki pencereyi gizler

source: NVDA+Windows+left arrow - moves to the previous stack of hidden windows.
fi: NVDA+Win+Vasen nuoli: Siirtää edelliseen piilotettujen ikkunoiden pinoon.
tr: NVDA+Windows+Sol ok - önceki gizli pencere grubuna gider.

source: NVDA+Windows+right arrow - moves to the next stack of hidden windows.
fi: NVDA+Win+Oikea nuoli: Siirtää seuraavaan piilotettujen ikkunoiden pinoon.
tr: NVDA+Windows+Sağ ok - sonraki gizli pencere grubuna gider.

source: Windows+Shift+h - hides the currently focused window in the first available slot
fi: Win+Vaihto+H: Piilottaa aktiivisen ikkunan ensimmäiseen käytettävissä olevaan paikkaan.
tr: Windows+Shift+H - odaklanan pencereyi gizler ve pencereyi boş olan ilk yuvaya koyar

source: NVDA+Windows+h - shows the last hidden window
fi: NVDA+Win+H: Näyttää viimeksi piilotetun ikkunan.
tr: NVDA+Windows+H - en son gizlenen pencereyi gösterir

source: Windows+Shift+l - shows the list of all hidden windows grouped by the stacks (please note that by default last hidden window is selected)
fi: Win+Vaihto+L: Näyttää luettelon kaikista piilotetuista ikkunoista pinojen mukaan ryhmiteltyinä (viimeksi piilotettu ikkuna on oletusarvoisesti valittuna).
tr: Windows+Shift+L - tüm gizli pencerelerin listesini gruplanmış şekilde gösterir (varsayılan olarak son gizli pencere seçilir)

source: Managing processes:
fi: Prosessien hallinta:
tr: İşlemleri yönetme:

source: Windows+F4 - kills the process associated with the currently focused window
fi: Win+F4: Lopettaa aktiiviseen ikkunaan liittyvän prosessin.
tr: Windows+F4 - odaklanılan pencereyle ilişkili işlemi sonlandırır

source: NVDA+Windows+p - opens dialog allowing you to set priority of the process associated with the currently focused window
fi: NVDA+Win+P: Avaa valintaikkunan, jossa voit asettaa aktiiviseen ikkunaan liittyvän prosessin prioriteetin.
tr: NVDA+Windows+P - odaklanılan pencereyle ilişkili işlemin önceliğini değiştirebileceğiniz bir iletişim kutusu açar

source: Miscellaneous commands:
fi: Sekalaiset komennot:
tr: Çeşitli kısayollar:

source: NVDA+Windows+TAB - switches between top level windows of the current program (useful in foobar2000, Back4Sure etc.)
fi: NVDA+Win+Sarkain: Vaihtaa nykyisen ohjelman ylätason ikkunoiden välillä (hyödyllinen foobar2000:ssa, Back4Suressa jne.).
tr: NVDA+Windows+TAB - geçerli programın en üst düzey pencereleri arasında geçiş yapar (foobar2000, Back4Sure vb.'de kullanışlıdır)

source: CTRL+ALT+T - allows you to change title of the currently focused program
fi: Ctrl+Alt+T: Mahdollistaa aktiivisen ohjelman ikkunan nimen muuttamisen.
tr: CTRL+ALT+T - üzerinde bulunulan programın pencere başlığını değiştirir

source: Changes:
fi: Muutokset:
tr: Değişiklikler:

source: Changes for 5.0.7:
fi: Muutokset versiossa 5.0.7:
tr: 5.0.7 için değişiklikler:

source: Compatibility with NVDA 2025.1
fi: Yhteensopiva NVDA 2025.1:n kanssa
tr: NVDA 2025.1 ile uyumluluk

source: Update translations
fi: Käännöksiä päivitetty
tr: Çeviriler güncellendi

source: Changes for 5.0.6:
fi: Muutokset versiossa 5.0.6:
tr: 5.0.6 için değişiklikler:

source: Compatibility with NVDA 2024.1
fi: Yhteensopiva NVDA 2024.1:n kanssa
tr: NVDA 2024.1 ile uyumluluk

source: Update translations
fi: Käännöksiä päivitetty
tr: Çeviriler güncellendi

source: Changes for 5.0.5:
fi: Muutokset versiossa 5.0.5:
tr: 5.0.5 için değişiklikler:

source: Compatibility with NVDA 2023.2
fi: Yhteensopiva NVDA 2023.2:n kanssa
tr: NVDA 2023.2 ile uyumluluk

source: Update translations
fi: Käännöksiä päivitetty
tr: Çeviriler güncellendi

source: Changes for 5.0.4:
fi: Muutokset versiossa 5.0.4:
tr: 5.0.4 için değişiklikler:

source: Compatibility with NVDA 2022.1
fi: Yhteensopiva NVDA 2022.1:n kanssa
tr: NVDA 2022.1 ile uyumluluk

source: It is now possible to disable confirmation beeps in the add-ons settings panel
fi: Vahvistusäänen käytöstä poistaminen on nyt mahdollista lisäosan asetuspaneelissa
tr: Eklenti ayar panelinde onay bip seslerini devre dışı bırakmak artık mümkün

source: Update translations
fi: Käännöksiä päivitetty
tr: Çeviriler güncellendi

source: Changes for 5.0.3:
fi: Muutokset versiossa 5.0.3:
tr: 5.0.3 için değişiklikler:

source: Compatibility with NVDA 2021.1
fi: Yhteensopiva NVDA 2021.1:n kanssa
tr: NVDA 2021.1 ile uyumluluk

source: Changes for 5.0.2:
fi: Muutokset versiossa 5.0.2:
tr: 5.0.2 için değişiklikler:

source: First release available from the add-ons website
fi: Ensimmäinen lisäosasivustolta saatavilla oleva versio
tr: Eklentiler web sitesinde bulunan ilk sürüm
