Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/winMag/*/winMag.xliff
Languages: tr

source: Windows Magnifier
tr: Windows Büyüteç

source: Author: Cyrille Bougot
tr: Yazar: Cyrille Bougot

source: NVDA compatibility: 2019.2.1 and beyond
tr: NVDA uyumluluğu: 2019.2.1 ve sonrası

source: This add-on improves the use of Windows Magnifier with NVDA.
tr: Bu eklenti, Windows Büyüteç'in NVDA ile kullanımını geliştirir.

source: Features
tr: Özellikler

source: Allows to report the result of some native Magnifier and color filtering keyboard commands.
tr: Bazı dahili Büyüteç ve renk filtreleme klavye komutlarının sonucunu duyurmaya izin verir.

source: Allows to reduce the cases where table navigation commands conflict with Magnifier's commands.
tr: Tablo gezinme komutlarının Büyüteç komutlarıyla çakıştığı durumları azaltmayı amaçlar.

source: Adds some keyboard shortcuts to toggle various native options of the Magnifier.
tr: Büyüteç'in çeşitli yerel seçeneklerini değiştirmek için bazı klavye kısayolları ekler.

source: Allow to save and restore the configuration parameters of the Magnifier.
tr: Büyüteç yapılandırma parametrelerini kaydetmeye ve geri yüklemeye izin verir.

source: Adds some extra features that are not provided by Windows Magnifier (mouse to view, Magnifier window not on top)
tr: Windows Büyüteç tarafından sağlanmayan bazı ek özellikler ekler (görüntülemek için fare, Büyüteç penceresi üstte değil)

source: Settings
tr: Ayarlar

source: The setting panel of Windows Magnifier add-on allows to configure how NVDA reacts to native Windows Magnifier commands.
tr: Windows Büyüteç eklentisinin ayar paneli, NVDA'nın yerel Windows Büyüteç komutlarına nasıl tepki vereceğini yapılandırmanıza olanak tanır.

source: You may want to have more or less commands reported according to what you are able to see.
tr: Görebildiklerinize göre daha fazla veya daha az komutun bildirilmesini isteyebilirsiniz.

source: The panel also contains an option to modify the behaviour of Windows Magnifier control window.
tr: Panel ayrıca Windows Büyüteç kontrol penceresinin davranışını değiştirme seçeneği de içerir.

source: This panel may be opened choosing Preferences -> Settings in the NVDA menu and then selecting the Windows Magnifier category in the Settings window.
tr: Bu panel, NVDA menüsünde Tercihler -> Ayarlar seçilerek ve ardından Ayarlar penceresinde Windows Büyüteç kategorisi seçilerek açılabilir.

source: The keyboard shortcut NVDA+Windows+O then O also allows to open this settings panel directly.
tr: NVDA+Windows+O ve ardından O klavye kısayolu da bu ayarlar panelinin doğrudan açılmasına izin verir.

source: The panel contains the following options:
tr: Panel aşağıdaki seçenekleri içerir:

source: Report view moves: controls what is reported when you move the view with Control+Alt+Arrows commands. The three options are:
tr: Görünüm hareketlerini bildir: Görünümü Control+Alt+Oklar komutlarıyla hareket ettirdiğinizde nelerin bildirildiğini kontrol eder. Üç seçenek şunlardır:

source: Off: Nothing is reported.
tr: Kapalı: Hiçbir şey bildirilmez.

source: With speech: a speech message indicates the position of the zoomed view on the dimension the view is being moved.
tr: Konuşarak: bir konuşma mesajı, yakınlaştırılan görünümün, görünümün taşınmakta olduğu boyuttaki konumunu belirtir.

source: With tones: a tone is played and its pitch indicates the position of the zoomed view on the dimension the view is being moved.
tr: Bip sesi ile: bir ton çalınır, yükselip alçalan perdesi ile görünümün taşınmakta olduğu boyutta yakınlaştırılan görünümün konumunu belirtir.

source: This option does not affect docked view mode.
tr: Bu seçenek, sabitlenmiş görünüm modunu etkilemez.

source: Report screen edges: controls what is reported when you reach the edges of the screen while moving the view with Control+Alt+Arrows commands.
tr: Ekran kenarlarını bildir: Control+Alt+Oklar komutlarıyla görünümü hareket ettirirken ekranın kenarlarına ulaştığınızda neyin bildirileceğini kontrol eder. Üç seçenek vardır: Kapalı, Konuşma ile ve Ton ile. Bu seçenek sabitlenmiş görünüm modunu etkilemez.

source: The three options are: Off, With speech and With tones.
tr: Üç seçenek şunlardır: Kapalı, Konuşma ile ve Sesli.

source: This option does not affect docked view mode.
tr: Bu seçenek, sabitlenmiş görünüm modunu etkilemez.

source: Volume of the tones reporting the position of the view: allows to define the volume of the tones if you have selected to report view moves or screen edges with tones.
tr: Görünümün konumunu bildiren tonların ses seviyesi: görünüm hareketlerini veya ekran kenarlarını tonlarla bildirmeyi seçtiyseniz tonların ses seviyesini ayarlamayaa olanak tanır.

source: Report turn on or off:
tr: Açma veya Kapatmayı bildir: İşaretlenirse, açmak veya kapatmak için Windows++ veya Windows+Escape komutlarını kullandığınızda Büyüteç'in durumu bildirilir:

source: If checked, the Magnifier's state is reported when you use Windows++ or Windows+Escape commands to turn it on or off.
tr: İşaretlendiğinde, Windows++ veya Windows+Escape komutlarını kullanarak Büyüteci açıp kapattığınızda Büyütecin durumu bildirilir.

source: Report zoom:
tr: Yakınlaştırmayı bildir:

source: If checked, the Magnifier's zoom level is reported when you use Windows++ or Windows+- zoom commands.
tr: İşaretlendiğinde, Windows++ veya Windows+- yakınlaştırma komutlarını kullandığınızda Büyüteç'in yakınlaştırma düzeyi bildirilir.

source: Report color inversion:
tr: Rengi Ters çevirmeyi bildir:

source: If checked, the color inversion state is reported when you use the control+Alt+I toggle command.
tr: İşaretlendiğinde, Control+Alt+I tuşlarını kullanarak renk ters çevirme durumu bildirilir.

source: Report view change:
tr: Görünüm değişikliklerini Bildir:

source: If checked, the view type is reported when you use a command that changes the view type (Control+Alt+M, Control+Alt+F, Control+Alt+D, Control+Alt+L)
tr: İşaretlendiğinde, görünüm türünü değiştiren bir komut kullandığınızda (Control+Alt+M, Control+Alt+F, Control+Alt+D, Control+Alt+L) görünüm türü bildirilir.

source: Report lens or docked window resizing:
tr: Mercek veya sabitlenmiş pencere yeniden boyutlandırmayı bildirir:

source: If checked, a message is reported when you use the resizing commands (Alt+Shift+Arrows).
tr: İşaretlendiğinde, yeniden boyutlandırma komutlarını (Alt+Shift+Ok tuşları) kullandığınızda bir mesaj görüntülenir.

source: In docked window mode, the height or the width is reported.
tr: Sabitlenmiş pencere modunda, yükseklik veya genişlik bildirilir.

source: In lens mode, the new dimension cannot be reported for now.
tr: Lens modunda, yeni boyut şimdilik bildirilemez.

source: These resizing command do not seem to be available on all versions of Windows; if your Windows version does not support them, you should keep this option unchecked.
tr: Bu yeniden boyutlandırma komutları tüm Windows sürümlerinde mevcut görünmüyor; Windows sürümünüz bunları desteklemiyorsa, bu seçeneği işaretlememelisiniz.

source: In documents and list views, pass control+alt+arrows shortcuts to Windows Magnifier:
tr: Belgelerde ve liste görünümlerinde, control+alt+ok kısayollarını Windows Büyüteç'e ilet: Üç kullanılabilir seçenek vardır:

source: There are three possible choices:
tr: Üç olası seçenek var:

source: Never: The command is not passed to Windows Magnifier and standard NVDA table navigation can operate.
tr: Asla: Komut, Windows Büyüteç'e iletilmez ve standart NVDA tablo gezintisi çalışabilir.

source: When used in documents out of a table, the Control+Alt+Arrow command reports a "Not in a table" error message.
tr: Tablo dışındaki belgelerde kullanıldığında, Control+Alt+Ok komutu “Tablo içinde değil” hata mesajını bildirir.

source: This is the standard behaviour of NVDA without this add-on.
tr: Bu, bu eklenti olmadan NVDA'nın standart davranışıdır.

source: You can still use NVDA+Windows+O then arrows to move the magnified view.
tr: NVDA+Windows+O tuşlarını ve ok tuşlarını kullanarak büyütülmüş görüntüyü hareket ettirebilirsiniz.

source: Only when not in table: In table or in list views, Control+Alt+Arrow commands perform standard table navigation.
tr: Yalnızca tabloda olmadığında: Tablo veya liste görünümlerinde, Control+Alt+Ok komutları standart tabloda gezinme gerçekleştirir.

source: When used in documents out of a table, Control+Alt+Arrow commands perform standard Magnifier view move commands.
tr: Tablo dışındaki belgelerde kullanıldığında, Control+Alt+Ok tuşları standart Büyüteç görünümü hareket komutlarını gerçekleştirir.

source: If you still want to move Windows Magnifier view while in table or in list view, you will need to press NVDA+F2 before using Control+Alt+Arrow commands or alternately use NVDA+Windows+O then arrows.
tr: Tablo veya liste görünümündeyken Windows Büyüteç görünümünü hala taşımak istiyorsanız, Control+Alt+Ok komutlarını kullanmadan önce NVDA+F2 tuşlarına basmanız veya dönüşümlü olarak NVDA+Windows+O ve ardından okları kullanmanız gerekecektir.

source: This option is the best compromise if you want to use Control+Alt+Arrow for both Magnifier and table navigation.
tr: Bu seçenek, Büyüteç ve tablo gezinme için Control+Alt+Ok tuşlarını kullanmak istiyorsanız en iyi uzlaşmadır.

source: Always: Control+Alt+Arrow commands moves the Magnifier's view in any case.
tr: Daima: Control+Alt+Ok komutları, her durumda Büyüteç'in görünümünü hareket ettirir.

source: This option may be useful if you do not use Control+Alt+Arrow to navigate in table, e.g. because you have changed table navigation shortcuts in NVDA or because you exclusively use [Easy table navigator][5] add-on for table navigation.
tr: Bu seçenek, tablo içinde gezinmek için Control+Alt+Ok tuşlarını kullanmıyorsanız yararlı olabilir. Örneğin, NVDA'da tablo gezinme kısayollarını değiştirdiyseniz veya tablo gezinme için yalnızca [Easy table navigator][5] eklentisini kullanıyorsanız.

source: Keep Windows Magnifier command window always on top:
tr: Windows Büyüteç komut penceresini her zaman üstte tut: İşaretlenmezse, Büyüteç'in kontrol penceresi her zaman diğer pencerelerin üstünde tutulmaz:

source: If unchecked, the Magnifier's control window will not be kept always on top of other windows.
tr: İşaretlenmezse, Büyüteç'in kontrol penceresi diğer pencerelerin üzerinde her zaman üstte kalmaz.

source: Report color filter
tr: Renk Filtresini Bildir

source: If checked, the used color filter is reported when you use the `Windows+Control+C` toggle command.
tr: İşaretlendiğinde, `Windows+Control+C` geçiş komutunu kullandığınızda kullanılan renk filtresi bildirilir.

source: Commands added by this add-on
tr: Bu eklenti tarafından eklenen komutlar

source: In addition to native Magnifier commands, this add-on provide additional commands:
tr: Yerel Büyüteç komutlarına ek olarak, bu eklenti ek komutlar sağlar:

source: Commands that allow to control Magnifier's options without opening its configuration page.
tr: Yapılandırma sayfasını açmadan Büyüteç'in seçeneklerini kontrol etmeyi sağlayan komutlar.

source: Extra commands specific to this add-on.
tr: Bu eklentiye özel ekstra komutlar.

source: All these additional commands are accessible through the Magnifier layer command NVDA+Windows+O:
tr: Tüm bu ek komutlara Büyüteç katmanı komutu NVDA+Windows+O aracılığıyla erişilebilir:

source: NVDA+Windows+O then C: Toggles on or off caret tracking.
tr: NVDA+Windows+O ardından C: İmleç izlemeyi açar veya kapatır.

source: NVDA+Windows+O then F: Toggles on or off focus tracking.
tr: NVDA+Windows+O ardından F: Odak izlemeyi açar veya kapatır.

source: NVDA+Windows+O then M: Toggles on or off mouse tracking.
tr: NVDA+Windows+O ardından M: Fare izlemeyi açar veya kapatır.

source: NVDA+Windows+O then T: Toggles on or off tracking globally.
tr: NVDA+Windows+O sonra T: Genel olarak izlemeyi açar veya kapatır. İzleme tekrar açıldığında, izleme kapatılmadan önceki son etkin izleme yapılandırmasına ayarlanır.

source: When tracking is toggled on again, it is set to the last active tracking configuration before tracking was toggled off.
tr: İzleme tekrar açıldığında, izleme kapatılmadan önceki son aktif izleme yapılandırmasına ayarlanır.

source: NVDA+Windows+O then S: Toggles on or off smoothing.
tr: NVDA+Windows+O ardından S: yumuşatmayı açar veya kapatır.

source: NVDA+Windows+O then R: Switches between mouse pointer tracking modes (within the edge of the screen or centered on the screen); this feature is only available on Windows 10 build 17643 or higher.
tr: NVDA+Windows+O ardından R: Fare imleci izleme modları arasında geçiş yapar (ekranın kenarı içinde veya ekranın ortasında); bu özellik yalnızca Windows 10 build 17643 veya sonraki sürümlerde mevcuttur.

source: NVDA+Windows+O then X: Switches between text cursor tracking modes (within the edge of the screen or centered on the screen); this feature is only available on Windows 10 build 18894 or higher.
tr: NVDA+Windows+O ardından X: Metin imleci izleme modları arasında geçiş yapar (ekranın kenarında veya ekranın ortasında); bu özellik yalnızca Windows 10 build 18894 veya üzeri sürümlerde mevcuttur.

source: NVDA+Windows+O then shift+P: Saves the current configuration parameters of the magnifier to NVDA's configuration.
tr: NVDA+Windows+O ve ardından shift+P: Büyüteçteki geçerli yapılandırma parametrelerini NVDA'nın yapılandırmasına kaydeder.

source: NVDA+Windows+O then P: Restores the current configuration parameters of the magnifier from NVDA's configuration.
tr: NVDA+Windows+O sonra P: Büyüteç'in geçerli yapılandırma parametrelerini NVDA'nın yapılandırmasından geri yükler. Daha önce NVDA'nın yapılandırmasına hiçbir yapılandırma parametresi kaydedilmemişse, bunun yerine Windows Büyüteç'in varsayılan yapılandırma parametreleri geri yüklenir.

source: If no configuration parameters has been previously saved to NVDA's configuration, the default configuration parameters of Windows Magnifier are restored instead.
tr: NVDA'nın yapılandırmasına önceden hiçbir yapılandırma parametresi kaydedilmemişse, bunun yerine Windows Büyüteç'in varsayılan yapılandırma parametreleri geri yüklenir.

source: NVDA+Windows+O then Arrows: Move the magnified view.
tr: NVDA+Windows+O ve ardından Oklar: Büyütülmüş görünümü hareket ettirir.

source: NVDA+Windows+O then V: Moves the mouse cursor in the center of the magnified view (command not available in docked view mode).
tr: NVDA+Windows+O ardından V: Fare imlecini büyütülmüş görünümün ortasına taşır (komut yalnızca tam ekran görünümünde kullanılabilir).

source: NVDA+Windows+O then W: Switches on or off the mode allowing to keep Windows Magnifier's control window always on top of the other ones.
tr: NVDA+Windows+O ve W: Windows Büyüteç'in kontrol penceresinin her zaman diğer pencerelerin üstünde tutulmasına izin veren modu açar veya kapatır. Bu özellik yalnızca kurulu NVDA sürümleri için mevcuttur.

source: This feature is only available for installed versions of NVDA.
tr: Bu özellik yalnızca NVDA'nın yüklü sürümlerinde kullanılabilir.

source: NVDA+Windows+O then O: Opens Windows Magnifier add-on settings.
tr: NVDA+Windows+O ardından O: Windows Büyüteç eklenti ayarlarını açar.

source: NVDA+Windows+O then H: Displays help on Magnifier layer commands.
tr: NVDA+Windows+O ardından H: Büyüteç katmanı komutlarıyla ilgili yardımı görüntüler.

source: There is no default direct gesture for each command, but you can attribute one normally in the input gesture dialog if you wish.
tr: Her komut için varsayılan bir doğrudan hareket yoktur, ancak isterseniz girdi hareketi iletişim kutusunda normal olarak bir tane atayabilirsiniz.

source: The same way, You can also modify or delete the Magnifier layer access gesture (NVDA+Windows+O).
tr: Aynı şekilde, Büyüteç katmanı erişim hareketini (NVDA+Windows+O) de değiştirebilir veya silebilirsiniz.

source: Yet, you cannot modify the shortcut key of the Magnifier layer sub-commands.
tr: Ancak, Büyüteç katmanı alt komutlarının kısayol tuşunu değiştiremezsiniz.

source: Magnifier's native commands
tr: Büyüteç'in Varsayılan komutları

source: The result of the following Magnifier native commands, or other Accessibility commands, may be reported by this add-on, according to its configuration:
tr: Aşağıdaki Büyüteç yerel komutlarının veya diğer Erişilebilirlik komutlarının sonucu, yapılandırmasına göre bu eklenti tarafından bildirilebilir:

source: Start Magnifier: Windows++ (on alpha-numeric keyboard or on numpad)
tr: Büyüteç'i Başlat: Windows++ (alfa sayısal klavyede veya sayısal tuş takımında)

source: Quit Magnifier: Windows+Escape
tr: Büyüteçten Çık: Windows+Escape

source: Zoom in: Windows++ (on alpha-numeric keyboard or on numpad)
tr: Yakınlaştır: Windows++ (alfa sayısal klavyede veya sayısal tuş takımında)

source: Zoom out: Windows+- (on alpha-numeric keyboard or on numpad)
tr: Uzaklaştır: Windows+- (alfa sayısal klavyede veya sayısal tuş takımında)

source: Toggle color inversion: Control+Alt+I
tr: Rengi ters çevirmeyi aç/kapat: Control+Alt+I

source: Select the docked view: Control+Alt+D
tr: Sabitlenmiş görünümü seçin: Control+Alt+D

source: Select the full screen view: Control+Alt+F
tr: Tam ekran görünümünü seçin: Control+Alt+F

source: Select the lens view: Control+Alt+L
tr: Mercek görünümünü seçin: Control+Alt+L

source: Cycle through the three view types: Control+Alt+M
tr: Üç görünüm türü arasında geçiş yapın: Control+Alt+M

source: Resize the lens with the keyboard: Shift+Alt+Left/Right/Up/DownArrow
tr: Merceği klavyeyle yeniden boyutlandırın: Shift+Alt+Sol/Sağ/Yukarı/Aşağı Ok

source: Note: although this does not seem to be documented, this shortcut seems to have been withdrawn in recent Windows versions such as Windows 10 2004.
tr: Not: Bu durum belgelenmiş gibi görünmese de, bu kısayol Windows 10 2004 gibi son Windows sürümlerinde kaldırılmış gibi görünüyor.

source: Move the magnified view: Control+Alt+Arrows
tr: Büyütülmüş görünümü taşıma: Control+Alt+Oklar

source: Toggle color filters: `Windows+Control+C` (provided you have enabled this shortcut in [Windows Accessibility settings, Color Filters][9])
tr: Renk filtrelerini değiştir: `Windows+Control+C` (bu kısayolu [Windows Erişilebilirlik ayarları, Renk Filtreleri][9] etkinleştirmiş olmanız şartıyla)

source: Here is also a list of other Magnifier native commands, just for information:
tr: Burada ayrıca yalnızca bilgi için diğer Büyüteç varsayılan komutlarının bir listesi bulunmaktadır:

source: Control+Alt+mouseScrollWheel: Zooms in and out using the mouse scroll wheel.
tr: Kontrol+Alt+fareKaydırma Tekerleği: Fare kaydırma tekerleğini kullanarak yakınlaştırır ve uzaklaştırır.

source: Control+Windows+M: Opens the Magnifier's settings window.
tr: Kontrol+Windows+M: Büyüteç ayarları penceresini açar.

source: Control+Alt+R: Resizes the lens with the mouse.
tr: Kontrol+Alt+R: Merceği fare ile yeniden boyutlandırır.

source: Control+Alt+Space: Quickly shows the entire desktop when using full screen view.
tr: Kontrol+Alt+Boşluk çubuğu: Tam ekran görünümü kullanılırken tüm masaüstünü hızlı bir şekilde gösterir.

source: None of the Magnifier native commands can be modified.
tr: Büyüteç Varsayılankomutlarının hiçbiri değiştirilemez.

source: Notes
tr: Notlar

source: For computers equipped with an Intel graphic card, control+alt+arrow (left/right/up/down) are also shortcuts to modify the orientation of the screen.
tr: Intel grafik kartı bulunan bilgisayarlar için, kontrol+alt+ok (sol/sağ/yukarı/aşağı) da ekranın yönünü değiştirmek için kısayollardır. Bu kısayollar varsayılan olarak etkindir ve görünümü taşımak için Windows Büyüteç kısayollarıyla çakışır. Bunları Büyüteç ile kullanabilmek için devre dışı bırakmanız gerekecek. Intel kontrol panelinden veya sistem tepsisinde bulunan Intel menüsünden devre dışı bırakılabilirler.

source: These shortcut are enabled by default and conflict with Windows Magnifiers shortcuts to move the view.
tr: Bu kısayollar varsayılan olarak etkindir ve görünümü taşımak için Windows Büyüteç kısayollarıyla çakışır.

source: You will need to disable them to be able to use them for the Magnifier.
tr: Büyüteçte kullanabilmek için bunları devre dışı bırakmanız gerekecektir.

source: They can be disabled in the Intel control panel or in the Intel menu present in the system tray.
tr: Bunlar Intel kontrol panelinden veya sistem tepsisinde bulunan Intel menüsünden devre dışı bırakılabilir.

source: Depending on your Windows version, Alt+Shift+Arrow are Windows Magnifier shortcuts to resize the magnified view (lens or docked).
tr: Windows sürümünüze bağlı olarak Alt+Shift+Ok, büyütülmüş görünümü (mercek veya sabitlenmiş) yeniden boyutlandırmak için kullanılan Windows Büyüteç kısayollarıdır. Büyüteç etkinken (tam ekran modunda bile), bu kısayollar Büyüteç tarafından yakalanır ve daha önce NVDA+F2'ye bassanız bile uygulamaya aktarılamaz. Mevcut uygulamada bu kısayolları kullanmak için Büyüteç'ten (Windows+Escape) çıkmanız ve sonra (Windows++) yeniden açmanız gerekir. Örneğin, MS word'de başlık seviyesini azaltmak için.

source: When Magnifier is active (even in full screen mode), these shortcuts are captured by Magnifier and cannot be passed to the application, even if you press NVDA+F2 before.
tr: Büyüteç etkin olduğunda (tam ekran modunda bile), bu kısayollar Büyüteç tarafından yakalanır ve önceden NVDA+F2 tuşlarına basmış olsanız bile uygulamaya aktarılamaz.

source: To use these shortcuts in the current application, you need to quit the Magnifier (Windows+Escape) and re-open it after (Windows++).
tr: Bu kısayolları mevcut uygulamada kullanmak için, Büyüteç'i kapatmanız (Windows+Escape) ve ardından yeniden açmanız (Windows++) gerekir.

source: For example in MS word, to decrease title level:
tr: Örneğin MS Word'de başlık seviyesini düşürmek için:

source: Press Windows+Escape to quit Magnifier.
tr: Büyüteç'ten çıkmak için Windows+Escape tuşlarına basın.

source: Press Alt+Shift+RightArrow to decrease current title level.
tr: Mevcut başlık düzeyini azaltmak için Alt+Shift+Sağ Ok tuşlarına basın.

source: Press Windows++ to re-open the Magnifier.
tr: Büyüteç'i yeniden açmak için Windows++ tuşuna basın.

source: For more information about Windows Magnifier's features and shortcuts, you may want to consult the following pages:
tr: Windows Büyüteç'in özellikleri ve kısayolları hakkında daha fazla bilgi için aşağıdaki sayfalara bakmak isteyebilirsiniz:

source: [Use Magnifier to make things on the screen easier to see](https://support.microsoft.com/en-us/help/11542/windows-use-magnifier-to-make-things-easier-to-see)
tr: [Ekrandaki ögelerin daha kolay görülmesini sağlamak için Büyüteç'i kullanın](https://support.microsoft.com/en-us/help/11542/windows-use-magnifier-to-make-things-easier-to-see)

source: [Windows keyboard shortcuts for accessibility][4]
tr: [Erişilebilirlik için Windows klavye kısayolları][4]

source: This add-on has not been tested in multi-screen environment and there are chances that some feature are not working in this environment.
tr: Bu eklenti çoklu ekran ortamında test edilmemiştir ve bazı özelliklerin bu ortamda çalışmama ihtimali vardır.

source: If you are using multi-screen environment and want it to be supported, please contact me to have it implemented.
tr: Çoklu ekran ortamı kullanıyorsanız ve bunun desteklenmesini istiyorsanız, lütfen benimle iletişime geçin.

source: More generally, do not hesitate to contact me on the [GitHub page][3] of this add-on or directly by e-mail.
tr: Daha genel olarak, bu eklentinin [GitHub sayfasından][3] veya doğrudan e-posta yoluyla benimle iletişime geçmekten çekinmeyin.

source: Change log
tr: Sürüm Geçmişi

source: Version 4.2
tr: Sürüm 4.2

source: Magnifier or Color filtering commands will no longer fail if used for the first time with this add-on running.
tr: Büyüteç veya Renk filtreleme komutları, bu eklenti çalışırken ilk kez kullanılırsa artık başarısız olmayacaktır.

source: Version 4.0
tr: Sürüm 4.0
