Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/winMag/*/winMag.po
Languages: fi, pt_pt, ru

source: The Magnifier is not active
fi: Suurennuslasi ei ole käytössä
pt_pt: A lupa não está activa
ru: Лупа не активна

source: Tracking configuration only applicable with docked or full screen view.
fi: Seuranta käytettävissä vain kiinnitetyssä tai koko näytön näkymässä.
pt_pt: Configuração de seguimento aplicável apenas com visualização sob o foco ou em ecrã inteiro.
ru: Конфигурация отслеживания применима только в закреплённом или полноэкранном режимах.

source: Mouse pointer
fi: Hiiren osoitin
pt_pt: Ponteiro do rato
ru: Указатель мыши

source: Keyboard focus
fi: Näppäimistön kohdistus
pt_pt: Foco no teclado
ru: Фокус клавиатуры

source: Text cursor
fi: Tekstin kohdistin
pt_pt: Cursor de texto
ru: Текстовый курсор

source: Toggles on or off caret tracking
fi: Ottaa käyttöön kohdistimen seurannan tai poistaa sen käytöstä
pt_pt: Liga ou desliga o seguimento do cursor de inserção
ru: Переключает отслеживание каретки

source: Toggles on or off focus tracking
fi: Ottaa käyttöön kohdistuksen seurannan tai poistaa sen käytöstä
pt_pt: Alterna o seguimento de focagem com ou sem foco
ru: Переключает отслеживание фокуса

source: Toggles on or off mouse tracking
fi: Ottaa käyttöön hiiren seurannan tai poistaa sen käytöstä
pt_pt: Liga ou desliga o seguimento do rato
ru: Переключает отслеживание мыши

source: Toggles on or off tracking globally
fi: Ottaa seurannan käyttöön tai poistaa sen käytöstä järjestelmänlaajuisesti
pt_pt: Alterna entre o seguimento global ou não
ru: Переключает глобальное отслеживание

source: Toggles on or off smoothing
fi: Ottaa käyttöön pehmennyksen tai poistaa sen käytöstä
pt_pt: Activa ou desactiva o alisamento
ru: Переключает сглаживание

source: Switches between mouse pointer tracking modes (within the edge of the screen or centered on the screen)
fi: Vaihtaa hiiren osoittimen seurannan tilaa (näytön reunojen sisäpuolella tai näytön keskellä)
pt_pt: Alterna entre os modos de seguimento do ponteiro do rato (dentro do limite do ecrã ou centrado no ecrã)
ru: Переключает между режимами отслеживания указателя мыши (в пределах края экрана или по центру экрана)

source: Switches between text tracking modes (within the edge of the screen or centered on the screen)
fi: Vaihtaa tekstin seurannan tilaa (näytön reunojen sisäpuolella tai näytön keskellä)
pt_pt: Comuta entre modos de seguimento de texto (dentro da margem do ecrã ou centrado no ecrã)
ru: Переключает между режимами отслеживания текста (по краям экрана или по центру экрана)

source: Saves the current configuration parameters of the magnifier to NVDA's configuration.
fi: Tallentaa suurennuslasin nykyiset asetukset NVDA:n asetuksiin.
pt_pt: Guarda os parâmetros de configuração atuais da lupa na configuração do NVDA.
ru: Сохраняет текущие параметры конфигурации лупы в конфигурации NVDA.

source: Restores the current configuration parameters of the magnifier from NVDA's configuration.
fi: Palauttaa suurennuslasin nykyiset asetukset NVDA:n asetuksista.
pt_pt: Restaura os parâmetros de configuração atuais da lupa a partir da configuração do NVDA.
ru: Восстанавливает текущие параметры конфигурации лупы из конфигурации NVDA.

source: Moves the magnified view
fi: Siirtää suurennettua näkymää
pt_pt: Desloca a vista ampliada
ru: Перемещает увеличенное представление

source: Moves the mouse cursor in the center of the zoomed view
fi: Siirtää hiirikohdistimen zoomatun näkymän keskelle
pt_pt: Desloca o cursor do rato para o centro da vista ampliada
ru: Перемещает курсор мыши в центр увеличенного представления

source: Switches on or off the mode keeping Windows Magnifier's control window always on top of the other ones.
fi: Ottaa käyttöön tai poistaa käytöstä tilan, joka pitää Windowsin suurennuslasin säädinikkunan aina muiden ikkunoiden päällä.
pt_pt: Ativa ou desactiva o modo que mantém a janela de controlo da Lupa do Windows sempre em cima das outras.
ru: Переключает режим, при котором окно управления экранной лупой Windows всегда находится поверх других окон.

source: Opens Windows Magnifier add-on settings
fi: Avaa Windowsin suurennuslasi -lisäosan asetukset
pt_pt: Abrir as configurações da Lupa do Windows
ru: Открывает настройки дополнения

source: Displays help on Magnifier layer commands
fi: Näyttää suurennuslasin komentokerroskomentojen ohjeen
pt_pt: Mostra a ajuda dos comandos em camada da lupa
ru: Показывает справку по командам слоя лупы

source: Multi-screen setup not yet supported. Please contact the add-on author to have it implemented.
fi: Moninäyttöympäristöä ei vielä tueta. Ota yhteyttä lisäosan tekijään tuen toteuttamiseen liittyen.
pt_pt: Este comando ainda não está disponível em ambiente multi-ecrãs. Por favor contacte o autor do extra para que este seja implementado.
ru: Многоэкранная настройка пока не поддерживается. Пожалуйста, свяжитесь с автором дополнения, чтобы это было реализовано.

source: Windows Magnifier layer commands entry point.
fi: Windowsin suurennuslasin komentokerroskomentojen aloituskohta.
pt_pt: Os comandos em camada da lupa controlam o ponto de entrada.
ru: Точка входа команд слоя лупы Windows.

source: Edge of the screen.
fi: Näytön reuna
pt_pt: Dentro das extremidades do ecrã.
ru: Край экрана.

source: Widht
fi: Leveys
pt_pt: Largura
ru: Ширина

source: Height
fi: Korkeus
pt_pt: Altura
ru: Высота

source: Resizing lens.
fi: Muutetaan linssin kokoa.
pt_pt: Redimensionamento da Lente.
ru: Изменение размера объектива.

source: Resizing not available in full screen.
fi: Koon muuttaminen ei käytettävissä koko näytön tilassa.
pt_pt: O redimensionamento não está disponível em ecrã inteiro.
ru: Изменение размера недоступно в полноэкранном режиме.

source: Caret tracking on
fi: Kohdistimen seuranta käytössä
pt_pt: Cursor de inserção ligado
ru: Отслеживание каретки включено

source: Caret tracking off
fi: Kohdistimen seuranta ei käytössä
pt_pt: Cursor de inserção desligado
ru: Отслеживание каретки выключено

source: Focus tracking on
fi: Kohdistuksen seuranta käytössä
pt_pt: Seguimento do foco ligado
ru: Отслеживание фокуса включено

source: Focus tracking off
fi: Kohdistuksen seuranta ei käytössä
pt_pt: Seguimento do foco desligado
ru: Отслеживание фокуса выключено

source: Mouse tracking on
fi: Hiiren seuranta käytössä
pt_pt: Seguimento do rato ligado
ru: Отслеживание мыши включено

source: Mouse tracking off
fi: Hiiren seuranta ei käytössä
pt_pt: Seguimento do rato desligado
ru: Отслеживание мыши выключено

source: Tracking on - {trackingTypes}
fi: Seuranta käytössä - {trackingTypes}
pt_pt: Rastreio em - {trackingTypes}
ru: Отслеживание включено - {trackingTypes}

source: Tracking off
fi: Seuranta ei käytössä
pt_pt: Seguimento desligado
ru: Отслеживание выключено

source: Smoothing on
fi: Pehmennys käytössä
pt_pt: Alisamento ligado
ru: Сглаживание включено

source: Smoothing off
fi: Pehmennys ei käytössä
pt_pt: Alisamento desligado
ru: Сглаживание выключено

source: Feature unavailable in this version of Windows.
fi: Ominaisuus ei käytettävissä tässä Windowsin versiossa.
pt_pt: Funcionalidade indisponível nesta versão do windows.
ru: Функция недоступна в этой версии Windows.

source: Mouse pointer tracking mode applies only to full screen view.
fi: Hiiren osoittimen seurantatila käytettävissä vain koko näytön näkymässä.
pt_pt: O modo de seguimento do rato aplica-se apenas na vista de ecrã inteiro.
ru: Режим отслеживания указателя мыши применяется только к полноэкранному режиму просмотра.

source: Centered on the screen
fi: Näytön keskellä
pt_pt: Centrado no ecrã
ru: По центру экрана

source: Within the edge of the screen
fi: Näytön reunojen sisäpuolella
pt_pt: Dentro da margem do ecrã
ru: В пределах границы экрана

source: Text cursor tracking mode applies only to full screen view.
fi: Tekstin kohdistimen seurantatila käytettävissä vain koko näytön näkymässä.
pt_pt: O modo de seguimento do cursor de texto aplica-se apenas à visualização em ecrã total.
ru: Режим отслеживания текстового курсора применяется только к полноэкранному режиму просмотра.

source: Magnifier config saved.
fi: Suurennuslasin asetukset tallennettu.
pt_pt: Configuração da lupa guardada.
ru: Конфигурация лупы сохранена.

source: Magnifier config restored.
fi: Suurennuslasin asetukset palautettu.
pt_pt: Configuração da lupa restaurada.
ru: Конфигурация лупы восстановлена.

source: Move mouse to view command available only on Windows 8 and above in full screen mode.
fi: Siirrä hiiri näkymään -komento käytettävissä koko näytön tilassa vain Windows 8:ssa ja uudemmissa
pt_pt: Mover o rato para ver comando disponível apenas no Windows 8 e superior no modo de ecrã completo.
ru: Команда перемещения мыши для просмотра доступна только в полноэкранном режиме в Windows 8 и выше .

source: Move mouse to view command not available in full screen mode while screen curtain is active.
fi: Siirrä hiiri näkymään -komento ei käytettävissä koko näytön tilassa näyttöverhon ollessa käytössä
pt_pt: O comando Mover o rato para ver não está disponível no modo de ecrã inteiro enquanto a cortina de ecrã estiver ativa.
ru: Команда перемещения мыши для просмотра недоступна в полноэкранном режиме при активном затемнении экрана.

source: Move mouse to view not implemented for docked view
fi: Siirrä hiiri näkymään -komentoa ei toteutettu kiinnitetylle näkymälle
pt_pt: Mover o rato para ver não implementado para vista focada
ru: Команда перемещения мыши на представление не реализована для закреплённого представления

source: Command only supported in installed versions of NVDA.
fi: Komentoa tuetaan vain NVDA:n asennetussa versiossa
pt_pt: Comando suportado apenas em versões instaladas do NVDA.
ru: Команда поддерживается только в установленных версиях NVDA.

source: Magnifier controls always on top.
fi: Suurennuslasin säätimet aina päällimmäisenä
pt_pt: Controlos da lupa sempre no topo.
ru: Элементы управления лупой всегда находятся сверху.

source: Magnifier controls not on top.
fi: Suurennuslasin säätimet eivät päällimmäisenä
pt_pt: Os controlos da lupa não estão por cima.
ru: Элементы управления лупой расположены не сверху.

source: Command unavailable on this screen.
fi: Komento ei käytettävissä tässä näytössä.
pt_pt: Comando indisponível neste ecrã.
ru: Команда недоступна на этом экране.

source: Magnifier on
fi: Suurennuslasi käytössä
pt_pt: Lupa ligada
ru: Лупа включена

source: Magnifier off
fi: Suurennuslasi ei käytössä
pt_pt: Lupa desactivada
ru: Лупа отключена

source: Color inversion on
fi: Värin inversio käytössä
pt_pt: Inversão de cor ligado
ru: Инверсия цвета включена

source: Color inversion off
fi: Värin inversio ei käytössä
pt_pt: Inversão de cor desligado
ru: Инверсия цвета выключена

source: Docked
fi: Kiinnitetty
pt_pt: Ancorada
ru: Закреплено

source: Full screen
fi: Koko näyttö
pt_pt: Ecrã inteiro
ru: Полноэкранный режим

source: Lens
fi: Linssi
pt_pt: Lente
ru: Объектив

source: Color filtering enabled
fi: Värisuodattimet käytössä
pt_pt: Filtragem de cores activada
ru: Фильтрация цвета включена

source: Color filtering: {cf}
fi: Värisuodattimet: {cf}
pt_pt: Filtragem de cores: {cf}
ru: Фильтрация цвета: {cf}

source: Color filtering disabled
fi: Värisuodattimet poistettu käytöstä
pt_pt: Filtragem de cores desactivada
ru: Фильтрация цвета отключена

source: Windows Magnifier layered commands
fi: Windowsin suurennuslasin komentokerroskomennot
pt_pt: Comandos em camada da Lupa
ru: Многослойные команды Лупы Windows

source: Magnifier layer commands: {cmdList}
fi: Suurennuslasin komentokerroskomennot: {cmdList}
pt_pt: Comandos em camada da lupa: {cmdList}
ru: Команды слоя лупы: {cmdList}

source: Grayscale
fi: Harmaasävy
pt_pt: Escala de cinza
ru: Оттенки серого

source: Inverted
fi: Käänteinen
pt_pt: Invertido
ru: Инвертированные (обратить цвета на дисплее)

source: Grayscale inverted
fi: Käänteinen harmaasävy
pt_pt: Escala de cinzentos invertida
ru: Инвертированные оттенки серого

source: Red-green
fi: Punavihreä
pt_pt: Vermelho-verde
ru: Красный-зеленый (нарушенное восприятие зеленого, дейтеранопия)

source: Green-red
fi: Vihreä-punainen
pt_pt: Verde-vermelho
ru: Красный-зеленый (нарушенное восприятие красного, протанопия)

source: Blue-yellow
fi: Sinikeltainen
pt_pt: Azul-amarelo
ru: Синий-желтый (тританопия)

source: Windows Magnifier
fi: Windowsin suurennuslasi
pt_pt: Lupa do Windows
ru: Лупа Windows

source: Off
fi: Ei käytössä
pt_pt: Desligado
ru: Выключено

source: With speech
fi: Puheella
pt_pt: Com voz
ru: Речь

source: With tones
fi: Äänimerkeillä
pt_pt: Com tons
ru: Сигналы

source: Never
fi: Ei koskaan
pt_pt: Nunca
ru: Никогда

source: Only when not in table
fi: Vain, kun ei taulukossa
pt_pt: Só quando não está numa tabela
ru: Только когда не в таблице

source: Always
fi: Aina
pt_pt: Sempre
ru: Всегда

source: Report view &moves:
fi: Ilmoita näkymän &siirtäminen:
pt_pt: Relatório Visualizar movimentos:
ru: Сообщать о &перемещениях представления:

source: Report screen &edges:
fi: Ilmoita näytön r&eunat:
pt_pt: Ecrã de relatório &edges:
ru: Сообщать о &краях экрана:

source: Volume of the tones indicating the &position of the view:
fi: Näkymän &sijainnin ilmoittavien äänimerkkien voimakkuus:
pt_pt: Volume dos tons que indicam a &posição da vista:
ru: &Громкость звуковых сигналов, указывающих положение точки обзора:

source: Report &turn on or off
fi: Ilmoita &käyttöönotto ja käytöstä poistaminen
pt_pt: Indicar &ligar ou desligar
ru: &Сообщать о включении или выключении

source: Report &zoom
fi: Ilmoita &zoomauksen taso
pt_pt: Indicar &zoom
ru: Сообщать об &увеличении

source: Report color &inversion
fi: Ilmoita värin &inversio
pt_pt: Indicar &inversão de cor
ru: Сообщать об инверсии &цвета

source: Report &view change
fi: Ilmoita &näkymän vaihtaminen
pt_pt: Indicar alteração de &vista
ru: Сообщать об изменении &представления

source: Report &lens or docked window resizing
fi: Ilmaise &linssi- tai kiinnitetyn ikkunan koon muuttaminen
pt_pt: Indica a &lente ou o redimensionamento da janela encaixada
ru: &Сообщать изменение размера объектива или закреплённого окна

source: In &documents and list views, pass control+alt+arrows shortcuts to Windows Magnifier:
fi: Välitä Ctrl+Alt+Nuolet-pikanäppäimet &asiakirjoissa ja luettelonäkymissä Windowsin suurennuslasille:
pt_pt: Na vista de &documentos e de listas, pressionar controlo+alt+setas são os atalhos para a lupa:
ru: Передавать сочетания клавиш control+alt+стрелки в Windows Magnifier в &документах и списках:

source: &Keep Windows Magnifier command window always on top
fi: &Pidä Windows suurennuslasin komentoikkuna aina päällimmäisenä
pt_pt: &Mantenha a janela de comando da Lupa do Windows sempre no topo
ru: &Держать командное окно Лупы Windows всегда сверху

source: Report &color filter
fi: Ilmoita väris&uodattimien tila
pt_pt: Relatório e filtro de cor
ru: Сообщать о &цветных фильтрах

source: This add-on improves the use of Windows Magnifier with NVDA.
fi: Tämä lisäosa parantaa Windowsin suurennuslasin käyttöä NVDA:n kanssa.
pt_pt: Este extra melhora a utilização do Windows Magnifier com NVDA.
ru: Это дополнение улучшает использование экранной лупы Windows с NVDA.
