Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/winMag/*/winMag.xliff
Languages: tr

source: The filter enabled by the toggle color filter command (`Windows+Control+C`) can now be reported; this toggle command should have been previously enabled in Windows Accessibility settings.
tr: Renk filtresini değiştir komutu (`Windows+Control+C`) tarafından etkinleştirilen filtre artık duyurulabilir; bu değiştirme komutunun daha önce Windows Erişilebilirlik ayarlarında etkinleştirilmiş olması gerekir.

source: Compatibility with NVDA 2025.1.
tr: NVDA 2025.1 ile uyumluluk.

source: Version 3.7
tr: Sürüm 3.7

source: Compatibility with NVDA 2024.1.
tr: NVDA 2024.1 ile uyumluluk.

source: Version 3.6
tr: Sürüm 3.6

source: Fixed erroneous compatibility range.
tr: Hatalı uyumluluk aralığı düzeltildi.

source: Version 3.5
tr: Sürüm 3.5

source: Prepares compatibility with NVDA 2024.1.
tr: NVDA 2024.1 ile uyumluluğu hazırlar.

source: Addresses potential security issues related to [GHSA-xg6w-23rw-39r8][8] when using the add-on with older versions of NVDA. However, it is recommended to use NVDA 2023.3.3 or higher.
tr: Eklentiyi NVDA'nın eski sürümleriyle kullanırken [GHSA-xg6w-23rw-39r8][8] ile ilgili olası güvenlik sorunlarını giderir. Ancak NVDA 2023.3.3 veya üzerini kullanmanız tavsiye edilir.

source: Note: From now on, translation updates will not appear anymore in the change log.
tr: Not: Artık çeviri güncellemeleri değişiklik günlüğünde görünmeyecek.

source: Version 3.4
tr: Sürüm 3.4

source: The "move mouse to view" command works again
tr: "Görüntülemek için fareyi hareket ettirin" komutu yeniden çalışıyor

source: Updated localizations.
tr: Yerelleştirmeler güncellendi.

source: Version 3.3
tr: Sürüm 3.3

source: Compatibility reduced to NVDA 2019.2.1 and beyond.
tr: Uyumluluk NVDA 2019.2.1 ve sonraki sürümlere düşürüldü. NVDA 2018.3 ile son uyumlu sürümler [3.2][7] (kısmen uyumlu) ve [1.1][6]'dır (tamamen uyumlu)

source: The last compatible versions with NVDA 2018.3 are the [3.2][7] (partially compatible) and [1.1][6] (fully compatible)
tr: NVDA 2018.3 ile son uyumlu sürümler [3.2] [7] (kısmen uyumlu) ve [1.1] [6] (tamamen uyumlu)

source: Fixed a bug in the settings panel with NVDA 2019.2.1.
tr: NVDA 2019.2.1'in ayarlar panelindeki bir hata düzeltildi.

source: Version 3.2
tr: Sürüm 3.2

source: Removed the dev channel.
tr: Geliştirici kanalı kaldırıldı.

source: Updated localizations.
tr: Yerelleştirmeler güncellendi.

source: Version 3.1
tr: Sürüm 3.1

source: Fixed an issue preventing the Magnifier's command window from being restored on top.
tr: Büyüteç'in komut penceresinin en üste geri yüklenmesini engelleyen bir sorun düzeltildi.

source: Fixed an issue preventing the add-on to run on NVDA 2019.2.1.
tr: Eklentinin NVDA 2019.2.1'de çalışmasını engelleyen bir sorun düzeltildi.

source: Updated localizations.
tr: Yerelleştirmeler güncellendi.

source: Version 3.0
tr: Sürüm 3.0

source: Pressing the zoom buttons in the Magnifier window (with the keyboard) now reports the new zoom level.
tr: Büyüteç penceresinde (klavye ile) yakınlaştırma düğmelerine basmak artık yeni yakınlaştırma seviyesini bildiriyor.

source: The parameter controlling if Magnifier control window remains always on top is now stored in configuration;
tr: Büyüteç kontrol penceresinin her zaman üstte kalıp kalmayacağını kontrol eden parametre artık yapılandırmada saklanıyor;

source: this means that this parameter is remembered when restarting NVDA and can be enabled or not depending on the active profile.
tr: Bu, NVDA yeniden başlatıldığında bu parametrenin hatırlandığı ve etkin profile bağlı olarak etkinleştirilebileceği veya etkinleştirilemeyeceği anlamına gelir.

source: Fixed a bug causing unexpected screen curtain de-activation when using move to view or move view commands.
tr: Görünüme taşı veya görünümü taşı komutlarını kullanırken beklenmedik ekran perdesinin devre dışı kalmasına neden olan bir hata düzeltildi.

source: Option alwaysOnTop setting will now be honoured also when changing magnification mode.
tr: Her zaman Üstte seçeneği ayarı artık büyütme modu değiştirilirken de dikkate alınacaktır.

source: Added ability to save and restore Windows Magnifier's config in NVDA's config.
tr: Windows Büyüteç'in yapılandırmasını NVDA'nın yapılandırmasına kaydetme ve geri yükleme yeteneği eklendi.

source: Compatibility with NVDA 2023.1.
tr: NVDA 2023.1 ile uyumluluk.

source: Clarify which type of tracking is re-enabled when tracking is toggled on again.
tr: İzleme tekrar açıldığında hangi izleme türünün yeniden etkinleştirileceğini netleştirin.

source: Updated localizations.
tr: Yerelleştirmeler güncellendi.

source: Version 2.0
tr: Sürüm 2.0

source: The view can be moved with arrows while in Windows Magnifier layer.
tr: Görünüm, Windows büyüteç katmanındayken oklarla taşınabilir.

source: Capability to keep the Magnifier commands Window always on top or not.
tr: Büyüteç komutları Penceresini her zaman üstte tutma veya tutmama özelliği.

source: Added "Report screen edges" feature.
tr: "Ekran kenarlarını bildir" özelliği eklendi.

source: Volume setting of tones when using move view commands.
tr: Hareketli görünüm komutlarını kullanırken tonların ses seviyesi ayarı.

source: Reporting view moves and mouse to view commands are now supported in Lens mode.
tr: Görünüm hareketlerini bildirmek ve görüntülemek için fare komutları artık Mercek modunda desteklenmektedir.

source: Compatibility with NVDA 2022.1.
tr: NVDA 2022.1 ile uyumluluk.

source: Fixed a bug that sometimes incorrectly reported that the Magnifier was not working upon script call.
tr: Kod çağrıldığında Büyüteç'in çalışmadığını bazen yanlış bildiren bir hata düzeltildi.

source: The release is now performed thanks to a GitHub action instead of appVeyor.
tr: Sürüm artık appVeyor yerine bir GitHub eylemi sayesinde gerçekleştiriliyor.

source: Updated localizations.
tr: Yerelleştirmeler güncellendi.

source: Version 1.1
tr: Sürüm 1.1

source: Added localizations.
tr: Yerelleştirmeler eklendi.

source: Version 1.0
tr: Sürüm 1.0

source: Initial release.
tr: İlk sürüm.
