Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/Access8Math/*/Access8Math.po
Languages: ru, tr

source: right arrow
ru: стрелка вправо
tr: sağ ok

source: left right arrow
ru: стрелка влево и вправо
tr: sol sağ ok

source: up arrow
ru: стрелка вверх
tr: yukarı ok

source: down arrow
ru: стрелка вниз
tr: aşağı ok

source: up down arrow
ru: стрелка вверх и вниз
tr: yukarı aşağı ok

source: dot product
ru: скалярное произведение векторов
tr: nokta çarpımı

source: integral
ru: интеграл

source: nabla
ru: набла

source: partial derivative
ru: частная производная
tr: kısmi türev

source: derivative
ru: производная
tr: türev

source: differential
ru: дифференциал
tr: diferansiyel

source: combination
ru: сочетание
tr: kombinasyon

source: permutation
ru: перестановка
tr: permütasyon

source: combination with repetition
ru: сочетание с повторением
tr: tekrarlı kombinasyon

source: unordered selection
ru: неупорядоченный выбор
tr: sırasız seçim

source: fractions
ru: обыкновенные дроби
tr: kesirler

source: square root
ru: квадратный корень
tr: kare kök

source: root
ru: корень
tr: kök

source: summation
ru: суммирование
tr: toplama

source: vector
ru: вектор
tr: vektör

source: limit
ru: предел

source: logarithm
ru: логарифм
tr: logaritma

source: arc
ru: дуга
tr: yay

source: triangle
ru: треугольник
tr: üçgen

source: angle
ru: угол
tr: açı

source: degree
ru: градус
tr: derece

source: circle
ru: окружность
tr: daire

source: parallel
ru: параллельно
tr: paralel

source: perpendicular
ru: перпендикулярно
tr: dik

source: square
ru: квадратный корень
tr: kare

source: small diamond
ru: маленький ромб
tr: küçük elmas

source: large diamond
ru: большой ромб
tr: büyük elmas

source: because
ru: поскольку
tr: çünkü

source: therefore
ru: следовательно
tr: o halde

source: if and only if
ru: тогда и только тогда
tr: ancak ve ancak

source: implies
ru: подразумевает
tr: ima eder

source: implied by
ru: подразумевается
tr: tarafından ima edilen

source: times
ru: умножение
tr: çarpma

source: divide
ru: определитель
tr: bölme

source: plus-minus sign
ru: знак плюс-минус
tr: artı eksi işareti

source: modulus
ru: модуль
tr: modülüs

source: line segment
ru: отрезок
tr: doğru parçası

source: line
ru: прямая
tr: doğru

source: ray
ru: луч
tr: ışın

source: binomial coefficient
ru: биномиальный коэффициент
tr: binom katsayısı

source: simultaneous equations
ru: система уравнений
tr: eşzamanlı denklemler

source: infty
ru: бесконечность
tr: elli

source: repeating decimal
ru: периодическая десятичная дробь
tr: tekrar eden ondalık

source: greater than or equal to
ru: больше или равно
tr: büyük veya eşit

source: less than or equal to
ru: меньше или равно
tr: küçük veya eşit

source: not equal to
ru: не равно
tr: eşit değil

source: approximate
ru: приблизительно
tr: yaklaşık

source: full equal
ru: конгруэнтно
tr: tam eşit

source: similar
ru: подобно
tr: benzer

source: approximately equal to
ru: приблизительно равно
tr: yaklaşık olarak eşittir

source: proportional to
ru: пропорционально
tr: orantılı

source: belong to
ru: принадлежит
tr: ait

source: not belong to
ru: не принадлежит
tr: ait değil

source: include element
ru: включает
tr: dahil olan öğe

source: not include element
ru: не включает
tr: dahil olmayan öğe

source: lie in
ru: подмножество
tr: doğurma

source: properly lie in
ru: подмножество но не равно
tr: düzgün doğurmak

source: not lie in
ru: не подмножество
tr: doğurmamak

source: include
ru: надмножество
tr: dahil etmek

source: properly include
ru: надмножество но не равно
tr: uygun şekilde dahil etmek

source: not include
ru: не надмножество
tr: hariç

source: intersection set
ru: пересечение множеств
tr: kesişim kümesi

source: union set
ru: объединение множеств
tr: birleşim kümesi

source: difference set
ru: разность множеств
tr: fark kümesi

source: complement
ru: дополнение
tr: tamamlayıcı

source: empty set
ru: пустое множество
tr: boş küme

source: natural number
ru: множество натуральных чисел
tr: doğal sayı

source: real number
ru: множество действительных чисел
tr: gerçek sayı

source: for all
ru: для всех
tr: hepsi için

source: exists
ru: существует
tr: vardır

source: sine
ru: синус
tr: sinüs

source: cosine
ru: косинус
tr: kosinüs

source: tangent
ru: тангенс
tr: tanjant

source: cotangent
ru: котангенс
tr: kotanjant

source: secant
ru: секанс
tr: sekant

source: cosecant
ru: косеканс
tr: kosekant

source: arcsine
ru: арксинус
tr: arksinüs

source: arccosine
ru: арккосинус
tr: arkkosinüs

source: arctangent
ru: арктангенс
tr: arktanjant

source: hyperbolic sine
ru: гиперболический синус
tr: hiperbolik sinüs

source: hyperbolic cosine
ru: гиперболический косинус
tr: hiperbolik kosinüs

source: hyperbolic tangent
ru: гиперболический тангенс
tr: hiperbolik tanjant

source: hyperbolic cotangent
ru: гиперболический котангенс
tr: hiperbolik kotanjant

source: floor
ru: округление в меньшую сторону
tr: taban fonksiyonu

source: ceil
ru: округление в большую сторону
tr: tavan fonksiyonu

source: alpha
ru: альфа
tr: alfa

source: beta
ru: бета

source: gamma
ru: гамма
tr: gama

source: delta
ru: дэльта

source: epsilon
ru: эпсилон

source: zeta
ru: дзета

source: eta
ru: и

source: theta
ru: тета
tr: teta

source: iota
ru: йота

source: kappa
ru: каппа

source: lambda
ru: лямбда

source: mu
ru: мю

source: nu
ru: ню

source: xi
ru: кси

source: omicron
ru: омикрон
tr: omikron

source: pi
ru: пи

source: rho
ru: ро

source: sigma
ru: сигма

source: tau
ru: тау

source: upsilon
ru: ипсилон

source: phi
ru: фи

source: chi
ru: хи

source: psi
ru: пси

source: omega
ru: омега

source: Allows access math content written by MathML ; Allows write math content by LaTeX
ru: Предоставляет доступ к математическим выражениям, написанным на MathML; позволяет записывать математические выражения с помощью LaTeX
tr: MathML ile yazılan matematik içeriğine erişime sağlar ve LaTeX ile matematik içeriği oluşturmaya izin verir

source: f{shortcut}
tr: {shortcut}f
