Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/Access8Math/*/Access8Math.po
Languages: ru, tr

source: Access8Math Version: {addonVersion} URL: https://addons.nvda-project.org/addons/access8math.en.html Copyright (C) {copyrightFirstYear}-{copyrightLastYear} Access8Math Contributors Access8Math is covered by the GNU General Public License (Version 2). You are free to share or change this software in any way you like as long as it is accompanied by the license and you make all source code available to anyone who wants it. This applies to both original and modified copies of this software, plus any derivative works. It can be viewed online at: https://www.gnu.org/licenses/old-licenses/gpl-2.0.html
ru: Access8Math Версия: {addonVersion} Сайт: https://addons.nvda-project.org/addons/access8math.en.html Авторское право (C) {copyrightFirstYear}-{copyrightLastYear} команда разработчиков Access8Math Access8Math распространяется под универсальной общественной лицензией GNU (the GNU General Public License) (Версия 2). Вы можете свободно распространять и изменять данный продукт любым способом при условии, что он сопровождается лицензией и что вы предоставляете исходный код всем желающим. Это относится как к оригинальным, так и к изменённым копиям этого продукта, а также к любым производным продуктам. Лицензия доступна в Интернете по адресу: https://www.gnu.org/licenses/old-licenses/gpl-2.0.html
tr: Access8Math Sürüm: {addonVersion} Web Sayfası: https://addons.nvda-project.org/addons/access8math.en.html Telif hakkı (C) {copyrightFirstYear}-{copyrightLastYear} Access8Math Katkıda Bulunanlar Access8Math, GNU Genel Kamu Lisansı (Sürüm 2) kapsamındadır. Lisansla birlikte verildiği ve tüm kaynak kodlarının isteyen herkese açık olduğu sürece bu yazılımı istediğiniz şekilde paylaşmakta veya değiştirmekte özgürsünüz. Bu, bu yazılımın hem orijinal hem de değiştirilmiş kopyaları ve ayrıca türev çalışmalar için geçerlidir.. Çevrimiçi olarak şu adresten görüntülenebilir: https://www.gnu.org/licenses/old-licenses/gpl-2.0.html

source: Open virtual context menu
ru: Открывает виртуальное контекстное меню
tr: Sanal bağlam menüsünü aç

source: get path failed
ru: не удалось получить путь
tr: yol alınamadı

source: Pop up the editor
ru: Открывает редактор
tr: Düzenleyiciyi aç

source: Access8Math interaction window
ru: Окно взаимодействия с формулой
tr: Access8Math etkileşim penceresi

source: Access8Math Editor
ru: Редактор Access8Math
tr: Access8Math Düzenleyici

source: &Editor...
ru: &Редактор...
tr: Düz&enleyici...

source: &Settings...
ru: &Настройки...
tr: &Ayarlar...

source: Symbol Speech Dictionary...
ru: Речевой словарь символов...
tr: Sembol Konuşma Sözlüğü...

source: Math Rules Speech Output...
ru: Математические правила вывода речи...
tr: Matematik Kuralları Konuşma Çıkışı...

source: Symbol Braille Dictionary...
ru: Словарь символов Брайля...
tr: Sembol Braille Sözlüğü...

source: Math Rules Braille Output...
ru: Математические правила вывода Брайля...
tr: Matematik Kuralları Braille Çıkışı...

source: Add New Language...
ru: Добавить новый язык...
tr: Yeni Dil Ekle...

source: &Export Localization Files...
ru: &Экспортировать файлы локализации...
tr: &Yerelleştirme Dosyalarını Dışa Aktar...

source: &Localization
ru: &Локализация
tr: &Yerelleştirme

source: &Clean Workspace...
ru: &Очистить рабочую область...
tr: Çalışma Alanı'nı &Temizle...

source: &About...
ru: О дополн&ении...
tr: H&akkında...

source: Switch math speech reader
ru: Изменяет обработчик речи для математических выражений
tr: Matematik konuşma okuyucusunu değiştir

source: Math speech reader switch to %s
ru: Обработчик речи для математических выражений изменён на %s
tr: Matematik konuşma okuyucu geçişi %s

source: Switch math Braille reader
ru: Изменяет обработчик Брайля для математических выражений
tr: Matematik Braille okuyucuyu değiştir

source: Math braille reader switch to %s
ru: Обработчик Брайля для математических выражений изменён на %s
tr: Matematik braille okuyucu geçişi %s

source: Switch math interact reader
ru: Изменяет обработчик взаимодействия с математическими выражениями
tr: Matematik etkileşimli okuyucuyu değiştir

source: Math interact reader switch to %s
ru: Обработчик взаимодействия с математическими выражениями изменён на %s
tr: Matematik etkileşimli okuyucu geçişi %s

source: Export localization files...
ru: Экспортировать файлы локализации...
tr: Yerelleştirme dosyalarını dışa aktar...

source: Workspace has already been cleaned
ru: Рабочая область уже очищена
tr: Çalışma alanı temizlendi

source: Clean Workspace
ru: Очистить рабочую область
tr: Çalışma Alanı'nı temizle

source: About Access8Math
ru: О дополнении Access8Math
tr: Access8Math hakkında

source: Math Reader
ru: Обработчик математических выражений
tr: Matematik Okuyucu

source: &Speech source:
ru: Обработчик &речи:
tr: &Konuşma kaynağı:

source: &Braille source:
ru: Обработчик &Брайля:
tr: &Braille kaynağı:

source: Inter&act source:
ru: Обработчик &взаимодействия:
tr: &Etkileşim kaynağı:

source: Reading
ru: Чтение
tr: Okuma

source: &Language:
ru: &Язык:
tr: Di&l:

source: Analyze mathematical meaning of content
ru: Анализировать значение математического содержимого
tr: İçeriğin matematiksel anlamını analiz et

source: Reading of auto-generated meaning in interaction navigation mode
ru: Читать автоматически созданные описания элементов при навигации по формуле
tr: Etkileşim gezinme modunda otomatik oluşturulan anlamı oku

source: Use tone indicate to no move in interaction navigation mode
ru: Использовать звуковую индикацию для обозначения крайнего элемента
tr: Etkileşim gezinme modunda hareket edilemediğinde Ses kullan

source: &Item interval time:
ru: &Длительность паузы между элементами:
tr: &Öğe zaman aralığı:

source: Writing
ru: Написание
tr: Yazma

source: Activate command gesture at startup
ru: Активировать горячие клавиши для вставки команд при запуске
tr: Başlangıçta komut hareketini etkinleştir

source: Activate block navigate gesture at startup
ru: Активировать горячие клавиши для навигации по блокам при запуске
tr: Başlangıçta blok gezinme hareketini etkinleştir

source: Activate shortcut gesture at startup
ru: Активировать быстрые горячие клавиши при запуске
tr: Başlangıçta kısayol hareketini etkinleştir

source: Use audio indicate to switching of browse navigation mode
ru: Использовать звуковую индикацию при переключении режима обзора
tr: Gezinme gözatma modunu değiştirmek için ses kullan

source: Left/Right arrow key allow of moving across line in browse navigation mode
ru: Разрешить перемещение по строке с помощью стрелок влево-вправо в режиме обзора
tr: Sol/Sağ ok tuşu, gezinme gözatma modunda satırda ilerlemeye izin verir

source: Document
ru: Документ
tr: Belge

source: &LaTeX delimiter:
ru: Отделитель &LaTeX:
tr: &LaTeX sınırlayıcı:

source: bracket
ru: скобки
tr: parantez

source: dollar
ru: знаки доллара
tr: dolar

source: &Nemeth delimiter:
ru: Отделитель кода &Немета:
tr: &Nemeth sınırlayıcı:

source: at
ru: собака
tr: de

source: HTML &document display:
ru: &Текст в HTML:
tr: &HTML belge görünümü:

source: text
ru: обычный текст
tr: metin

source: HTML &math display:
ru: &Формулы в HTML:
tr: HTML ve matematik görünümü:

source: block
ru: блоком
tr: blok

source: inline
ru: встроенные
tr: çizgide

source: HTML font color:
ru: Цвет шрифта в HTML:
tr: HTML yazı tipi rengi:

source: white
ru: белый
tr: beyaz

source: black
ru: чёрный
tr: siyah

source: HTML background color:
ru: Цвет фона в HTML:
tr: HTML arka plan rengi:

source: Rule
ru: Правило
tr: Kural

source: Simplified subscript and superscript
ru: Упрощённые верхний и нижний индексы
tr: Basitleştirilmiş alt simge ve üst simge

source: Simplified subscript
ru: Упрощённый нижний индекс
tr: Basitleştirilmiş alt simge

source: Simplified superscript
ru: Упрощённый верхний индекс
tr: Basitleştirilmiş üst simge

source: Simplified underscript and overscript
ru: Упрощённые строгие индексы
tr: Basitleştirilmiş alt simge ve üst simge

source: Simplified underscript
ru: Упрощённый индекс строго снизу
tr: Basitleştirilmiş alt simge

source: Simplified overscript
ru: Упрощённый индекс строго сверху
tr: Basitleştirilmiş üst simge

source: Simplified fraction
ru: Упрощённая обыкновенная дробь
tr: Basitleştirilmiş kesir

source: Simplified square root
ru: Упрощённый квадратный корень
tr: Basitleştirilmiş karekök

source: Power
ru: Степень
tr: Kuvvet

source: Square power
ru: Квадратная степень
tr: Kare kuvvet

source: Cube power
ru: Кубическая степень
tr: Küp kuvvet

source: Set
ru: Множество
tr: Küme

source: Absolute value
ru: Модуль
tr: Mutlak değer

source: Matrix
ru: Матрица
tr: Matris

source: Determinant
ru: Определитель

source: Integer and fraction
ru: Смешанное число
tr: Tamsayı ve kesir

source: Access8Math Settings
ru: Настройки Access8Math
tr: Access8Math Ayarları

source: normal configuration
ru: конфигурация по умолчанию
tr: normal yapılandırma

source: Add Symbol
ru: Добавить символ
tr: Sembol Ekle

source: &Symbol:
ru: &Символ:
tr: &Sembol:

source: Symbol Speech Dictionary
ru: Словарь символов Речи
tr: Sembol Konuşma Sözlüğü

source: Symbol Braille Dictionary
ru: Словарь символов Брайля
tr: Sembol Braille Sözlüğü

# speechSymbols
source: &Filter by:
ru: &Фильтровать:
tr: Şuna göre &filtrele:

source: &Symbols
ru: &Символы
tr: &Semboller

source: Symbol
ru: Символ
tr: Sembol

source: Replacement
ru: Замена
tr: Yerine

source: Change selected symbol
ru: Изменить выбранный символ
tr: Seçilen sembolü değiştir

source: &Replacement
ru: &Замена
tr: Ye&rine

source: &Add
ru: &Добавить
tr: &ekle

source: Re&move
ru: &Удалить
tr: Kaldı&r

source: &Restore default
ru: &Восстановить по умолчанию
tr: &Varsayılana geri yükle

source: &Import
ru: &Импорт
tr: &İçe aktar

source: Exp&ort
ru: &Экспорт
tr: &Dışa aktar

source: Symbol "%s" is already present.
ru: Символ "%s" уже присутствует.
tr: "%s" sembolü zaten var.

source: Error
ru: Ошибка
tr: Hata

source: Import file...
ru: Импортировать файл...
tr: Dosyayı içe aktar...

source: Export file...
ru: Экспортировать файл...
tr: Dosyayı dışa aktar...

source: Edit Math Rule Entry
ru: Редактировать математическое правило
tr: Matematik Kuralı Girişini düzenle

source: &Description
ru: &Описание
tr: &Tanım

source: Description
ru: Описание
tr: Tanım

source: Serialized ordering
ru: Последовательная сортировка
tr: Seri sıralama

source: Ordering %d
ru: Сортировка %d
tr: %d sıralanıyor

source: Child
ru: Дочерний элемент
tr: Çocuk

source: Before item text &%d
ru: Текст перед элементом &%d
tr: Öğe öncesi metin &%d

source: After item text &%d
ru: Текст после элемента &%d
tr: Öge sonrası metin &%d

source: Start text &%d
ru: Текст в начале &%d
tr: Metni Başlat &%d

source: End text &%d
ru: Текст в конце &%d
tr: Metni sonlandır &%d

source: &Interval text &%d
ru: &Разделительный текст &%d
tr: &Metin aralığı &%d

source: Child role
ru: Описания дочерних элементов
tr: Çocuk rolü

source: &Child %d meaning
ru: &Описание дочернего элемента %d
tr: &çocuk %d anlamı

source: Regular Expression error: "%s".
ru: Ошибка регулярного выражения: "%s".
tr: Düzenli İfade hatası: "%s".

source: Dictionary Entry Error
ru: Ошибка словаря
tr: Sözlük Giriş Hatası

source: Math Rules Speech Output
ru: Математические правила вывода речи
tr: Matematik Kuralları Konuşma Çıkışı

source: Math Rules Braille Output
ru: Математические правила вывода Брайля
tr: Matematik Kuralları Braille Çıkışı

source: &Mathrules
ru: &Математические правила
tr: &MathKuralları

source: &Edit
ru: &Изменить
tr: Düz&enle

source: E&xample
ru: &Пример
tr: &Örnek

source: New language adding
ru: Добавление нового языка
tr: Yeni dil ekleme

source: &Select
ru: &Выбрать
tr: &Seç

source: &Unselect
ru: &Отменить выбор
tr: Seçimi kaldı&r

source: OK
ru: ОК
tr: TAMAM

source: For the new language to be added, NVDA must be restarted. Press enter to restart NVDA, or cancel to exit at a later time.
ru: Чтобы добавить новый язык, необходимо перезапустить NVDA. Нажмите Enter, чтобы перезапустить NVDA сейчас, или "Отмена", чтобы перезапустить позже самостоятельно.
tr: Eklenecek yeni dil için NVDA'nın yeniden başlatılması gerekir. NVDA'yı yeniden başlatmak için enter tuşuna basın veya daha sonra çıkmak için iptal edin.

source: Add new language
ru: Добавить новый язык
tr: Yeni dil ekle

source: &New editor
ru: &Новое окно
tr: Ye&ni düzenleyici

source: Open a new editor.
ru: Открыть новое окно редактора.
tr: Yeni bir düzenleyici açın.

source: &Open file...
ru: &Открыть файл...
tr: Dosya &aç...

source: Open a new file.
ru: Открыть новый файл.
tr: Yeni bir dosya açın.

source: &Save file...
ru: &Сохранить файл...
tr: Dosyayı &kaydet...

source: Save the current file.
ru: Сохранить текущий файл.
tr: Geçerli dosyayı kaydedin.

source: &Change workspace folder...
ru: &Изменить папку рабочей области...
tr: &Çalışma alanı klasörünü değiştir...

source: Change workspace folder to a different folder.
ru: Изменить папку рабочей области на другую папку.
tr: Çalışma alanı klasörünü farklı bir klasörle değiştir.

source: Open &workspace folder...
ru: Открыть папку &рабочей области...
tr: Çalışma alanı klas&örünü aç...

source: Open workspace folder.
ru: Открыть папку рабочей области.
tr: Çalışma alanı klasörünü aç.

source: Set &Title...
ru: Установить &заголовок...
tr: &Başlığı Ayarla...

source: Set title
ru: Установить заголовок
tr: Başlığı ayarla

source: E&xit
ru: &Выход
tr: &Çık

source: Terminate the program.
ru: Закрытие программы.
tr: Programı sonlandır.

source: &File
ru: &Файл
tr: &Dosya

source: Preview
ru: Просмотр
tr: Ön izleme

source: Preview HTML file
ru: Предварительный просмотр HTML
tr: HTML dosyasını önizle

source: Export...
ru: Экспорт...
tr: Dışa aktar...

source: Export archive file
ru: Экспортировать файл архива
tr: Arşiv dosyasını dışa aktar

source: &View
ru: &Вид
tr: G&örünüm

source: Font
ru: Шрифт
tr: Yazı tipi

source: Adjust font format
ru: Настроить формат шрифта
tr: Yazı tipi biçimini ayarla

source: Find
ru: Найти
tr: Bul

source: Find and replace
ru: Найти и заменить
tr: Bul ve Değiştir

source: &Other
ru: &Другое
tr: &Diğer

source: Select workspace folder
ru: Выберите папку рабочей области
tr: Çalışma alanı klasörünü seç

source: Open file
ru: Открыть файл
tr: Dosya aç

source: Save file
ru: Сохранить файл
tr: Dosyayı kaydet

source: The workspace folder is currently set to default. Exiting the editor will delete this folder. Do you want to move it?
ru: В настоящее время для папки рабочей области установлено значение по умолчанию. При выходе из редактора эта папка будет удалена. Хотите продолжить?
tr: Çalışma alanı klasörü şu anda varsayılan olarak ayarlanmıştır. Düzenleyiciden çıkmak bu klasörü silecektir. Taşımak istiyor musunuz?

source: Exit
ru: Выход
tr: Çık

source: The content in the editor has been modified since the last save, do you want to save and exit it?
ru: Содержимое файла было изменено с момента последнего сохранения, вы хотите сохранить его и закрыть редактор?
tr: Düzenleyicideki içerik son kaydetmeden bu yana değiştirildi, kaydedip çıkmak istiyor musunuz?

source: Preview will only include the saved content. The content in the editor has been modified since the last save, do you want to save and preview it?
ru: Предварительный просмотр отображает только сохранённое содержимое. Содержимое файла было изменено с момента последнего сохранения. Вы хотите сохранить и просмотреть его?
tr: Önizleme yalnızca kaydedilen içeriği gösterir. Düzenleyicideki içerik, son kaydetmeden bu yana değiştirildi, kaydetmek ve önizlemek istiyor musunuz?

source: Export will only include the saved content. The content in the editor has been modified since the last save, do you want to save and export it?
ru: Экспорт включает только сохранённое содержимое. Содержимое файла было изменено с момента последнего сохранения. Вы хотите сохранить и экспортировать его?
tr: Dışa aktarma yalnızca kaydedilen içeriği içerecektir. Düzenleyicideki içerik, son kaydetmeden bu yana değiştirildi, kaydedip dışa aktarmak istiyor musunuz?

source: Export
ru: Экспорт
tr: Dışa aktar

source: Export Access8Math document...
ru: Экспортировать документ Access8Math...
tr: Access8Math belgesini dışa aktar...

source: enter document title
ru: введите заголовок документа
tr: belge başlığını girin

source: &Menu
ru: &Меню
tr: &Menü

source: &Exit
ru: &Выход
tr: Çı&kış

source: Terminate the program
ru: Закрыть программу
tr: Programı sonlandır

source: Interaction
ru: Взаимодействие
tr: Etkileşim

source: Copy
ru: Копировать
tr: Kopyala

source: Copied
ru: Скопировано
tr: Kopyalandı

source: Entering interaction mode
ru: Вход в режим взаимодействия
tr: Etkileşim moduna gir

source: No move
ru: Крайний элемент
tr: Hareket yok

source: Copied raw MathML
ru: Необработанный MathML скопирован
tr: Ham MathML kopyalandı

source: Copied MathML
ru: MathML скопирован
tr: MathML kopyalandı

source: Copy LaTeX failed
ru: Не удалось скопировать LaTeX
tr: LaTeX kopyalanamadı

source: Copied LaTeX
ru: LaTeX скопирован
tr: LaTeX kopyalandı

source: snapshot
ru: снимок
tr: anlık

source: Toggle command gestures
ru: Включает или отключает горячие клавиши для вставки команд
tr: Komut hareketlerini aç/kapat

source: Command gestures activated
ru: Горячие клавиши для вставки команд включены
tr: Komut hareketleri etkinleştirildi

source: Command gestures deactivated
ru: Горячие клавиши для вставки команд выключены
tr: Komut hareketleri devre dışı bırakıldı

source: Toggle block navigation gestures
ru: Включает или отключает горячие клавиши для навигации по блокам
tr: Blok gezinme hareketlerini aç/kapat

source: Block navigation gestures activated
ru: Горячие клавиши для навигации по блокам включены
tr: Blok Gezinme hareketleri etkinleştirildi

source: Block navigation gestures deactivated
ru: Горячие клавиши для навигации по блокам выключены
tr: Blok Gezinme hareketleri devre dışı bırakıldı

source: Toggle shortcut gestures
ru: Включает или отключает быстрые горячие клавиши
tr: Kısayol hareketlerini aç/kapat

source: Cannot activate shortcut gesture in browse navigation mode
ru: Невозможно включить быстрые горячие клавиши в режиме обзора
tr: Gözatma gezinme modunda kısayol hareketi etkinleştirilemiyor

source: Shortcut gestures activated
ru: Быстрые горячие клавиши включены
tr: Kısayol hareketleri etkinleştirildi

source: Shortcut gestures deactivated
ru: Быстрые горячие клавиши выключены
tr: Kısayol hareketleri devre dışı bırakıldı

source: Toggle Greek alphabet gesture
ru: Включает или отключает горячие клавиши для вставки греческих букв
tr: Yunan alfabesi hareketini aç/kapat

source: Cannot activate Greek alphabet gestures in browse navigation mode
ru: Невозможно включить горячие клавиши для вставки греческих букв в режиме обзора
tr: Gezinme gözatma modunda Yunan alfabesi hareketleri etkinleştirilemiyor

source: Greek alphabet gestures activated
ru: Горячие клавиши для вставки греческих букв включены
tr: Yunan alfabesi hareketleri etkinleştirildi

source: Greek alphabet gestures deactivated
ru: Горячие клавиши для вставки греческих букв выключены
tr: Yunan alfabesi hareketleri devre dışı bırakıldı

source: Toggle browse navigation mode
ru: Включает или отключает режим обзора
tr: Gezinme gözatma modunu aç/kapat

source: Browse navigation mode on
ru: Режим обзора включён
tr: Gezinme modu açık

source: Browse navigation mode off
ru: Режим обзора выключен
tr: Gezinme modu kapalı

source: Shortcut {shortcut} is not set
ru: Горячая клавиша {shortcut} не определена
tr: Kısayol {shortcut} ayarlanmadı

source: Greek alphabet {GreekAlphabet} is not set
ru: Греческая буква {GreekAlphabet} не определена
tr: Yunan alfabesi {GreekAlphabet} ayarlanmadı

source: In math section. Please leave math section first and try again.
ru: Вы находитесь внутри математического блока. Пожалуйста, поместите курсор за пределы блока и попробуйте снова.
tr: Matematik bölümünde. Lütfen önce matematik bölümünden çıkın ve tekrar deneyin.

source: Not in LaTeX block or text block. cannot use LaTeX command
ru: Не в блоке LaTeX или в текстовом блоке. Невозможно вставить команды LaTeX
tr: LaTeX bloğunda veya metin bloğunda değil. LaTeX komutunu kullanamaz

source: This block cannot be interacted
ru: С этим блоком невозможно взаимодействовать
tr: Bu blokla etkileşim kurulamaz

source: No autocomplete found
ru: Автозаполнение не найдено
tr: Otomatik tamamlama bulunamadı

source: This block cannot be translated
ru: Этот блок невозможно преобразовать
tr: Bu blok çevrilemez

source: {data} copied to clipboard
ru: {data} скопировано в буфер обмена
tr: {data} panoya kopyalandı

source: {data} inserted to document
ru: {data} вставлено в документ
tr: {data} belgeye eklendi

source: {data} cut from document
ru: {data} вырезано из документа
tr: {data} belgeden kesildi

source: {data} deleted from document
ru: {data} удалено из документа
tr: {data} belgeden silindi

source: autocomplete command
ru: команда автозаполнения
tr: otomatik tamamlama komutu

source: math block
ru: математический блок
tr: matematik bloğu

source: LaTeX to AsciiMath
ru: LaTeX в AsciiMath
tr: LaTeX'ten AsciiMath'e

source: AsciiMath to LaTeX
ru: AsciiMath в LaTeX
tr: AsciiMath'ten LaTeX'e

source: Nemeth to LaTeX
ru: Код Немета в LaTeX
tr: Nemeth'ten LaTeX'e

source: LaTeX delimiter
ru: Отделитель LaTeX
tr: LaTeX sınırlayıcı

source: bracket to dollar
ru: скобки в знаки доллара
tr: parantezden dolara

source: dollar to bracket
ru: знаки доллара в скобки
tr: dolardan paranteze

source: batch command
ru: команды пакетной конвертации
tr: toplu komut

source: view
ru: просмотр
tr: görünüm

source: edit
ru: редактировать
tr: düzenle

source: virtual context menu
ru: виртуальное контекстное меню
tr: sanal bağlam menüsü

source: open path failed
ru: не удалось открыть путь
tr: açık yol başarısız

source: shortcut
ru: горячая клавиша
tr: kısayol

source: common
ru: общие
tr: yaygın

source: operator
ru: операторы
tr: operatör

source: relation
ru: сравнение
tr: ilişki

source: logic
ru: логика
tr: mantık

source: arrow
ru: стрелки
tr: ok

source: geometry
ru: геометрия
tr: geometri

source: combinatorics
ru: комбинаторика
tr: kombinatorik

source: trigonometric
ru: тригонометрия
tr: trigonometrik

source: 2-dimension
ru: многострочные
tr: 2 boyutlu

source: set
ru: множества
tr: küme

source: calculus
ru: математический анализ
tr: kalkülüs

source: other
ru: другое
tr: diğer

source: LaTeX command
ru: Команда LaTeX
tr: LaTeX komutu

source: Cannot set shortcut on menu
ru: Невозможно установить горячую клавишу на пункт меню
tr: Menüde kısayol ayarlanamıyor

source: Shortcut {slot} set
ru: Горячая клавиша {slot} установлена
tr: Kısayol {slot} seti

source: Cannot clear shortcut on a menu
ru: Невозможно удалить горячую клавишу с пункта меню
tr: Bir menüdeki kısayol temizlenemiyor

source: No shortcut set on this item
ru: Горячая клавиша для данного элемента не настроена
tr: Bu öğede ayarlanmış kısayol yok

source: Shortcut {slot} cleared
ru: Горячая клавиша {slot} удалена
tr: {slot} kısayolu temizlendi

source: Nemeth
ru: Код Немета

source: mark command
ru: отделитель
tr: işaret komutu

source: preview
ru: просмотр
tr: ön izleme

source: export
ru: экспорт
tr: dışa aktar

source: view command
ru: команды просмотра
tr: komutu görüntüle

source: Save file...
ru: Сохранить файл...
tr: Dosyayı kaydet...

source: translate command
ru: команды преобразования
tr: komutu çevir

source: This block cannot be translated into {id}
ru: Этот блок невозможно преобразовать в {id}
tr: Bu blok {id} diline çevrilemez

source: command
ru: команды
tr: komut

source: subMenu
ru: подменю
tr: alt menü

source: {number} of {total}
ru: {number} из {total}
tr: {number} bölü {total}

source: matrix (2X2)
ru: матрица (2X2)
tr: matris (2X2)

source: matrix (3X3)
ru: матрица (3X3)
tr: matris (3X3)

source: determinant (2X2)
ru: определитель (2X2)

source: determinant (3X3)
ru: определитель (3X3)

source: left arrow
ru: стрелка влево
tr: sol ok
