Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/emoticons/*/emoticons.po
Languages: es, fi, pt_pt, ru, tr

source: You seem to have previous settings saved for this add-on. Do you want to import them, removing deprecated files?
es: Parece que tienes la configuración previa guardada para este complemento. ¿Quieres importarla eliminando los archivos obsoletos?
fi: Lisäosan aiempia asetuksia löytyi. Haluatko tuoda ne ja poistaa vanhentuneet tiedostot?
pt_pt: Parece que tem definições anteriores guardadas para este extra. Pretende importá-las, removendo os ficheiros obsoletos?
ru: Похоже, у вас сохранены предыдущие настройки для этого дополнения. Вы хотите импортировать их, удалив устаревшие файлы?
tr: Bu eklenti için önceden kaydedilmiş ayarlarınız var gibi görünüyor. Kullanımdan kaldırılmış dosyaları silerek bunları içe aktarmak ister misiniz?

source: Import Emoticons add-on settings
es: Importar configuración del complemento Emoticons
fi: Tuo Hymiöt-lisäosan asetukset
pt_pt: Importar definições do extra Emoticons
ru: Импорт настроек дополнения Emoticons
tr: İfadeler eklenti ayarlarını içe aktar

source: Emoji
ru: Эмодзи

source: Emoticon
es: Emoticono
fi: Hymiö
ru: Смайлик
tr: İfade

source: &Emoticons
fi: &Hymiöt
ru: &Смайлики
tr: İ&fadeler

source: &Insert emoticon...
es: &Insertar emoticono...
fi: &Lisää hymiö...
pt_pt: &Inserir emoticon...
ru: Вставить &смайлик...
tr: İf&ade ekle...

source: Shows a dialog to insert a smiley
es: Muestra un diálogo para insertar un emoticono
fi: Näyttää valintaikkunan hymiön lisäämiseksi.
pt_pt: Mostra uma caixa de diálogo para inserir um smiley
ru: Показывает диалог для вставки смайлика
tr: Yazı alanındayken ifade eklemeniz için bir iletişim kutusu açar

source: In&sert symbol...
es: Insertar &símbolo...
fi: Li&sää symboli...
ru: Вставить си&мвол...
tr: &Sembol ekle...

source: Shows a dialog to insert a symbol
es: Muestra un diálogo para insertar un símbolo
fi: Näyttää valintaikkunan symbolin lisäämiseksi.
pt_pt: Mostra uma caixa de diálogo para inserir um símbolo
ru: Показывает диалог для вставки символа
tr: Sembol eklemeniz için bir iletişim kutusu açar

source: &Emoticons dictionary...
es: Diccionario de &Emoticonos...
fi: &Hymiöt...
pt_pt: dicionário de &Emoticons...
ru: &Словарь смайликов...
tr: &İfadeler sözlüğü...

source: Shows a dictionary dialog to customize emoticons
es: Muestra un diálogo de diccionario para personalizar emoticonos
fi: Näyttää sanastovalintaikkunan hymiöiden mukauttamiseksi.
pt_pt: Mostra uma caixa de diálogo do dicionário para personalizar os emoticons
ru: Показывает диалог словаря для настройки смайликов
tr: Ifade özelleştirmeniz için bir sözlük iletişim kutusu gösterir

source: Toggles on and off the announcement of emoticons.
es: Activa y desactiva el anuncio de emoticonos.
fi: Ottaa käyttöön hymiöiden puhumisen tai poistaa sen käytöstä.
pt_pt: Activa ou desactiva o anúncio de Emoticons.
ru: Включает и выключает объявление смайликов.
tr: İfadelerin konuşma sözlüğü kullanılarak okunmasıyla ilgili ayarı açıp kapatır.

source: Emoticons off.
es: Emoticonos desactivados.
fi: Hymiöt pois.
pt_pt: Emoticons desactivados.
ru: Смайлики выключены.
tr: İfadeler kapalı.

source: Emoticons on.
es: Emoticonos activados.
fi: Hymiöt käytössä.
pt_pt: Emoticons activados.
ru: Смайлики включены.
tr: İfadeler açık.

source: Shows a dialog to select a smiley you want to paste.
es: Muestra un diálogo para seleccionar un emoticono que quieras pegar.
fi: Näyttää valintaikkunan, josta voit valita liitettävän hymiön.
pt_pt: Mostra uma caixa de diálogo para selecionar um smiley que pretende colar.
ru: Показывает диалог выбора смайлика, который вы хотите вставить.
tr: Yapıştırmak istediğiniz ifadeyi seçmeniz için bir iletişim kutusu açar.

source: Shows a dialog to select a symbol you want to paste.
es: Muestra un diálogo para seleccionar un símbolo que quieras pegar.
fi: Näyttää valintaikkunan, josta voit valita liitettävän symbolin.
pt_pt: Mostra uma caixa de diálogo para selecionar um símbolo que pretende colar.
ru: Показывает диалог выбора символа, который вы хотите вставить.
tr: Yapıştırmak istediğiniz ifadeyi seçmeniz için bir iletişim kutusu açar.

source: Shows the Emoticons dictionary dialog.
es: Muestra un diálogo del diccionario de Emoticonos.
fi: Näyttää Hymiösanasto-valintaikkunan.
pt_pt: Mostra o dicionário de Emoticons.
ru: Показывает диалог словаря смайликов.
tr: İfadeler sözlüğünü gösterir.

source: Shows the Emoticons settings.
es: Muestra la configuración de emoticonos.
fi: Näyttää Hymiöt-lisäosan asetukset.
pt_pt: Mostra as configurações de Emoticons.
ru: Показывает настройки смайликов.
tr: İfadeler ayarlarını gösterir.

source: Shows the symbol positioned where the review cursor is located.
es: Muestra el símbolo en la posición donde se encuentra el cursor de revisión.
fi: Näyttää tarkastelukohdistimen kohdalla olevan symbolin.
pt_pt: Mostra o símbolo posicionado onde o cursor de revisão está localizado.
ru: Показывает символ, расположенный там, где находится просмотровый курсор.
tr: İnceleme imlecinin bulunduğu konumdaki sembolü gösterir.

source: No symbol replacement
es: No hay símbolo de reemplazo
fi: Ei symbolin korvaavaa tekstiä
pt_pt: Sem substituição de símbolo
ru: Без замены символов
tr: Sembol değişimi yok

source: Character: {} Replacement: {}
es: Carácter: {} Reemplazo: {}
fi: Merkki: {} Replacement: {}
pt_pt: Carácter: {} Substituição: {}
ru: Символ: {} Замена: {}
tr: Karakter: {} Yerine konan: {}

source: Symbol at the review cursor position ({})
es: Símbolo en la posición del cursor de revisión ({})
fi: Symboli tarkastelukohdistimen kohdalla ({})
pt_pt: Símbolo na posição do cursor de revisão ({})
ru: Символ в позиции просмотрового курсора ({})
tr: İnceleme imleci konumundaki sembol ({})

source: Shows the symbol positioned where the caret is located.
es: Muestra el símbolo posicionado donde se encuentra el cursor.
fi: Näyttää järjestelmäkohdistimen kohdalla olevan symbolin.
pt_pt: Mostra o símbolo posicionado onde o cursor está localizado.
ru: Показывает символ, расположенный там, где находится каретка.
tr: Düzenleme imlecinin bulunduğu konumdaki sembolü gösterir.

source: Symbol at the caret position ({})
es: Símbolo en la posición del cursor ({})
fi: Symboli järjestelmäkohdistimen kohdalla ({})
pt_pt: Símbolo na posição do cursor ({})
ru: Символ в позиции каретки ({})
tr: Düzenleme imleci konumundaki sembol ({})

source: Insert emoticon
es: Insertar emoticono
fi: Lisää hymiö
pt_pt: Inserir emoticon
ru: Вставить смайлик
tr: Ifade ekle

source: &Filter:
es: &Filtrar:
fi: &Suodata:
pt_pt: &filtro:
ru: &Фильтр:
tr: &Süz:

source: &All
es: &Todos
fi: K&aikki
pt_pt: Todos
ru: &Все
tr: &Tümü

source: &Standard
es: &Estándar
fi: Tavall&iset
ru: &Стандартные
tr: &Standart

source: Emoj&is
fi: &Emojit
ru: Эмод&зи
tr: Emoj&iler

source: &List of smilies
es: &Lista de emoticonos
fi: &Hymiöluettelo
pt_pt: &Lista de smilies
ru: С&писок смайликов
tr: &İfadeler listesi

source: Name
es: Nombre
fi: Nimi
pt_pt: Nome
ru: Имя
tr: Ad

source: Type
es: Tipo
fi: Tyyppi
pt_pt: Tipo
ru: Тип
tr: Tür

source: Characters
es: Caracteres
fi: Merkit
pt_pt: Caracteres
ru: Символы
tr: Karakterler

source: Standard
es: Estándar
fi: Tavallinen
ru: Стандартные
tr: Standart

source: There is not any emoticon selected.
es: No hay ningún emoticono seleccionado.
fi: Hymiötä ei ole valittu.
pt_pt: Sem Emoticon seleccionado.
ru: Не выбран ни один смайлик.
tr: Seçilen herhangi bir ifade yok.

source: Smiley copied to clipboard, ready for you to paste.
es: Emoticono copiado al portapapeles, listo para pegar.
fi: Hymiö kopioitu leikepöydälle.
pt_pt: Smiley copiado para a área de transferência, pronto para ser colado.
ru: Смайлик скопирован в буфер обмена и готов для вставки.
tr: İfade bulunduğunuz alana yapıştırabilmeniz için panoya kopyalandı.

source: Cannot copy smiley.
es: No se puede copiar el emoticono.
fi: Hymiötä' ei voi kopioida.
pt_pt: Impossível copiar o Smiley.
ru: Не удалось скопировать смайлик.
tr: İfade kopyalanamıyor.

source: Emoticons dictionary (%s)
es: Diccionario de Emoticonos (%s)
fi: Hymiösanasto (%s)
pt_pt: Dicionário de emoticons (%s)
ru: Словарь смайликов (%s)
tr: İfadeler sözlüğü (%s)

source: Rese&t
es: Re&iniciar
fi: P&alauta oletukset
pt_pt: Reserva
ru: Сб&рос
tr: Sı&fırla

source: Save and e&xport dictionary
es: Guardar y e&xportar diccionario
fi: Tallenna ja v&ie sanasto
pt_pt: Guardar e &exportar o dicionário
ru: Сохранить и &экспортировать словарь
tr: S&özlüğü kaydet ve dışa aktar

source: Insert Symbol (%s)
es: Insertar Símbolo (%s)
fi: Lisää symboli (%s)
pt_pt: Inserir símbolo (%s)
ru: Вставить символ (%s)
tr: Sembol Ekle (%s)

source: &Add
es: &Añadir
fi: &Lisää
pt_pt: &Adicionar
ru: &Добавить
tr: &Ekle

source: Symbols to &copy:
es: Símbolos a &copiar:
fi: &Kopioitavat symbolit:
pt_pt: Símbolos a &copiar:
ru: &Копируемые символы:
tr: Kopyalana&cak semboller:

source: Symbol copied to clipboard, ready for you to paste.
es: Símbolo copiado al portapapeles, listo para pegar.
fi: Symboli kopioitu leikepöydälle.
pt_pt: Símbolo copiado para a área de transferência, pronto para ser colado.
ru: Символ скопирован в буфер обмена и готов к вставке.
tr: İfade bulunduğunuz alana yapıştırabilmeniz için panoya kopyalandı.

source: Cannot copy symbol.
es: No se puede copiar el símbolo.
fi: Symbolia ei voi kopioida.
pt_pt: Impossível copiar o símbolo.
ru: Не удалось скопировать символ.
tr: Sembol kopyalanamıyor.

source: &Activate speaking of emoticons:
es: &Activar la verbalización de emoticonos:
fi: &Ota hymiöiden puhuminen käyttöön:
pt_pt: &Activar a verbalização de Emoticons:
ru: &Включить озвучивание смайликов:
tr: İfadelerin seslendirilmesini &etkinleştir:

source: Speak add-on emojis
es: Verbalizar emojis del complemento
fi: Puhu lisäosan emojit
pt_pt: Falar emojis adicionais
ru: Произносить смайлики дополнения
tr: Eklenti emojilerini seslendir

source: Ensure speaking of inserted symbols
es: Garantizar la verbalización de símbolos insertados
fi: Varmista lisättyjen symbolien puhuminen
pt_pt: Assegurar que os símbolos inseridos são falados
ru: Гарантировать произношение вставленных символов
tr: Eklenen sembollerin seslendirilmesini sağlar

source: &Remove not used dictionaries
es: &Eliminar diccionarios no utilizados
fi: &Poista käyttämättömät sanastot
pt_pt: &Remover dicionários não utilizados
ru: &Удалить неиспользуемые словари
tr: Kullanılmayan sözlükle&ri sil

source: Grinning face
es: Cara sonriente
fi: Virnistävä naama
pt_pt: Rosto sorridente
ru: Ухмыляющееся лицо
tr: Sırıtan yüz

source: Happy face with open mouth and squinting eyes
es: Cara feliz con la boca abierta y los ojos entrecerrados
fi: iloiset kasvot suu auki ja silmät sirrillä
pt_pt: Rosto feliz com boca aberta e olhos semicerrados
ru: Счастливое лицо с открытым ртом и щурящимися глазами
tr: Kısık gözlerle açık ağızlı mutlu yüz

source: Happy face with open mouth
es: Cara feliz con la boca abierta
fi: Iloiset kasvot suu auki
pt_pt: Cara feliz com a boca aberta
ru: Счастливое лицо с открытым ртом
tr: Ağzı açık mutlu yüz

source: Smiling Face With Smiling Eyes
es: Cara Sonriente Con Los Ojos Risueños
fi: Hymyilevät kasvot silmät hymyssä
pt_pt: Rosto sorridente com olhos sorridentes
ru: Улыбающееся лицо с улыбающимися глазами
tr: Gülümseyen gözlerle güler yüz

source: Smirking face
es: Cara sonriendo de satisfacción
fi: Typerästi hymyilevät kasvot
pt_pt: Rosto sorridente
ru: Ухмыляющееся лицо
tr: Sırıtan yüz

source: Slightly smiling face
es: Cara ligeramente sonriente
fi: Hienoisesti hymyilevät kasvot
pt_pt: Rosto ligeiramente sorridente
ru: Слегка улыбающееся лицо
tr: Hafif güler yüz

source: white smiling face
es: cara sonriente blanca
fi: Valkoiset hymyilevät kasvot
pt_pt: cara com sorriso disfarçado
ru: белое улыбающееся лицо
tr: beyaz gülen yüz

source: Happy face with halo
es: Cara feliz con aureola
fi: Iloiset kasvot sädekehällä
pt_pt: Cara feliz com auréola
ru: Счастливое лицо с нимбом
tr: Haleli mutlu yüz

source: White frowning face
es: Cara fruncida blanca
fi: Valkoiset kasvot otsa rypyssä
pt_pt: Rosto branco franzido
ru: Белое хмурое лицо
tr: Beyaz kızgın yüz

source: Winking face
es: Cara guiñando los ojos
fi: Silmää iskevät kasvot
pt_pt: Rosto que pisca
ru: Подмигивающее лицо
tr: Göz kırpan yüz

source: Smiling face with heart shaped eyes
es: Cara sonriente con ojos en forma de corazón
fi: Hymyilevät kasvot sydämenmuotoisin silmin
pt_pt: Rosto sorridente com olhos em forma de coração
ru: Улыбающееся лицо с глазами в форме сердца
tr: Kalp şeklinde gözlerle güler yüz

source: Rose
es: Rosa
fi: Ruusu
pt_pt: Rosa
ru: Роза
tr: Gül

source: Expressionless face
es: Cara inexpresiva
fi: Ilmeettömät kasvot
pt_pt: Rosto sem expressão
ru: Невыразительное лицо
tr: İfadesiz yüz

source: Neutral face
es: Cara neutral
fi: neutraalit kasvot
pt_pt: Rosto neutro
ru: Нейтральное лицо
tr: Nötr yüz

source: Face without mouth
es: Cara sin boca
fi: Kasvot ilman suuta
pt_pt: Rosto sem boca
ru: Лицо без рта
tr: Ağzı olmayan yüz

source: Face throwing a kiss
es: Cara lanzando un beso
fi: lentosuukkoa heittävät kasvot
pt_pt: Cara que atira um beijo
ru: Лицо бросает поцелуй
tr: Öpücük gönderen yüz

source: Kissing face with closed eyes
es: Cara besando con los ojos cerrados
fi: suutelevat kasvot silmät suljettuina
pt_pt: Beijar o rosto com os olhos fechados
ru: Целующее лицо с закрытыми глазами
tr: Kapalı gözlerle öpen yüz

source: Kissing face
es: Cara besando
fi: Suutelevat kasvot
pt_pt: Beijar a cara
ru: Целующееся лицо
tr: Öpücük atan yüz

source: Kissing face with arched eyes
es: Cara besando con los ojos arqueados
fi: Suutelevat kasvot ilkikurisin silmin
pt_pt: Beijar o rosto com os olhos arcados
ru: Целующееся лицо с выпученными глазами
tr: Kemerli gözlerle öpen yüz

source: Winking face with stuck out tongue
es: Cara guiñando los ojos con la lengua fuera
fi: Silmää iskevät ja kieltä näyttävät kasvot
pt_pt: Cara de quem pisca o olho com a língua de fora
ru: Подмигивающее лицо с высунутым языком
tr: Göz kırpan ve dil çıkaran yüz

source: Face with stuck out tongue and eyes tightly closed
es: Cara con la lengua fuera y los ojos firmemente cerrados
fi: Kieltä näyttävät kasvot silmät tiukasti suljettuina
pt_pt: Rosto com a língua de fora e olhos bem fechados
ru: Лицо с высунутым языком и плотно закрытыми глазами
tr: Gözü kapalı dil çıkaran yüz

source: Face with stuck out tongue
es: Cara con la lengua fuera
fi: Kieltä näyttävät kasvot
pt_pt: Cara com a língua de fora
ru: Лицо с высунутым языком
tr: Dil çıkaran yüz

source: Hugging face
es: Cara dando un abrazo
fi: Halaavat kasvot
pt_pt: Rosto abraçado
ru: Обнимающее лицо
tr: Sarılan yüz

source: Flushed face
es: Cara sonrojada
fi: Punottavat kasvot
pt_pt: Rosto corado
ru: Раскрасневшееся лицо
tr: Kızarmış yüz

source: Grinning Face With Smiling Eyes
es: Cara Sonriente Con Los Ojos Risueños
fi: Virnistävät kasvot silmät hymyssä
pt_pt: Rosto sorridente com olhos sorridentes
ru: Ухмыляющееся лицо с улыбающимися глазами
tr: Gülümseyen gözlerle sırıtan yüz

source: Pensive Face
es: Cara Pensativa
fi: Syvämietteiset kasvot
pt_pt: Rosto pensativo
ru: Задумчивое лицо
tr: Dalgın yüz

source: Devil with evil smile
es: Diablo con sonrisa maligna
fi: Häijysti hymyilevä piru
pt_pt: Diabo com sorriso maléfico
ru: Дьявол со злой улыбкой
tr: Şeytani bir gülümseme ile şeytan

source: Devil
es: Diablo
fi: Piru
pt_pt: Diabo
ru: Дьявол
tr: Şeytan

source: Relieved face
es: Cara de alivio
fi: Helpottuneet kasvot
pt_pt: Rosto aliviado
ru: Облегчённое лицо
tr: Rahatlamış yüz

source: Unamused face
es: Cara no divertida
fi: Tympääntyneet kasvot
pt_pt: Rosto não divertido
ru: Недовольное лицо
tr: Eğlencesiz yüz

source: Persevering Face
es: Cara Perseverante
fi: Sinnikkäät kasvot
pt_pt: Rosto perseverante
ru: Настойчивое лицо
tr: Azimli yüz

source: Crying face
es: Cara llorando
fi: Itkevät kasvot
pt_pt: Cara de choro
ru: Плачущее лицо
tr: Ağlayan yüz

source: Face with tears of joy
es: Cara con lágrimas de alegría
fi: Kasvot ilon kyynelissä
pt_pt: Rosto com lágrimas de alegria
ru: Лицо со слезами радости
tr: Sevinç gözyaşları

source: Loudly crying face
es: Cara llorando a mares
fi: Ääneen itkevät kasvot
pt_pt: Rosto que chora alto
ru: Громко плачущее лицо
tr: Bağıra çağıra ağlayan yüz

source: Sleepy face
es: Cara somnolienta
fi: Uneliaat kasvot
pt_pt: Cara de sono
ru: Сонное лицо
tr: Uykulu yüz

source: Shrugging emoji
es: Emoji encogiéndose de hombros
fi: kohauttaa olkapäitään
pt_pt: Emoji de encolher os ombros
ru: Пожимание плечами
tr: Silkme emoji

source: Disappointed face
es: Cara decepcionada
fi: pettynyt
pt_pt: Cara desapontada
ru: Разочарованное лицо
tr: Hayal kırıklığına uğramış yüz

source: Disappointed but relieved face
es: Cara decepcionada pero aliviada
fi: pettynyt mutta helpottunut
pt_pt: Cara de desilusão mas de alívio
ru: Разочарованное, но облегчённое лицо
tr: Hayal kırıklığına uğramış ama rahatlamış yüz

source: Face With Open Mouth & Cold Sweat
es: Cara Con La Boca Abierta & Sudor Frío
fi: suu auki ja kylmässä hiessä
pt_pt: Cara com boca aberta e &suor frio
ru: Лицо с открытым ртом & холодным потом
tr: Ağzı açık soğuk terler döken yüz

source: Smiling Face With Open Mouth & Cold Sweat
es: Cara Sonriente Con La Boca Abierta & Sudor Frío
fi: Hymyilevät kasvot suu auki ja kylmässä hiessä
pt_pt: Cara sorridente com boca aberta e &suor frio
ru: Улыбающееся лицо с открытым ртом & холодным потом
tr: Ağzı açık soğuk terler döken ve gülümseyen yüz

source: Face with cold sweat
es: Cara con sudor frío
fi: Kasvot kylmässä hiessä
pt_pt: Rosto com suor frio
ru: Лицо в холодном поту
tr: Soğuk terli yüz

source: Weary Face
es: Cara Hastiada
fi: Voipuneet kasvot
pt_pt: Rosto cansado
ru: Усталое лицо
tr: Yorgun Yüz

source: Tired Face
es: Cara Cansada
fi: Väsyneet kasvot
pt_pt: Rosto cansado
ru: Усталое лицо
tr: Yorgun Yüz

source: Fearful face
es: Cara temerosa
fi: Pelokkaat kasvot
pt_pt: Cara de medo
ru: Испуганное лицо
tr: Korkunç yüz

source: Face screaming in fear
es: Cara gritando de miedo
fi: Pelosta kirkuvat kasvot
pt_pt: Rosto a gritar de medo
ru: Лицо, кричащее от страха
tr: Korkuyla bağıran yüz

source: Angry face
es: Cara enfadada
fi: Vihaiset kasvot
pt_pt: Rosto zangado
ru: Злое лицо
tr: Kızgın yüz

source: Pouting face
es: Cara de abucheo
fi: Murjottavat kasvot
pt_pt: Rosto amuado
ru: Надутое лицо
tr: Somurtan yüz

source: Face With Steam From Nose
es: Cara Exhalando Por La Nariz
fi: Kasvot, joiden nenästä tulee höyryä
pt_pt: Rosto com vapor do nariz
ru: Лицо с паром из носа
tr: Burnundan soluyan yüz

source: Confounded face
es: Cara Confundida
fi: Neuvottomat kasvot
pt_pt: Rosto confuso
ru: Смущённое лицо
tr: Kafası karışık yüz

source: Smiling Face With Open Mouth and Tightly-Closed Eyes
es: Cara sonriente con la boca abierta y los ojos cerrados firmemente
fi: Hymyilevät kasvot suu auki ja silmät tiukasti suljettuina
pt_pt: Rosto sorridente com boca aberta e olhos bem fechados
ru: Улыбающееся лицо с открытым ртом и плотно закрытыми глазами
tr: Ağzı açık gözleri kapalı güler yüz

source: Happy face licking lips
es: Cara feliz relamiéndose
fi: Iloiset huulia nuolevat kasvot
pt_pt: Cara feliz a lamber os lábios
ru: Счастливое лицо, облизывающее губы
tr: Dudaklarını yalayan mutlu yüz

source: Happy face with sunglasses
es: Cara feliz con gafas de sol
fi: Iloiset kasvot aurinkolasein
pt_pt: Cara feliz com óculos de sol
ru: Счастливое лицо в солнечных очках
tr: Güneş gözlüklü mutlu yüz

source: Sleeping face
es: Cara durmiente
fi: Nukkuvat kasvot
pt_pt: Rosto adormecido
ru: Спящее лицо
tr: Uyuyan yüz

source: Dizzy Face
es: Cara Aturdida
fi: Huumaantuneet kasvot
pt_pt: Cara de tonto
ru: Головокружительное лицо
tr: Şaşırmış yüz

source: Astonished face
es: Cara asombrada
fi: Hämmästyneet kasvot
pt_pt: Cara de espanto
ru: Удивлённое лицо
tr: Şok olmuş yüz

source: Worried face
es: Cara preocupada
fi: Huolestuneet kasvot
pt_pt: Cara horrorizada
ru: Встревоженное лицо
tr: Endişeli yüz

source: Frowning Face With Open Mouth
es: Cara Fruncida Con La Boca Abierta
fi: Otsaa rypistävät kasvot suu auki
pt_pt: Rosto carrancudo com a boca aberta
ru: Хмурое лицо с открытым ртом
tr: Çatık kaşlı açık ağızlı yüz

source: Anguished face
es: Cara angustiada
fi: Tuskaiset kasvot
pt_pt: Rosto angustiado
ru: Мучительное лицо
tr: Acılı yüz

source: Face with Open Mouth
es: Cara con la Boca Abierta
fi: Kasvot suu auki
pt_pt: Cara sorridente com boca aberta e &suor frio
ru: Лицо с открытым ртом
tr: Açık ağızlı yüz

source: Grimacing face
es: Cara haciendo una mueca
fi: Irvistävät kasvot
pt_pt: Rosto carrancudo
ru: Скривящееся лицо
tr: Buruşmuş yüz

source: Confused face
es: Cara Confundida
fi: Hämmentyneet kasvot
pt_pt: Rosto confuso
ru: Растерянное лицо
tr: Şaşkın yüz

source: Hushed Face
es: Cara Enojada
fi: Vaiennetut kasvot
pt_pt: Rosto silencioso
ru: Приглушённое лицо
tr: Dingin Yüz

source: Broken heart
es: Corazón roto
fi: Särkynyt sydän
pt_pt: Coração partido
ru: Разбитое сердце
tr: Kırık kalp

source: Pulsating heart
es: Corazón pulsante
fi: Sykkivä sydän
pt_pt: Coração pulsante
ru: Пульсирующее сердце
tr: Titreşimli kalp

source: Beating heart
es: Corazón palpitante
fi: Sydän lyö
pt_pt: Coração a bater
ru: Бьющееся сердце
tr: Atan kalp

source: Two hearts
es: Dos corazones
fi: Kaksi sydäntä
pt_pt: Dois corações
ru: Два сердца
tr: İki kalp

source: Heart with arrow
es: Corazón con flecha
fi: Sydän jossa nuoli
pt_pt: Coração com seta
ru: Сердце со стрелой
tr: Ok ve kalp

source: Purple heart
es: Corazón Purpura
fi: Vaaleanpunainen sydän
pt_pt: Coração púrpura
ru: Фиолетовое сердце
tr: Mor kalp

source: Red heart
es: Corazón rojo
fi: Punainen sydän
pt_pt: Coração vermelho
ru: Красное сердце
tr: Kırmızı kalp

source: Yellow heart
es: Corazón amarillo
fi: Keltainen sydän
pt_pt: Coração amarelo
ru: Жёлтое сердце
tr: Sarı kalp

source: Green heart
es: Corazón verde
fi: Vihreä sydän
pt_pt: Coração verde
ru: Зелёное сердце
tr: Yeşil kalp

source: Blue heart
es: Corazón azul
fi: Sininen sydän
pt_pt: Coração azul
ru: Голубое сердце
tr: Mavi kalp

source: Rolling on the Floor Laughing
es: Muerto De Risa
fi: Nauraa maha kippurassa
pt_pt: Rebolando a rir
ru: Катаюсь по полу от смеха
tr: GÜlmekten yerlere yatan yüz

source: Slightly Frowning Face
es: Cara Ligeramente Fruncida
fi: Hiukan otsaa rypistävät kasvot
pt_pt: Rosto ligeiramente franzido
ru: Слегка нахмуренное лицо
tr: Hafif kızgın yüz

source: Upside-down Face
es: Cara al Revés
fi: Kasvot ylösalaisin
pt_pt: Cara de cabeça para baixo
ru: Перевёрнутое лицо
tr: Ters döndürülmüş yüz

source: Face With Rolling Eyes
es: Cara Girando Los Ojos
fi: Silmiä pyörittelevät kasvot
pt_pt: Rosto com os olhos revirados
ru: Лицо с закатившимися глазами
tr: Yuvarlanan gözler

source: Person Gesturing No
es: Persona haciendo un Gesto Desaprobatorio
fi: Kieltävästi elehtivä henkilö
pt_pt: Pessoa a dizer que não
ru: Человек, жестикулирующий Нет
tr: Hayır diyen yüz

source: Person Gesturing OK
es: Persona haciendo un Gesto de Aprobación
fi: Myöntävästi elehtivä henkilö
pt_pt: Pessoa a fazer gestos OK
ru: Человек, жестикулирующий OK
tr: Onaylayan yüz

source: Person bowing
es: Persona haciendo una reverencia
fi: Kumarteleva henkilö
pt_pt: Pessoa a curvar-se
ru: Кланяющийся человек
tr: Selamlayan yüz

source: Person Frowning
es: Persona Frunciendo El Ceño
fi: Henkilö otsa rypyssä
pt_pt: Pessoa carrancuda
ru: Хмурый человек
tr: Kızgın yüz

source: Folded Hands
es: Manos Plegadas
fi: Tiukasti yhdessä olevat kädet
pt_pt: Mãos dobradas
ru: Сложенные руки
tr: Katlanmış eller

source: Face with medical mask
es: Cara con máscara médica
fi: Kasvot, joilla leikkausmaski
pt_pt: Rosto com máscara médica
ru: Лицо с медицинской маской
tr: Tıbbi maskeli yüz

source: Black Smiling Face
es: Cara Sonriente Negra
fi: Mustat hymyilevät kasvot
pt_pt: Rosto sorridente preto
ru: Чёрное улыбающееся лицо
tr: Kara güler yüz
