Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/emoticons/*/emoticons.po
Languages: es, fi, pt_pt, ru, tr

source: Happy cat face with heart shaped eyes
es: Cara de gato feliz con ojos en forma de corazón
fi: Iloinen kissan naama sydämenmuotoisin silmin
pt_pt: Cara de gato feliz com olhos em forma de coração
ru: Счастливое кошачье лицо с глазами в форме сердца
tr: Gözlerinde kalplerle mutlu kedi yüzü

source: Ok hand sign
es: Señal de aprobación con la mano
fi: OK-käsimerkki
pt_pt: Sinal de mão Ok
ru: Знак OK
tr: Tamam el işareti

source: Thumbs up symbol
es: Señal de pulgares hacia arriba
fi: Peukalot ylös
pt_pt: Símbolo de polegar para cima
ru: Большой палец вверх символ
tr: Başparmak Yukarı simgesi

source: Thumbs down symbol
es: Señal de pulgares hacia abajo
fi: Peukalot alas
pt_pt: Símbolo de polegar para baixo
ru: Большой палец вниз символ
tr: Başparmak aşağı simgesi

source: Victory Hand
es: La Mano de la Victoria
fi: Voitonmerkki
pt_pt: Mão em sinal de vitória
ru: Рука Победы
tr: Zafer işareti

source: smiling smiley
es: cara sonriente
fi: hymyilee
pt_pt: smiley sorridente
ru: улыбающийся смайлик
tr: gülümseyen yüz

source: Sad face
es: Cara triste
fi: Surulliset kasvot
pt_pt: Cara triste
ru: Грустное лицо
tr: Üzgün yüz

source: Laughing smiley
es: Cara riéndose
fi: nauraa
pt_pt: Sorriso risonho
ru: Смеющийся смайлик
tr: Kahkaha atan yüz

source: surprised smiley
es: cara de sorpresa
fi: yllättynyt
pt_pt: surpreendido
ru: удивлённый смайлик
tr: şaşırmış yüz

source: winking smiley
es: cara guiñando los ojos
fi: iskee silmää
pt_pt: smiley a piscar
ru: подмигивающий смайлик
tr: göz kırpan yüz

source: crying smiley
es: cara llorando
fi: itkee
pt_pt: a chorar
ru: плачущий смайлик
tr: ağlayan yüz

source: Confused Face
es: Cara Confundida
fi: Hämmentyneet kasvot
pt_pt: Rosto confuso
ru: Растерянное лицо
tr: Kafası karışık yüz

source: sweating smiley
es: cara sudando
fi: hikoilee
pt_pt: smiley a suar
ru: потный смайлик
tr: terlemiş yüz

source: Robot Smiley
es: Cara de robot
fi: robotti
pt_pt: Sorriso de robô
ru: Робот Смайлик

source: speechless smiley
es: cara estupefacta
fi: sanaton
pt_pt: smiley sem palavras
ru: безмолвный смайлик
tr: nutku tutulmuş yüz

source: kiss smiley
es: cara besando
fi: pusu
pt_pt: beijo
ru: поцелуй смайлик
tr: öpücük atan yüz

source: cheeky smiley
es: cara Descarada
fi: näyttää kieltä
pt_pt: descarado
ru: нахальный смайлик
tr: dil çıkaran yüz

source: blushing smiley
es: cara sonrojada
fi: punastuu
pt_pt: sorridente
ru: краснеющий смайлик
tr: utangaç yüz

source: wondering smiley
es: cara dudando
fi: ihmettelee
pt_pt: pensativo e sorridente
ru: удивлённый смайлик
tr: meraklı yüz

source: sleepy smiley
es: cara soñolienta
fi: uninen
pt_pt: sonolento
ru: сонный смайлик
tr: uykulu yüz

source: dull smiley
es: cara aburrida
fi: vaisu
pt_pt: sorriso de aborrecido
ru: унылый смайлик
tr: donuk yüz

source: my lips are sealed smiley
es: cara con los labios sellados
fi: huuleni ovat sinetöidyt
pt_pt: os meus lábios estão selados, sorrisos
ru: мои губы сомкнуты смайлик
tr: ağzım mühürlü

source: dancing smiley
es: cara bailando
fi: tanssii
pt_pt: dDança
ru: танцующий смайлик
tr: danseden yüz

source: crying a lot smiley
es: cara llorando desconsoladamente
fi: itkee lohduttomasti
pt_pt: smiley chorando muito
ru: много плачу смайлик
tr: çok ağlamış yüz

source: angry smiley
es: cara Enfadada
fi: vihainen
pt_pt: com fome
ru: злой смайлик
tr: kızgın yüz

source: worried smiley
es: cara preocupada
fi: huolestunut
pt_pt: horrorizado
ru: беспокойный смайлик
tr: endişeli yüz

source: heart smiley
es: emoticono corazón
fi: sydän
pt_pt: cCoração
ru: сердечный смайлик
tr: kalp

source: Angel Smiley
es: Emoticono Ángel
fi: enkeli
pt_pt: Anjo
ru: Ангел Смайлик
tr: Melek

source: Confused Smiley
es: Cara Confundida
fi: hämmentynyt
pt_pt: Sorriso confuso
ru: Растерянный смайлик
tr: Kafası karışık yüz

source: Devil Smiley
es: Emoticono Diablo
fi: pirullinen
pt_pt: Demónio
ru: Дьявольский смайлик
tr: Şeytani sırıtan yüz

source: Keke Smiley
es: Emoticono Pastel
fi: iloinen
ru: Счастливое лицо в азиатском стиле Смайлик
tr: Keke

source: Bored smiley
es: Cara sonriente con los ojos cerrados
fi: tympääntynyt
pt_pt: Sorriso de aborrecimento
ru: Скучный смайлик
tr: Sıkkın yüz

source: Angry Smiley
es: Cara gritando
fi: huutaa
pt_pt: Com fome
ru: Злой смайлик
tr: Sinirli yüz

source: Cat Smiley
es: Cara de gato sonriendo
fi: kissa
pt_pt: Sorriso de gato
ru: Кот смайлик
tr: Kedi

source: I am Sleepy smiley
es: Cara Estoy dormido
fi: minua nukuttaa
pt_pt: Eu sou o Sleepy smiley
ru: Я Сонный смайлик
tr: Uykulu yüz

source: glasses smiley
es: emoticono Gafas
fi: silmälasit
pt_pt: óculos
ru: очки смайлик
tr: gözlüklü yüz

source: shark smiley
es: emoticono Tiburón
fi: hai
pt_pt: riso de tubarão
ru: акула смайлик
tr: köpekbalığı smiley

source: cash smiley
es: emoticono Dinero
fi: käteinen
pt_pt: dinheiro
ru: денежный смайлик
tr: nakit

source: muscle smiley
es: cara flexionando los músculos
fi: muskeli
pt_pt: músculos
ru: мускулистый смайлик
tr: kas

source: beer smiley
es: emoticono cerveza
fi: tuoppi
pt_pt: cerveja
ru: пивной смайлик
tr: bira

source: drink smiley
es: cara bebiendo
fi: drinkki
pt_pt: bebida
ru: пить смайлик
tr: içki

source: ninja smiley
es: emoticono Ninja
fi: ninja
pt_pt: ninja
ru: ниндзя смайлик

source: cool smiley
es: emoticono Cool
fi: siistiä
pt_pt: legal
ru: классный смайлик
tr: havalı gülen yüz

source: in love smiley
es: cara enamorada
fi: rakastunut
pt_pt: romântico
ru: влюблённый смайлик
tr: aşık yüz

source: fingers crossed smiley
es: emoticono dedos cruzados
fi: sormet ristissä
pt_pt: dedos cruzados
ru: скрещенные пальцы смайлик

source: yawning smiley
es: cara bostezando
fi: haukottelee
pt_pt: a desejar
ru: зевая смайлик
tr: esneyen yüz

source: puking smiley
es: cara de asco
fi: oksentaa
pt_pt: vómito
ru: рвота смайлик
tr: küsmüş yüz

source: doh! smiley
es: ¡uy! sonriente
fi: No niin!
pt_pt: doh
ru: дох! смайлик
tr: yap! gülümseme

source: it wasn't me! smiley
es: ¡Yo no fui! sonriente
fi: En se minä ollut!
pt_pt: não era eu
ru: это был не я! смайлик
tr: ben değildim

source: party smiley
es: emoticono fiesta
fi: juhlii
pt_pt: festa
ru: вечеринка смайлик
tr: parti

source: mmmmmm... smiley
es: mmmmmm... sonriente
fi: mmmm...
ru: мммммм... смайлик

source: nerdy smiley
es: emoticono Empollón
fi: nörtti
pt_pt: smiley nerd
ru: занудный смайлик
tr: entel yüz

source: hi smiley
es: emoticono Hola
fi: hei
pt_pt: olá smiley
ru: привет смайлик
tr: selam

source: facepalm smiley
es: cara de desesperación
fi: epätoivoinen
pt_pt: smiley de palma de rosto
ru: фейспалм смайлик

source: devil smiley
es: emoticono diablo
fi: pirullinen
pt_pt: demónio
ru: дьявол смайлик
tr: şeytan

source: angel smiley
es: emoticono ángel
fi: enkeli
pt_pt: anjo
ru: ангел смайлик
tr: melek

source: envy smiley
es: cara envidiando
fi: kateellinen
pt_pt: inveja
ru: зависть смайлик
tr: kıskanç yüz

source: wait smiley
es: cara esperando
fi: odota
pt_pt: à espera
ru: подожди смайлик
tr: bekleyen yüz

source: hug smiley
es: emoticono abrazos
fi: hali
pt_pt: abraço
ru: обнять смайлик
tr: kucak

source: make-up smiley
es: emoticono maquillaje
fi: meikki
pt_pt: maquiagem
ru: макияж смайлик
tr: makyaj yapmış yüz

source: giggle smiley
es: emoticono risita
fi: hihittää
pt_pt: sorridente
ru: хихикающий смайлик
tr: kıkırdayan yüz

source: clapping smiley
es: emoticono aplausos
fi: taputtaa
pt_pt: smiley a bater palmas
ru: хлопающий смайлик
tr: alkış

source: thinking smiley
es: cara pensativa
fi: ajattelee
pt_pt: pensativo
ru: думающий смайлик
tr: düşünceli yüz

source: bowing smiley
es: cara de reverencia
fi: kumartaa
pt_pt: fazendo vénia
ru: кланяющийся смайлик
tr: eğilmiş yüz

source: rolling on the floor laughing! smiley
es: ¡muerto de risa! sonriente
fi: nauraa maha kippurassa
pt_pt: rebolando a rir
ru: катаюсь по полу от смеха! смайлик
tr: gÜlmekten yerlere yattım

source: relieved smiley
es: cara de alivio
fi: helpottunut
pt_pt: relevado
ru: облегчённое смайлик
tr: rahatlamış yüz

source: happy smiley
es: cara feliz
fi: onnellinen
pt_pt: feliz
ru: счастливый смайлик
tr: mutlu yüz

source: smirking smiley
es: cara sonriendo de satisfacción
fi: hymyilee typerästi
pt_pt: desfazendo-se em sorrisos
ru: ухмыляющийся смайлик
tr: sırıtan yüz

source: nodding smiley
es: cara afirmando
fi: nyökkää
pt_pt: sorriso de assentimento
ru: кивающий смайлик
tr: olur

source: shakeing smiley
es: cara negando
fi: pudistaa päätään
pt_pt: smiley a abanar
ru: трясущийся смайлик
tr: olmaz

source: waiting smiley
es: cara esperando
fi: odottaa
pt_pt: esperando
ru: ждущий смайлик
tr: bekliyor

source: Emo smiley
es: Emoticono Emo
fi: emo
pt_pt: Sorriso emo
ru: Эмо смайлик

source: yes smiley
es: cara de sí
fi: kyllä
pt_pt: sim
ru: да смайлик
tr: evet

source: no smiley
es: cara de no
fi: ei
pt_pt: não
ru: нет смайлик
tr: hayır

source: handshake smiley
es: emoticono apretón de manos
fi: kädenpuristus
pt_pt: aperto de mãos
ru: рукопожатие смайлик
tr: el sıkışma

source: high five smiley
es: emoticno choca las cinco
fi: ylävitonen
pt_pt: pára
ru: дай пять смайлик

source: lalala smiley
es: emoticono blablablá
fi: laulaa
pt_pt: smiley de lalala
ru: лалала смайлик

source: heidy smiley
es: emoticono ardilla
fi: orava
pt_pt: sorriso de heidy
ru: здоровский смайлик
tr: heidy

source: flower smiley
es: emoticno flor
fi: kukka
pt_pt: flores
ru: цветочный смайлик
tr: çiçek

source: raining smiley
es: emoticono lluvia
fi: sataa
pt_pt: chover
ru: дождь смайлик
tr: yağmurlu

source: sunny smiley
es: emoticono sol
fi: aurinko paistaa
pt_pt: sorriso de sol
ru: солнечный смайлик
tr: güneşli

source: tumbleweed smiley
es: emoticono planta rodadora
fi: tyyntä ennen myrskyä
pt_pt: palhaço
ru: перекати-поле смайлик
tr: yabani çiçekler

source: music smiley
es: emoticono música
fi: musiikki
pt_pt: música
ru: музыкальный смайлик
tr: müzik gülen yüz

source: bandit smiley
es: cara de bandido
fi: rosvo
pt_pt: bandido
ru: бандитский смайлик
tr: haydut

source: too much information smiley
es: emoticono exceso de información
fi: liikaa tietoa
pt_pt: demasiada informação
ru: слишком много информации смайлик
tr: çok fazla bilgi

source: coffee smiley
es: emoticono café
fi: kahvi
pt_pt: café
ru: кофе смайлик
tr: kahve şeklinde yüz

source: pizza smiley
es: emoticono pizza
fi: pizza
pt_pt: pizza
ru: пицца смайлик
tr: gülen pizza

source: cake smiley
es: emoticono pastel
fi: kakku
pt_pt: bolo
ru: торт смайлик
tr: kek smiley

source: star smiley
es: emoticono estrella
fi: tähti
pt_pt: estrela
ru: звёздный смайлик
tr: yıldız smiley

source: Emoticons
fi: Hymiöt
ru: Смайлики
tr: İfadeler

source: Enables the announcement of emoticon names instead of the character Representation.
es: Habilita el anunciado de nombres de emoticonos en lugar de la representación de caracteres.
fi: Ottaa käyttöön hymiöiden nimien puhumisen niiden merkkien asemesta.
pt_pt: Activa o anúncio dos nomes dos Emoticons em vez da representação dos caracteres.
ru: Включает объявление имён смайликов вместо представления символов смайликов.
tr: Temsil eden karakterler yerine ifade adlarının duyurulmasını etkinleştirir.
