Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/emoticons/*/emoticons.xliff
Languages: pt_pt

source: Authors: Chris Leo, Noelia Ruiz Martínez, Mesar Hameed, Francisco Javier Estrada Martínez
pt_pt: Autores: Chris Leo, Noelia Ruiz Martínez, Mesar Hameed, Francisco Javier Estrada Martínez

source: Using this add-on, spoken text containing emoticon characters will be replaced by its more human friendly description.
pt_pt: Usando este extra, o texto falado que contém caracteres emoticon será substituído por uma descrição mais fácil de entender.

source: For example: the sequence ":)" will be spoken as "smiling smiley", or for example NVDA will recognize the meaning of each emoji.
pt_pt: Por exemplo: a sequência “:)” será pronunciada como “smiley sorridente” ou, por exemplo, o NVDA reconhecerá o significado de cada emoji.

source: You can take advantage of the following features:
pt_pt: Você pode aproveitar os seguintes recursos:

source: Insert Emoticon ##
pt_pt: Inserir Emoticon ##

source: Sometimes an image is worth a 1000 words: use the new emoji to liven up your instant message and to let your friends know how you’re feeling.
pt_pt: Às vezes, uma imagem vale mais que mil palavras: use os novos emojis para animar as suas mensagens instantâneas e mostrar aos seus amigos como se está a senti-rse.

source: When you are unsure of the characters for a particular smiley, this addon enables you to select and insert it into your text such as in a chat.
pt_pt: Quando você não tiver certeza dos caracteres para um determinado smiley, este complemento permite selecioná-lo e inseri-lo em seu texto, como em um chat.

source: Press NVDA+I, or from menu Tools -> Emoticons > Insert emoticon, to open a dialog with the provided emoticons or emoji.
pt_pt: Pressione NVDA+I ou, no menu Ferramentas -> Emoticons > Inserir emoticon, para abrir uma caixa de diálogo com os emoticons ou emojis disponíveis.

source: This dialog allows you to choose an emoticon and to view the emoticons that interest you:
pt_pt: Esta caixa de diálogo permite que você escolha um emoticon e visualize os emoticons que lhe interessam:

source: An editable field allows you to filter the search for the desired emoticon among the emoticons available.
pt_pt: Um campo editável permite filtrar a pesquisa pelo emoticon desejado entre os emoticons disponíveis.

source: Through a set of radio buttons, you can choose to view only emoji category (alt+E) or view only standard emoticon category (alt+s) or view all emoticons available (alt+A).
pt_pt: Através de um conjunto de botões de opção, você pode escolher visualizar apenas a categoria de emojis (alt+E), apenas a categoria de emoticons padrão (alt+s) ou todos os emoticons disponíveis (alt+A).

source: In the list of emoticons (alt+L) are displayed on three columns respectively: the name of emoticon, the type of emoticon (standard emoticon or emoji), the corresponding character.
pt_pt: Na lista de emoticons (alt+L) são exibidos em três colunas, respectivamente: o nome do emoticon, o tipo de emoticon (emoticon padrão ou emoji) e o caractere correspondente.

source: When you press OK, the characters for the chosen emoticon will be copied to your clipboard, ready for pasting.
pt_pt: Ao pressionar OK, os caracteres do emoticon escolhido serão copiados para a área de transferência, prontos para serem colados.

source: Insert symbol ##
pt_pt: Insira o símbolo ##

source: This dialog allows you to choose one of the symbols available in the Punctuation/symbol pronunciation dialog of NVDA. You can use the Filter edit box or the arrow keys to select an item from the symbols list.
pt_pt: Esta caixa de diálogo permite escolher um dos símbolos disponíveis na caixa de diálogo Pontuação/pronúncia de símbolos do NVDA. Você pode usar a caixa de edição Filtro ou as teclas de seta para selecionar um item da lista de símbolos.

source: If you want to copy various symbols, use the Add button to append them to the Symbols to copy edit box.
pt_pt: Se você deseja copiar vários símbolos, use o botão Adicionar para anexá-los à caixa de edição Símbolos a copiar.

source: Then, press OK and the selected emoji or symbol, or the symbols contained in the mentioned edit box, will be copied to your clipboard, ready for pasting.
pt_pt: Em seguida, pressione OK e o emoji ou símbolo selecionado, ou os símbolos contidos na caixa de edição mencionada, serão copiados para a área de transferência, prontos para serem colados.

source: Associate gestures to symbols ##
pt_pt: Associe gestos a símbolos ##

source: From NVDA's menu, Preferences submenu, Input gestures dialog, category Insert symbols or Copy symbols, you can configure NVDA to type symbols through associated gestures.
pt_pt: No menu do NVDA, submenu Preferências, caixa de diálogo Gestos de entrada, categoria Inserir símbolos ou Copiar símbolos, você pode configurar o NVDA para digitar símbolos por meio de gestos associados.

source: You can use the Edit field edit box to reduce the number of symbols presented, so that this category can be expanded faster.
pt_pt: Você pode usar a caixa de edição do campo Editar para reduzir o número de símbolos apresentados, de modo que essa categoria possa ser expandida mais rapidamente.

source: Emoticons dictionary ##
pt_pt: dicionário de Emoticons ##

source: Emoticons add-on allows to have differents speech-dictionaries using configuration profiles.
pt_pt: O complemento Emoticons permite ter diferentes dicionários de fala usando perfis de configuração.

source: This means that you can create or edit a specific speech-dictionary for each your custom profile.
pt_pt: Isso significa que você pode criar ou editar um dicionário de fala específico para cada perfil personalizado.

source: From NVDA MENU, Preferences -> Speech dictionaries -> Emoticons dictionary, you can open a dialog to add or to edit available emoticons.
pt_pt: No MENU do NVDA, em Preferências -> Dicionários de voz -> Dicionário de emoticons, você pode abrir uma caixa de diálogo para adicionar ou editar os emoticons disponíveis.

source: Saving your customizations, the new reading settings of emoticons will only apply to the profile you are currently editing.
pt_pt: Salvando suas personalizações, as novas configurações de leitura dos emoticons serão aplicadas apenas ao perfil que você está editando no momento.

source: For example, you may wish that NVDA spoken custom emoticons only in XxChat program, but not in other chat programs: you can do this by creating a profile for the XxChat application and assign to it a speech dictionary from Speech dictionaries menu, Emoticons dictionary option. See below for Emoticons settings in relation to the configuration profiles.
pt_pt: Por exemplo, você pode desejar que o NVDA fale emoticons personalizados apenas no programa XxChat, mas não em outros programas de bate-papo: você pode fazer isso criando um perfil para o aplicativo XxChat e atribuindo a ele um dicionário de fala no menu Dicionários de fala, opção Dicionário de emoticons. Veja abaixo as configurações de emoticons em relação aos perfis de configuração.

source: You can also export each custom speech-dictionary pressing "Save and export dictionary" button: in this way your speech-dictionaries will be saved in your user config folder, speechDicts/emoticons subfolder.
pt_pt: Você também pode exportar cada dicionário de voz personalizado clicando no botão “Salvar e exportar dicionário”: dessa forma, seus dicionários de voz serão salvos na pasta de configuração do usuário, na subpasta speechDicts/emoticons.

source: The exact name and location of the dictionary file will be based on the editing configuration profile, which will be shown in the title of the Emoticons dictionary dialog.
pt_pt: O nome e a localização exatos do arquivo do dicionário serão baseados no perfil de configuração de edição, que será exibido no título da caixa de diálogo Dicionário de Emoticons.

source: Emoticons settings ##
pt_pt: Configurações de emoticons

source: From menu Preferences -> Settings -> Emoticons opens a panel to configure the activation of your speech-dictionaries for each profile.
pt_pt: No menu Preferências -> Configurações -> Emoticons, abre-se um painel para configurar a ativação dos seus dicionários de voz para cada perfil.

source: In Emoticons settings panel you can choose whether or not speech-dictionary should automatically activate when NVDA switches to the profile you are currently editing. By default it is disabled in normal configuration of NVDA and in all your new profiles.
pt_pt: No painel de configurações de Emoticons, você pode escolher se o dicionário de fala deve ser ativado automaticamente quando o NVDA mudar para o perfil que você está editando no momento. Por padrão, ele está desativado na configuração normal do NVDA e em todos os seus novos perfis.

source: Moreover, it's possible to determine if the add-on emojis should be spoken. This could be useful to preserve symbols speaking if emojis are included in NVDA's configuration.
pt_pt: Além disso, é possível determinar se os emojis adicionais devem ser falados. Isso pode ser útil para preservar a pronúncia dos símbolos se os emojis estiverem incluídos na configuração do NVDA.

source: If symbols inserted using associated gestures aren't spoken in your system, even when NVDA is configured to speak typed characters, you can try to enable a checkbox to ensure the speaking of inserted symbols.
pt_pt: Se os símbolos inseridos usando gestos associados não forem pronunciados no seu sistema, mesmo quando o NVDA estiver configurado para pronunciar os caracteres digitados, você pode tentar ativar uma caixa de seleção para garantir a pronúncia dos símbolos inseridos.

source: If you may wish to keep clean your configuration folders, in this dialog it is also possible to choose if dictionaries not used (associated with non existing profiles) will be removed from the add-on when it is unloaded.
pt_pt: Se desejar manter suas pastas de configuração organizadas, nesta caixa de diálogo também é possível escolher se os dicionários não utilizados (associados a perfis inexistentes) serão removidos do complemento quando ele for descarregado.

source: Key Commands: ##
pt_pt: Teclas de atalho

source: These are the key commands available by default, you can edit those or add new key to open Emoticons settings panel or Emoticon Dictionary dialog:
pt_pt: Estes são os comandos de teclado disponíveis por padrão. Você pode editá-los ou adicionar uma nova tecla para abrir o painel de configurações de Emoticons ou a caixa de diálogo Dicionário de Emoticons:

source: NVDA+E: speaking emoticons on/off, toggles between speaking text as it is written, or with the emoticons replaced by the human description.
pt_pt: NVDA+E: ativar/desativar emoticons falantes, alterna entre ler o texto tal como está escrito ou substituir os emoticons por descrições humanas.

source: NVDA+I: show a dialog to select an emoticon you want to copy.
pt_pt: NVDA+I: exibe uma caixa de diálogo para selecionar o emoticon que você deseja copiar.

source: Not assigned: show a dialog to select an NVDA's symbol you want to copy.
pt_pt: Não atribuído: mostra um diálogo para seleccionar um símbolo do NVDA que deseja copiar.

source: Not assigned: open a browseable message showing the symbol where the review cursor is positioned, so that the whole description can be reviewed in browse mode.
pt_pt: Não atribuído: abre uma mensagem navegável mostrando o símbolo onde o cursor de revisão está posicionado, para que toda a descrição possa ser revisada no modo de navegação.

source: Not assigned: open a browseable message showing the symbol where the caret is positioned, so that the whole description can be reviewed in browse mode.
pt_pt: Não atribuído: abre uma mensagem navegável mostrando o símbolo onde o cursor está posicionado, para que toda a descrição possa ser revista no modo de navegação.

source: Note: On Windows 10 and higher, it's also possible to use the built-in emoji panel.
pt_pt: Observação: no Windows 10 e versões superiores, também é possível usar o painel de emojis integrado.

source: Changes for 34.0.0
pt_pt: Alterações para a versão 34.0.0

source: Added ability to copy to clipboard, and paste individual symbols, useful when gestures associated with Insert symbols scripts don't work.
pt_pt: Adicionada a capacidade de copiar para a área de transferência e colar símbolos individuais, útil quando os gestos associados aos scripts Inserir símbolos não funcionam.

source: Changes for 33.0.0
pt_pt: Alterações para a versão 33.0.0

source: Fixed bug in Save and export dictionaries.
pt_pt: Corrigido bug em Salvar e exportar dicionários.

source: Added copy and close buttons to messages presented in browse mode.
pt_pt: Adicionados botões de copiar e fechar às mensagens apresentadas no modo de navegação.

source: When using commands to insert symbols, they may be spoken according to the speak typed characters option.
pt_pt: Ao usar comandos para inserir símbolos, eles podem ser pronunciados de acordo com a opção “pronunciar caracteres digitados”.

source: Changes for 22.0.0 ##
pt_pt: Alterações para a versão 22.0.0 ##

source: Requires NVDA 2023.2 or later.
pt_pt: Requer NVDA 2023.2 ou posterior.

source: Changes for 17.0 ##
pt_pt: Alterações para a versão 17.0 ##

source: Added ability to associate gestures to type symbols.
pt_pt: Adicionada a capacidade de associar gestos para digitar símbolos.

source: Added ability to copy various symbols at the same time.
pt_pt: Adicionada a capacidade de copiar vários símbolos ao mesmo tempo.

source: Changes for 16.0 ##
pt_pt: Alterações para a versão 16.0 ##

source: Compatible with NVDA 2023.1.
pt_pt: Compatibilidade com NVDA 2023.1

source: Changes for 15.0 ##
pt_pt: Alterações para a versão 15.0 ##

source: Requires NVDA 2022.1 or later.
pt_pt: Requer NVDA 2022.1 ou posterior.

source: Cannot be used in secure mode.
pt_pt: Não pode ser usado no modo seguro.

source: Changes for 14.0 ##
pt_pt: Alterações para a versão 14.0 ##

source: Compatible with NVDA 2021.1.
pt_pt: Compatível com o NVDA 2021.1.

source: Changes for 13.0 ##
pt_pt: Alterações para a versão 13.0 ##

source: Fixed errors in Insert Emoticon dialog.
pt_pt: Corrigidos erros na caixa de diálogo Inserir Emoticon.

source: Added a dialog to insert a symbol available in the Punctuation/symbol pronunciation of NVDA.
pt_pt: Adicionado um diálogo para inserir um símbolo disponível na Pronúncia de Pontuação/Símbolo do NVDA.

source: Changes for 12.0 ##
pt_pt: Alterações para a versão 12.0 ##

source: Requires NVDA 2019.3 or later.
pt_pt: Requer NVDA 2019.3 ou superiores.

source: Changes for 11.0 ##
pt_pt: Alterações para a versão 11.0 ##

source: When the add-on is updated, dictionaries saved in the previous version of the add-on will be automatically copied to the new version, unless you prefer to import dictionaries saved in the main dictionaries folder of NVDA.
pt_pt: Quando o extra é actualizado, os dicionários guardados na versão anterior do extra serão automaticamente copiados para a nova versão, a menos que prefira importar dicionários guardados na pasta principal de dicionários do NVDA.

source: When showing the symbol where the caret or the review cursor are positioned, the words Character and Replacement are used to distinguish between the symbol itself and its description in browse mode, useful for speech users.
pt_pt: Ao mostrar o símbolo onde o cursor ou o cursor de revisão estão posicionados, as palavras Caractere e Substituição são usadas para distinguir entre o símbolo em si e sua descrição no modo de navegação, útil para usuários de voz.

source: Changes for 10.0 ##
pt_pt: Alterações para a versão 10.0 ##

source: Added commands to show the symbol where the review cursor or caret are positioned. Gestures for these commands can be assigned from the Input gestures dialog, Text review category.
pt_pt: Adicionados comandos para mostrar o símbolo onde o cursor de revisão ou o cursor de inserção estão posicionados. Os gestos para esses comandos podem ser atribuídos na caixa de diálogo Gestos de entrada, categoria Revisão de texto.

source: Changes for 9.0 ##
pt_pt: Alterações para a versão 9.0 ##

source: Added the possibility of choosing if add-on emojis should be spoken.
pt_pt: Adicionada a possibilidade de escolher se os emojis adicionais devem ser falados.

source: Used appropiate encoding for dictionary names, fixing errors when they contain certain characters.
pt_pt: Utilizou codificação apropriada para nomes de dicionários, corrigindo erros quando estes contêm determinados caracteres.

source: The translated summary of the add-on is properly used for the title presented in add-on help, accessible from the add-on manager.
pt_pt: O resumo traduzido do complemento é usado corretamente para o título apresentado na ajuda do complemento, acessível a partir do gerenciador de complementos.

source: Added a note mentioning the emoji panel available on Windows 10.
pt_pt: Adicionada uma nota mencionando o painel de emojis disponível no Windows 10.

source: Changes for 8.0 ##
pt_pt: Alterações para a versão 8.0 ##

source: Compatible with NVDA 2018.3 or later (required).
pt_pt: Compatível com NVDA 2018.3 ou posterior (necessário).

source: Changes for 7.0 ##
pt_pt: Alterações para a versão 7.0 ##

source: The Activation settings dialog has been moved to a panel in NVDA settings, so that the current profile will be shown in the title of the NVDA settings dialog.
pt_pt: A caixa de diálogo Configurações de ativação foi movida para um painel nas configurações do NVDA, de modo que o perfil atual será exibido no título da caixa de diálogo Configurações do NVDA.

source: The Manage Emoticons menu has been removed: now Insert emoticon will be found under the Tools menu, and Customize Emoticons will be shown under Speech dictionaries like Emoticons dictionary.
pt_pt: O menu Gerenciar Emoticons foi removido: agora, Inserir emoticon será encontrado no menu Ferramentas, e Personalizar Emoticons será exibido em Dicionários de fala, como Dicionário de Emoticons.

source: Requires NVDA 2018.2 or later.
pt_pt: Requer NVDA 2018.2 ou posterior.

source: Changes for 6.0 ##
pt_pt: Alterações para a versão 6.0 ##

source: Added support for configuration profiles.
pt_pt: Adicionado suporte para perfis de configuração.

source: In NVDA 2017.4 or later, the configuration settings and custom dictionaries will change automatically according with the selected profiles. In 2017.3 or earlier, you can apply changes by reloading plugins (pressing control+NVDA+f3).
pt_pt: No NVDA 2017.4 ou posterior, as configurações e os dicionários personalizados serão alterados automaticamente de acordo com os perfis selecionados. Na versão 2017.3 ou anterior, você pode aplicar as alterações recarregando os plug-ins (pressionando Control+NVDA+F3).

source: If you choose to import settings when updating the add-on, deprecated files (emoticons.ini and emoticons.dic) will be removed or adapted to this version.
pt_pt: Se você optar por importar as configurações ao atualizar o complemento, os arquivos obsoletos (emoticons.ini e emoticons.dic) serão removidos ou adaptados a esta versão.

source: Changes for 5.0 ##
pt_pt: Alterações para a versão 5.0 ##

source: Added support for emojis.
pt_pt: Adicionado suporte para emojis.

source: Improvements for Insert Emoticon dialog with a filter field and radio buttons to choose displayed emoticons.
pt_pt: Melhorias na caixa de diálogo Inserir Emoticon com um campo de filtro e botões de opção para escolher os emoticons exibidos.

source: Using guiHelper for Activation settings dialog and Insert Emoticon dialog: requires NVDA 2016.4 or higher versions
pt_pt: Utilização do guiHelper para a caixa de diálogo Configurações de ativação e a caixa de diálogo Inserir emoticon: requer NVDA 2016.4 ou versões superiores.

source: Changes for 4.0 ##
pt_pt: Alterações para a versão 4.0 ##

source: If the Insert smiley dialog is opened when another settings dialog is active, NVDA will show the corresponding error message.
pt_pt: Se a caixa de diálogo Inserir smiley for aberta quando outra caixa de diálogo de configurações estiver ativa, o NVDA exibirá a mensagem de erro correspondente.

source: Changes for 3.0 ##
pt_pt: Alterações para a versão 3.0 ##

source: In the Customize emoticons dialog, it is now possible to specify that a pattern should only match if it is a whole word, according to speech dictionaries of NVDA 2014.4.
pt_pt: Na caixa de diálogo Personalizar emoticons, agora é possível especificar que um padrão só deve corresponder se for uma palavra inteira, de acordo com os dicionários de fala do NVDA 2014.4.

source: Changes for 2.0 ##
pt_pt: Alterações para a versão 2.0 ##

source: Add-on help is available from the Add-ons Manager.
pt_pt: A ajuda sobre complementos está disponível no Gerenciador de Complementos.

source: Changes for 1.1 ##
pt_pt: Alterações para a versão 1.1 ##

source: Removed duplicated emoticon.
pt_pt: Removido emoticon duplicado.

source: Added some smileys.
pt_pt: Adicionadas algumas carinhas.

source: Changes for 1.0 ##
pt_pt: Alterações para a versão 1.0 ##

source: Initial version.
pt_pt: Versão inicial.
