Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/customNotifications/*/customNotifications.xliff
Languages: pt_pt, ru, tr, zh_tw

source: Custom Notifications #
pt_pt: Notificações personalizadas #
ru: Персонализированные Уведомления #
tr: Bildirimleri Özelleştir #
zh_tw: 自訂通知 #

source: Authors: José Fischer, Noelia Ruiz Martínez
pt_pt: Autores: José Fischer, Noelia Ruiz Martínez
ru: Авторы: José Fischer, Noelia Ruiz Martínez
tr: Yazarlar: José Fischer, Noelia Ruiz Martínez
zh_tw: 作者：José Fischer, Noelia Ruiz Martínez

source: This add-on is used to customize toast notifications.
pt_pt: Esse complemento é usado para personalizar as notificações de torradas.
ru: Это дополнение используется для настройки всплывающих уведомлений.
tr: Bu eklenti, bildirim bildirimlerini özelleştirmek için kullanılır.
zh_tw: 此附加元件用於自訂彈出式通知。

source: You can choose to read the whole notification or just the application which sends it, and if notifications will be spoken, displayed in braille or both.
pt_pt: Você pode optar por ler toda a notificação ou apenas o aplicativo que a envia, e se as notificações serão faladas, exibidas em braile ou ambas.
ru: Вы можете разрешить чтение всего уведомления или только названия приложения, которое его отправило, а также выбрать, озвучивать ли уведомления, показывать их по Брайлю или и то, и другое.
tr: Bildirimin tamamını ya da sadece gönderen uygulamayı okumayı, bildirimlerin sesli mi, braille mi yoksa her ikisiyle mi görüntüleneceğini seçebilirsiniz.
zh_tw: 您可以選擇讀取整則通知或只讀取發出通知的應用程式，以及通知要以語音、點字或兩者同時呈現。

source: Settings ##
pt_pt: Configurações...
ru: Настройки ##
tr: Ayarlar ##
zh_tw: 設定 ##

source: Go to NVDA's menu, Preferences submenu, Settings, and select the Custom Notifications category. There you'll find the following controls:
pt_pt: Acesse o menu do NVDA, submenu Preferências, Configurações e selecione a categoria Notificações personalizadas. Lá você encontrará os seguintes controles:
ru: Перейдите в меню NVDA, подменю "Параметры", "Настройки" и выберите категорию "Персонализированные уведомления". Там вы найдете следующие элементы управления:
tr: NVDA menüsüne, Tercihler alt menüsüne, Ayarlar'a gidin ve Bildirimleri Özelleştir kategorisini seçin. Burada aşağıdaki kontrolleri bulacaksınız:
zh_tw: 請前往 NVDA 功能表、偏好、設定，然後選取自訂通知類別。您會在其中找到以下控制項：

source: A checkbox to choose if notifications should be truncated, checked by default.
pt_pt: Uma caixa de seleção para escolher se as notificações devem ser truncadas, marcada por padrão.
ru: Флажок для сокращения уведомления, установлен по умолчанию.
tr: Bildirimlerin kısaltılıp kısaltılmayacağını seçen onay kutusu varsayılan olarak işaretlidir.
zh_tw: 一個用以選擇是否應截斷通知的核取方塊，預設為勾選。

source: An edit box to set the start limit of notifications, empty by default.
pt_pt: Uma caixa de edição para definir o limite de início das notificações, vazia por padrão.
ru: Поле редактирования для установки начального предела уведомлений, по умолчанию пустое.
tr: Bildirimlerin başlangıç ​​sınırını ayarlamak için varsayılan olarak boş olan bir düzenleme kutusu.
zh_tw: 一個用以設定通知起始限制的編輯區，預設為空白。

source: An edit box to set the end limit of notifications, ", " (comma space) by default.
pt_pt: Uma caixa de edição para definir o limite final das notificações, ", " (espaço com vírgula) por padrão.
ru: Поле редактирования для конечного предела уведомлений, ", " (запятая пробел) по умолчанию.
tr: Bildirimlerin bitiş sınırını varsayılan olarak ", " (virgül alanı) olarak ayarlamak için bir düzenleme kutusu.
zh_tw: 一個用以設定通知結束限制的編輯區，預設為「, 」(逗號加空格)。

source: A list of checkboxes to select if notifications should be spoken and displayed in braille, both checked by default.
pt_pt: Uma lista de caixas de seleção para escolher se as notificações devem ser faladas e exibidas em braile, ambas marcadas por padrão.
ru: Список флажков, который позволяет выбрать, озвучивать ли уведомления и показывать ли их по Брайлю, по умолчанию они оба отмечены.
tr: Bildirimlerin sesli olarak söylenip söylenmeyeceğini ve Braille ile görüntülenip görüntülenmeyeceğini seçen onay kutularının listesi; her ikisi de varsayılan olarak işaretlidir.
zh_tw: 一組用以選取通知是否應以語音及點字呈現的核取方塊，預設皆為勾選。

source: An edit box to type a text to send a test notification, to get an idea of how NVDA will present toasts.
pt_pt: Uma caixa de edição para digitar um texto para enviar uma notificação de teste, para ter uma ideia de como o NVDA apresentará os brindes.
ru: Поле редактирования для ввода текста для отправки тестового уведомления, чтобы получить представление о том, как NVDA будет предоставлять уведомления.
tr: NVDA'nın bildirimleri nasıl sunacağına dair fikir edinmek amacıyla bir test bildirimi göndermek üzere bir metin yazabileceğiniz bir düzenleme kutusu.
zh_tw: 一個編輯區，用以輸入文字來傳送測試通知，以便了解 NVDA 將如何呈現彈出式通知。

source: If the previous edit box contains text, a button to send a notification, so you can test if your selected settings work fine for you.
pt_pt: Se a caixa de edição anterior contiver texto, um botão para enviar uma notificação, para que você possa testar se as configurações selecionadas funcionam bem para você.
ru: Если предыдущее поле редактирования содержит текст, нажмите появившуюся кнопку для отправки уведомления и проверки, подходят ли вам выбранные настройки.
tr: Önceki düzenleme kutusu metin içeriyorsa, bildirim göndermeye yönelik bir düğme bulunur; böylece seçtiğiniz ayarlarınızın sizin için uygun olup olmadığını test edebilirsiniz.
zh_tw: 若前一個編輯區中有文字，則會出現一個用以傳送通知的按鈕，讓您可以測試所選的設定是否符合您的需求。

source: You can assign a gesture to open the add-on settings panel, and to toggle various add-on settings, from NVDA's menu, Preferences submenu, Input gestures dialog, Configuration category.
pt_pt: Você pode atribuir um gesto para abrir o painel de configurações do complemento e alternar várias configurações do complemento no menu do NVDA, submenu Preferências, caixa de diálogo Gestos de entrada, categoria Configuração.
ru: В меню NVDA, подменю параметров, диалоге жестов ввода, категории конфигурации, вы можете назначить жест для открытия панели настроек дополнения и переключения различных его настроек.
tr: Eklenti ayarları panelini açmak ve çeşitli eklenti ayarları arasında geçiş yapmak için NVDA menüsünden, Tercihler alt menüsünden, Girdi hareketleri iletişim kutusundan, Konfigürasyon kategorisinden bir hareket atayabilirsiniz.
zh_tw: 您可以從 NVDA 功能表、偏好、輸入手勢對話框、組態類別中，為開啟此附加元件的設定及切換各項設定指派手勢。

source: Changes for 2.0.0 ##
pt_pt: Alterações para a versão 2.0.0 ##
ru: Изменения для 2.0.0 ##
tr: 2.0.0 için değişiklikler ##
zh_tw: 2.0.0 版的變更 ##

source: In the add-on settings panel, added an edit box to set the start limit of notifications.
pt_pt: No painel de configurações do complemento, foi adicionada uma caixa de edição para definir o limite de início das notificações.
ru: На панели настроек дополнения добавлено поле редактирования для установки начального предела уведомлений.
tr: Eklenti ayarları paneline, bildirimlerin başlangıç ​​sınırını ayarlamak için bir düzenleme kutusu eklendi.
zh_tw: 在附加元件設定中，新增了用以設定通知起始限制的編輯區。
