Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/customNotifications/*/customNotifications.po
Languages: fi, ru, tr, zh_tw

source: Shows the %s settings.
fi: Näyttää %s -lisäosan asetukset.
ru: Показывает настройки %s.
tr: %s ayarlarını gösterir.
zh_tw: 顯示%s設定。

source: Toggles Truncate notifications option of %s.
fi: Ottaa käyttöön tai poistaa käytöstä %s -lisäosan Katkaise ilmoitukset -asetuksen.
ru: Переключает параметр сокращения уведомлений в %s.
tr: %s için bildirimleri kısalt seçeneğini açar/kapatır.
zh_tw: 切換 %s 的截斷通知選項。

source: Truncate notifications disabled
fi: Ilmoitusten katkaisu ei käytössä
ru: Сокращение уведомлений выключено
tr: Bildirimleri kısalt devre dışı
zh_tw: 停用截斷通知

source: Truncate notifications enabled
fi: Ilmoitusten katkaisu käytössä
ru: Сокращение уведомлений включено
tr: Bildirimleri kısalt etkin
zh_tw: 啟用截斷通知

source: Toggles speech option of %s.
fi: Ottaa käyttöön tai poistaa käytöstä %s -lisäosan puheasetuksen.
ru: Переключает параметр речи в %s.
tr: %s için konuşma seçeneğini değiştirir.
zh_tw: 切換%s的語音 選項。

source: Speech disabled for %s
fi: %s -lisäosan puhe ei käytössä
ru: Речь выключена для %s
tr: %s için konuşma devre dışı
zh_tw: 停用語音%s

source: Speech enabled for %s
fi: %s -lisäosan puhe käytössä
ru: Речь включена для %s
tr: %s için konuşma etkin
zh_tw: 啟用語音%s

source: Toggles braille option of %s.
fi: Ottaa käyttöön tai poistaa käytöstä %s -lisäosan pistekirjoitusasetuksen.
ru: Переключает параметр Брайля в %s.
tr: %s için braille seçeneğini değiştirir.
zh_tw: 切換 %s 的點字選項。

source: Braille disabled for %s
fi: %s -lisäosan pistekirjoitus ei käytössä
ru: Брайль выключен для %s
tr: %s için Braille devre dışı
zh_tw: 停用點字顯示%s

source: Braille enabled for %s
fi: %s -lisäosan pistekirjoitus käytössä
ru: Брайль включён для %s
tr: %s için Braille etkin
zh_tw: 啟用點字顯示%s

source: &Truncate notifications
fi: &Katkaise ilmoitukset
ru: & Сократить уведомления
tr: Bildirimleri kısal&t
zh_tw: 截斷通知(&T)

source: Type the characters to be used as the &start limit of notifications
fi: Kirjoita merkit, joita käytetään ilmoitusten a&lun rajana
ru: Введите символы, которые будут использоваться в качестве &начального значения для уведомлений
tr: Bildirimlerin başlangıç &sınırı olarak kullanılacak karakterleri yazın
zh_tw: 截斷通知的開始字元(&S)

source: Type the characters to be used as the end &limit of notifications
fi: Kirjoita merkit, joita käytetään ilmoitusten lo&pun rajana
ru: Введите символы, которые будут использоваться в качестве &конечного значения уведомлений
tr: Bi&ldirimlerin bitiş sınırı olarak kullanılacak karakterleri yazın
zh_tw: 截斷通知的結束字元(&L)

source: Sele&ct output modes for notifications
fi: Val&itse ilmoitusten tulostustilat
ru: & Выберите режимы вывода уведомлений
tr: Bildirimler için &çıkış modlarını seçin
zh_tw: 選擇通知的輸出模式(&C)

source: Speech
fi: Puhe
ru: Речь
tr: Konuşma
zh_tw: 語音

source: Braille
fi: Pistekirjoitus
ru: Брайль
zh_tw: 點字

source: Type the text to show a test &notification
fi: Kirjoita tekstiä näyttääksesi testi-il&moituksen
ru: Введите текст & тестового уведомления
tr: Bir test bildirimi göstermek içi&n metni yazın
zh_tw: 輸入內容以測試通知顯示方式(&N)

source: &Show test notification
fi: &Näytä testi-ilmoitus
ru: & Показать тестовое уведомление
tr: Test bildirimini gö&ster
zh_tw: 顯示測試通知(&E)

source: Custom Notifications
fi: Mukautetut ilmoitukset
ru: Персонализированные уведомления
tr: Bildirimleri Özelleştir
zh_tw: 自訂通知

source: Choose how NVDA should read toast notifications. You can read just the application which sent a toast, and choose if notifications are spoken, displayed in braille or both. This may improve your experience with toast notifications and help you to keep your privacy.
fi: Valitse, miten NVDA lukee ilmoitusruudut. Voit valita pelkän ilmoituksen lähettäneen sovelluksen lukemisen ja puhutaanko ilmoitukset, näytetäänkö ne pistenäytöllä vai sekä että. Tämä voi parantaa kokemustasi ilmoitusruuduista ja auttaa säilyttämään yksityisyytesi.
ru: Это дополнение позволяет выберать, как NVDA должа выводить всплывающие уведомления. Вы можете настроить NVDA для чтения только имени приложения, из которого пришло уведомление, а также выбрать, будут ли уведомления озвучены, показаны по брайлю или и то, и другое. Это может улучшить ваш опыт работы с уведомлениями и помочь вам сохранить конфиденциальность.
tr: NVDA'nın bildirimleri nasıl okuması gerektiğini seçin. Yalnızca bir tost gönderen uygulamayı okuyabilir ve bildirimlerin konuşulup, Braille ile gösterilmesini veya her ikisini de seçebilirsiniz. Bu, tost bildirimleriyle deneyiminizi geliştirebilir ve gizliliğinizi korumanıza yardımcı olabilir.
zh_tw: 選擇 NVDA 應如何讀取彈出式通知。 您可以只讀取發出通知的應用程式，並選擇通知要以語音、點字或兩者同時呈現。 這可能會改善您使用彈出式通知的體驗，並有助於保護您的隱私。
