Repository: nvdaes/translateNvdaAddonsWithCrowdin
Catalog: _addonL10n/instantTranslate/*/instantTranslate.xliff
Languages: ru, tr

source: Instant Translate #
tr: Anında Çeviri #

source: Authors: Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto Buffolino and other NVDA contributors.
ru: Авторы: Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto Buffolino и другие участники сообщества NVDA.
tr: Yazarlar: Alexy Sadovoy, Beqa Gozalishvili, Mesar Hameed, Alberto Buffolino ve diğer NVDA gönüllüleri.

source: Download [stable version][1]
ru: Загрузить [стабильную версию][1]
tr: [Kararlı Sürümü İndirin][1]

source: Download [development version][2]
ru: Загрузить [разрабатываемую версию][2]
tr: [Geliştirici sürümünü indirin][2]

source: This add-on is used to translate selected and/or clipboard text from one language to another.
ru: Это дополнение используется для перевода выделенного текста и/или текста из буфера обмена с одного языка на другой.
tr: Bu eklenti, seçili ve/veya pano metnini bir dilden diğerine çevirmek için kullanılır. Bu, Google Çeviri hizmeti kullanılarak yapılır.

source: This is done using the Google Translate service.
ru: Это делается с помощью службы Google Translate.
tr: Bu, Google Çeviri hizmeti kullanılarak yapılır.

source: Configuring languages ##
ru: Настройка языков ##
tr: Dillerin ayarlanması ##

source: To configure source, target and in case swap language, go to: NVDA Menu >> Preferences >> Instant Translate Settings.
ru: Чтобы настроить исходный, целевой и иногда язык для перемены местами, перейдите: NVDA Меню >> Параметры >> Настройки Instant Translate.
tr: Kaynak, hedef ve takas dilini yapılandırmak için şuraya gidin: NVDA Menüsü >> Tercihler >> Ayarlar iletişim kutusu >> Anında Çeviri kategorisi.

source: There are two comboboxes labeled "Source language" and "Target language", and a checkbox to decide if it must copy the translation to clipboard.
ru: Здесь два комбинированных списка, помеченые "исходный язык" и "Целевой язык", и флажок для копирования перевода в буфер, если это необходимо.
tr: "Kaynak dil" ve "Hedef dil" etiketli iki seçim kutusu ve çevirinin panoya kopyalanıp kopyalanmayacağını bbelirlemek için bir onay kutusu bulunur.

source: In addition, if you selected auto option (the first choice) from "Source language" combobox, there are also a combobox labeled "Language for swapping" and a checkbox about the auto-swap.
ru: Кроме того, если вы выбрали автоматическое определение языка (первый выбор) в комбинированном списке "исходный язык", есть также комбинированный список с названием "Язык для смены местами" и флажок автоматической перемены.
tr: Ek olarak, "Kaynak dil" seçim kutusundan otomatik seçeneği (ilk tercih) seçtiyseniz, "Değişim için kullanılacak dil" etiketli bir seçim kutusu ve otomatik takas hakkında bir onay kutusu da gösterilir.

source: The meaning of two first comboboxes and checkbox for copy is clear, but some words about the rest are necessary. Remember always that the explanations below assume the source language set on the auto option.
ru: Значение двух первых комбинированных списков и флажка для копирования понятно, но необходимо сказать несколько слов об остальном. Всегда помните, что в приведённых ниже пояснениях предполагается, что параметр исходного языка установлен "Автоматически определять язык".
tr: İlk iki seçim kutusunun ve kopyalamayla ilgili onay kutusunun anlamı bariz, ancak geri kalanı hakkında bazı açıklamalar gerekebilir. Aşağıdaki açıklamaların otomatik seçeneğinde ayarlanan kaynak dili varsaydığını daima unutmayın.

source: The "Language for swapping" combobox is useful when you swap via script (see below) the source and target language; in fact, a target language set on the auto option has no sense, so the addon sets it to value of combobox above.
ru: Комбинированный список "Язык для замены" полезен, когда вы меняете исходный и целевой языки с помощью скрипта (см. ниже); на самом деле, целевой язык, заданный как автоматически, не имеет смысла, поэтому дополнение устанавливает для него значение в поле со списком, указанном выше.
tr: "Değişim için dil" seçim kutusu, kaynak ve hedef dili komut dosyası aracılığıyla değiştirdiğinizde (aşağıya bakın) kullanışlıdır; aslında, otomatik seçeneğinde ayarlanan bir hedef dilin bir anlamı yoktur, bu nedenle eklenti onu yukarıdaki seçim kutusundaki değere ayarlar.

source: So, imagine this situation: you usually translate into English (your main language), but sometimes (for example, when you write a document) you need to translate into Italian (your second language, suppose); you can set "Language for swapping" combobox to Italian, so you will translate from English to Italian without accessing directly to the addon settings. Obviously this function has a major or minor utility according to your more frequent needs.
ru: Итак, представьте себе такую ситуацию: обычно вы переводите на английский (ваш основной язык), но иногда (например, когда вы пишете документ) вам нужно перевести на итальянский (предположим, ваш второй язык); вы можете установить в комбинированном списке "Язык для замены" значение итальянский, таким образом, вы будете переводить с английского на итальянский без прямого доступа к настройкам дополнения. Очевидно, что эта функция может быть как основной, так и второстепенной, в зависимости от ваших наиболее частых потребностей.
tr: Öyleyse, şu durumu farzedin: genellikle türkçe'ye (ana diliniz) çeviri yaparsınız, ancak bazen (örneğin, bir belge yazarken) İngilizce'ye'ya (diyelim ki ikinci diliniz) çevirmeniz gerekebilir; "değişim için kullanılacak dil" seçim kutusunu İngilizce'ye ayarlayabilirsiniz, böylece eklenti ayarlarına tekrar girmeksizin Türkçe'den İngilizce'ye çeviri yapabilirsiniz. Açıkçası, bu işlevin daha sık ihtiyaçlarınıza göre büyük veya küçük bir faydası vardır.

source: Now, the auto-swap checkbox: it appears if and only if you set the auto option in "Source language" combobox, and is directly connected with "Language for swapping" combobox. If you activate it, then the addon tries to commute automatically from your source and target configuration to a configuration where target becomes the source language, and language selected in "Language for swapping" combobox is the new target language; extremely useful if the source language of the text you want translate is the target language.
ru: Теперь установите флажок автоматической замены: он появляется тогда и только тогда, когда вы устанавливаете параметр "автоматически" в выпадающем списке "Исходный язык" и напрямую связан с выпадающим списком "Язык для замены". Если вы активируете его, то дополнение попытается автоматически переключиться с вашей исходной и целевой конфигурации на конфигурацию, в которой целевой язык становится исходным, а язык, выбранный в комбинированном списке "Язык для замены", является новым целевым языком; чрезвычайно полезно, если исходный язык текста, который вы хотите перевести, является языком перевода.
tr: Şimdi, otomatik takas onay kutusu: Yalnızca "Kaynak dil" seçim kutusunda otomatik seçeneğini ayarlamışsanız gösterilir ve "takas için dil" seçim kutusunda belirlediğiniz dil kullanılır. Etkinleştirirseniz, eklenti, kaynak ve hedef yapılandırmanızdan otomatik olarak hedefin kaynak dil olduğu ve "takas için dil" seçim kutusunda seçilen dilin yeni hedef dil olacağı bir konfigürasyona geçiş yapmaya çalışır; Çevirmek istediğiniz metnin dili hedef olarak belirlemiş olduğunuz dille aynıysa son derece kullanışlı olabilir.

source: A simple example: take again in mind the situation imagined previously; if you translate a text in a language different from English, there is no problem, you get the correct translation in English. But if you need to translate a text from English, normally you get a translation into English identical to original text, and this is a bit useless. Thanks to auto-swap function, however, assuming that you want to know how your text sounds into Italian, the addon commutes automatically the target language to Italian, so it returns a valid translation.
ru: Простой пример: еще раз вспомните ситуацию, представленную ранее; если вы переводите текст на язык, отличный от английского, проблем не возникает, вы получаете правильный перевод на английский. Но если вам нужно перевести текст с английского, обычно вы получаете перевод на английский, идентичный оригинальному тексту, и это немного бесполезно. Однако благодаря функции автоматической замены, предполагая, что вы хотите знать, как звучит ваш текст на итальянском, дополнение автоматически переключает язык перевода на итальянский, поэтому возвращает правильный перевод.
tr: Basit bir örnek: daha önce farzedilen durumu tekrar hatırlayın; Bir metni İngilizce'den farklı bir dilden çeviriyorsanız sorun olmaz, İngilizce'de doğru çeviriyi alırsınız. Ancak İngilizce'den bir metni çevirmeniz gerekiyorsa, normalde orijinal metinle aynı olan İngilizce'ye bir çeviri alırsınız ve bu biraz işe yaramaz. Ancak otomatik değiş tokuş işlevi sayesinde, metninizin İtalyancaya nasıl geldiğini bilmek istediğinizi varsayarsak, eklenti hedef dili otomatik olarak İtalyancaya çevirir, böylece geçerli bir çeviri döndürür sonuç olarak.

source: Anyway, this is a temporary configuration; if this option has no effect (it's experimental), try to commute manually to a stable configuration, using the gesture for swapping described below. It's experimental because in some situations (with short texts, typically), Google does not recognize the real source language correctly, and you have to swap languages manually via script, so to force the source language to be the previous target language (English in our example).
ru: В любом случае, это временная конфигурация; если эта опция не работает (она экспериментальная), попробуйте вручную переключиться на стабильную конфигурацию, используя жест для переключения, описанный ниже. Это экспериментальный подход, потому что в некоторых ситуациях (как правило, при работе с короткими текстами) Google неправильно распознаёт реальный исходный язык, и вам приходится менять языки вручную с помощью скрипта, чтобы заставить исходный язык быть предыдущим целевым языком (в нашем примере - английским).
tr: Neyse, bu geçici bir yapılandırmadır; bu seçeneğin bir etkisi yoksa (deneyseldir), aşağıda açıklanan takas hareketini kullanarak manuel olarak kararlı bir yapılandırmaya geçmeyi deneyin. Deneyseldir, çünkü bazı durumlarda (genellikle kısa metinlerle), Google gerçek kaynak dili doğru tanımaz ve kaynak dili önceki hedef dil olmaya zorlamak için dilleri komut dosyası aracılığıyla manuel olarak değiştirmeniz gerekir (örneğimizde İngilizceye).

source: At least, in the speech settings parameters dialog (NVDA Menu >> Preferences >> Speech), you may want to check the "Automatic language switching (when supported)" option. This way, if you are using a multi-lingual synthesizer, the translation will be announced using the target language voice of the synthesizer.
ru: По крайней мере, в диалоге параметров настройки речи (меню NVDA >> Параметры >> Речь) вы можете захотеть установить флажок "Автоматическое переключение языка (если поддерживается)". Таким образом, если вы используете многоязычный синтезатор, перевод будет озвучен голосом синтезатора на целевом языке.
tr: En azından konuşma ayarları kategorisinde (NVDA Menüsü >> Tercihler >> ayarlar iletişim kutusu), "destekleniyorsa konuşma dilini otomatik olarak değiştir" seçeneğini işaretlemek isteyebilirsiniz. Bu şekilde, çok dilli bir sentezleyici kullanıyorsanız çeviri, sentezleyicinin hedef dil sesi kullanılarak söylenir.

source: Using ##
ru: Использование ##
tr: Kullanma ##

source: You can use this add-on in three ways:
ru: Вы можете использовать это дополнение тремя способами:
tr: Bu eklentiyi üç şekilde kullanabilirsiniz:

source: Select some text using selection commands (shift with arrow keys, for example) and press associated key to translate. translation result will be read with synthesizer which you are using.
ru: Выделите текст с помощью команд выделения (например, shift с помощью клавиш со стрелками) и нажмите соответствующую клавишу для перевода. результат перевода будет прочитан с помощью синтезатора, который вы используете.
tr: Seçim komutlarını kullanarak bir metin seçin (örneğin, shift tuşuyla birlikte ok tuşlarını kullanın) ve çevirmek için ilgili tuşa basın. çeviri sonucu kullandığınız sentezleyici ile okunacaktır.

source: You can also translate text from the Clipboard.
ru: Вы также можете перевести текст из буфера обмена.
tr: Panodaki metni de çevirebilirsiniz.

source: Press the dedicated shortcut key to translate the last spoken text.
ru: Нажмите специальную комбинацию клавиш, чтобы перевести последний произнесенный текст.
tr: Son söylenen metni çevirmek için ilgili kısayol tuşuna basın.

source: Shortcuts ##
ru: Горячие клавиши ##
tr: Kısayollar ##

source: All following commands must be pressed after modifier key "NVDA+Shift+t":
ru: Все следующие команды клавиш нужно нажимать после клавишного модификатора "NVDA+Shift+t":
tr: Aşağıdaki tüm komutlar "NVDA+Shift+t" tuşları ile komut katmanını açtıktan sonra kullanılabilir:

source: T: Translate selected text,
ru: T: Перевести выделенный текст,
tr: T: Seçili metni çevir,

source: Shift+t: translate text from the Clipboard,
ru: Shift+t: перевести текст из буфера обмена,
tr: Shift+t: Panodaki metni çevir,

source: S: swap source and target languages,
ru: S: поменять местами исходный и целевой языки,
tr: S: kaynak ve hedef dilleri değiştir,

source: A: announce current configuration,
ru: A: объявить текущую конфигурацию,
tr: A: mevcut konfigürasyonu söyle,

source: C: copy last result to clipboard,
ru: C: скопировать последний результат в буфер обмена,
tr: C: son sonucu panoya kopyala,

source: I: identify the language of selected text,
ru: I: определить язык выделенного текста,
tr: I: seçilen metnin dilini tanımla,

source: L: translate the last spoken text,
ru: L: перевести последний произнесённый текст,
tr: L: son konuşulan metni çevir,

source: O: open translation settings dialog
ru: O: открыть диалог настроек перевода
tr: O: çeviri ayarları iletişim kutusunu aç

source: H: announces all available layered commands.
ru: H: объявляет все доступные многоуровневые команды.
tr: H: mevcut tüm katman komutlarını duyurur.

source: Changes for 4.7 ##
ru: Изменения в версии 4.7 ##
tr: 4.7 için değişiklikler ##

source: Updated to be compatible with python3.11 and nvda 2024.1
ru: Обновлено для совместимости с Python3.11 и NVDA 2024.1
tr: Python3.11 ve NVDA 2024.1 ile uyumlu olacak şekilde güncellendi

source: Implemented speakOnDemand mode
ru: Реализован режим speakOnDemand
tr: Talep üzerine konuşma modu uygulandı

source: Fixed case with caching failled translations
ru: Исправлен случай с невозможностью кэширующих переводов
tr: Önbelleğe alma başarısız çevirilerle ilgili durum düzeltildi

source: Added chinese mirror for translation
ru: Добавлено китайское зеркало для перевода
tr: Çince çeviri için Çince ayna eklendi

source: Changes for 4.4.2 ##
ru: Изменения в версии 4.4.2 ##
tr: 4.4.2 için değişiklikler ##

source: Restore language detection and auto-swapping (Thanks to Cyrille for fix)
ru: Восстановление функции определения языка и автоматической замены (спасибо Cyrille за исправление)
tr: Dil algılama ve otomatik dil değiştirme düzeltildi (Düzeltme için Cyrille'a teşekkürler)

source: updated languages for translation (thanks to Cyrille)
ru: обновлены языки для перевода (спасибо Cyrille)
tr: çeviri için güncellenmiş diller (Cyrille'e teşekkürler)

source: Changes for 4.4 ##
ru: Изменения в версии 4.4 ##
tr: 4.4 için değişiklikler ##

source: Instant translate is now compatible with NVDA 2019.3 (Python 3 versions of NVDA)
ru: Instant translate теперь совместим с NVDA 2019.3 (NVDA на Python 3)
tr: Anında çeviri artık NVDA 2019.3 ile (NVDA'nın Python 3 sürümleri) uyumlu

source: Changes for 4.3 ##
ru: Изменения в версии 4.3 ##
tr: 4.3 için değişiklikler ##

source: nvda compatibility fix Now instant translate will be compatible with latest nvda builds.
ru: исправлена ошибка совместимости, теперь instant translate будет совместим с последними сборками nvda.
tr: nvda uyumluluk düzeltmesi Şimdi anında çeviri, en son nvda derlemeleriyle uyumlu olacak.

source: found a way to use google as a translation service again.
ru: снова найден способ использовать Google в качестве сервиса переводов.
tr: google'ı tekrar bir çeviri hizmeti olarak kullanmanın bir yolu bulundu.

source: Changes for 4.2 ##
ru: Изменения в версии 4.2 ##
tr: 4.2 için değişiklikler ##

source: Restored working state with newer versions of nvda.
ru: Восстановлено рабочее состояние с помощью более новых версий nvda.
tr: Daha yeni nvda sürümleriyle çalışması sağlandı.

source: Restored automatic language detection.
ru: Восстановлено автоматическое определение языка.
tr: Otomatik dil algılama özelliği düzeltildi.

source: Changes for 4.1 ##
ru: Изменения в версии 4.1 ##
tr: 4.1 için değişiklikler ##

source: InstantTranslate is working again, now with Yandex translator service instead of Google.
ru: InstantTranslate снова работает со службой переводчика Яндекс вместо Google.
tr: Anında Çeviri, artık Google yerine Yandex çeviri hizmetiyle yeniden çalışıyor.

source: Changes for 4.0 ##
ru: Изменения в версии 4.0 ##
tr: 4.0 için değişiklikler ##

source: Translation is automatically performed after swapping.
ru: Результат перевода теперь автоматически выполняется при смене языков местами.
tr: Çeviri, takas sonrasında otomatik olarak gerçekleştirilir.

source: Cache bug fixed.
ru: Исправлена ошибка кэша.
tr: Önbellek hatası düzeltildi.

source: Changes for 3.0 ##
ru: Изменения в версии 3.0 ##
tr: 3.0 için değişiklikler ##

source: Change way how Shortcuts are used, now you can press instantTranslate modifier key "NVDA+Shift+t", and then single letter key to perform some action (see all Commands in the "Shortcuts" section).
ru: Изменён способ использования команд, теперь вам нужно нажать клавишу-модификатор instantTranslate "NVDA+Shift+t", а затем клавишу одной буквы, чтобы выполнить некоторые действия (смотрите все комбинации клавиш в разделе "Команды").
tr: Kısayolların kullanım şekli değişti, şimdi "NVDA+Shift+t" anında Çeviri komut katmanı Kısayol tuşuna ve ardından çeşitli işlemleri gerçekleştirmek için ilgili komut tuşuna basabilirsiniz ("girdi hareketleri " bölümündeki tüm Komutlara bakın).

source: Implemented swapping languages.
ru: Реализована перемена языков местами.
tr: Takas dil seçeneği eklendi.

source: Changed configuration format, now we can change instant translate settings if we are in readonly pane, but remember that this will work before first restart of NVDA.
ru: Изменен формат конфигурации, теперь можно изменить настройки instant translate, находясь в области только для чтения, но помните, что это будет работать до первого перезапуска NVDA.
tr: Değiştirilen yapılandırma biçimi, şimdi salt okunur bölmesinde ise anında çeviri ayarları değiştirilebbilir, ancak bunun için NVDA'nın yeniden başlatılması gerektiğini unutmayın.

source: Removed limit on amount of text that can be translated.
ru: Убраны ограничение объёма переводимого текста.
tr: Çevrilebilecek metin miktarıyla ilgili sınır kaldırıldı.

source: Added shortcut t to the Instant Translate Settings menu item
ru: Добавлена клавиша быстрого доступа t к пункту меню настроек Instant Translate
tr: Anında Çeviri Ayarlar menü öğesi eklendi kısayol t

source: The auto option is now in first position in source combo, and absent in target combo.
ru: Опция автоопределения языка теперь находится только в списке выбора исходного языка, убрана из списка целевого.
tr: Otomatik seçeneği yalnızca kaynak dil seçim kutusunda bulunuyor.

source: Added a checkbox for configuring copying translation results.
ru: Добавлен флажок для настройки результата копирования перевода.
tr: Çeviri sonuçlarının kopyalanmasıyla ilgili bir onay kutusu eklendi.

source: Store config file in the root of settings folder.
ru: Файл конфигурации хранится в корневой папке пользовательских настроек.
tr: Yapılandırma dosyasını ayarlar klasörünün kök dizininde sakla.

source: Source and target languages syncronized with what Google Translate currently exposes (22 Apr 2015).
ru: Исходный и целевой языки синхронизированы с тем, что предоставляет Google Translate на текущий момент (22 Apr 2015).
tr: Kaynak ve hedef diller, Google Çeviri'nin şu anda sundukları ile senkronize edildi (22 Nisan 2015).

source: Changes for 2.1 ##
ru: Изменения в версии 2.1 ##
tr: 2.1 için değişiklikler ##

source: Now addon can translate text from clipboard when pressing nvda+shift+y.
ru: Теперь дополнение переводит текст из буфера обмена при нажатии nvda+shift+y.
tr: Artık eklenti, Shift+T tuşlarına basıldığında panodaki metni çevirebilir.

source: Changes for 2.0 ##
ru: Изменения в версии 2.0 ##
tr: 2.0 için değişiklikler ##

source: Added gui configurator where you can choose source and target languages.
ru: Добавлен диалог для выбора исходного и целевого языков.
tr: Kaynak ve hedef dilleri seçebileceğiniz gui yapılandırıcı eklendi.

source: Added addon menu item found under preferences menu.
ru: Добавлен пункт меню дополнения, находящийся в меню параметров.
tr: Tercihler menüsü altına eklenti menü öğesi eklendi.

source: Settings now is written in separate config file.
ru: Настройки теперь сохраняются в отдельный конфигурационный файл.
tr: Ayarlar şimdi ayrı bir yapılandırma dosyasına yazılıyor.

source: Translation results now automatically copies into the clipboard for future manipulations.
ru: Результат перевода теперь автоматически копируется в буфер обмена для последующих манипуляций.
tr: Çeviri sonuçları artık otomatik olarak gelecek kullanımlar için panoya kopyalanır.

source: Changes for 1.0 ##
ru: Изменения в версии 1.0 ##
tr: 1.0 için değişiklikler ##

source: Initial version.
ru: Начальная версия.
tr: İlk sürüm.
